EX10: PROC OPTIONS (MAIN);                                                     DCL A DEC FIXED INIT ( 5 );                                              DCL B BIT (16);                                              END EX10;                                                                           