EX10: PROC OPTIONS (MAIN);                                                      DCL A DEC FIXED INIT (10);                                                      DCL B BIT (16);                                                                 B = A;                                                                          END EX10;                                                                       