/*п╨п╬п╪п©п╦п╩я▐я├п╦я▐ п╦я│п©п╬п╩я▄п╥я┐я▐ -lncurses
п╫п╟п©я─п╦п╪п╣я─, gcc absgraph.c -o absgraph -lncurses
*/
#include <stdio.h>                                /*п©п╬п╢п╨п╩.п╠п╦п╠п╩.я└-п╧ я│я┌.п╡/п╡я▀п╡ */
#include <string.h>                               /*п©п╬п╢п╨п╩.п╠п╦п╠п╩.я└-п╧ я│я┌я─.я│п╦п╪п╡.*/
#include <stdlib.h>                               /*п©п╬п╢п╨п╩.п╠п╦п╠п╩.я└-п╧ п©я─п╣п╬п╠я─.п╢.*/
#include <ctype.h>                                /*п©п╬п╢п╨п╩.п╠п╦п╠п╩.я└-п╧ п©я─п╣п╬п╠я─.я│.*/
#include <curses.h>

#define  NSPIS  5                                 /*я─п╟п╥п╪.я│п©п╦я│п╨п╟ п╥п╟пЁя─.п©я─п╬пЁя─. */
#define  NOBJ   50                                /*я─п╟п╥п╪.п╪п╟я│я│.п╬п╠'п╣п╨я┌п╫я▀я┘ п╨п╟я─я┌*/
#define  DOBLZ  1024                              /*п╢п╩п╦п╫п╟ п╬п╠п╩п╟я│я┌п╦ п╥п╟пЁя─я┐п╥п╨п╦  */
#define  NOP 6                                    /*п╨п╬п╩-п╡п╬ п╬п╠я─п╟п╠п╟я┌я▀п╡п╟п╣п╪я▀я┘   */
						  /* п╨п╬п╪п╟п╫п╢                 */


char NFIL [30] = "\x0";

int  IOBJC   = 0;                                 /*п╦п╫п╢.п╡п╟п╨п╟п╫я┌п╫.я│я┌я─. OBJCARD*/
char OBJCARD [NOBJ][80];                          /*п╪п╟я│я│.я┘я─п╟п╫п╣п╫.п╬п╠'п╣п╨я┌п╫.п╨п╟я─я┌*/

int  ISPIS   = 0;                                 /*п╦п╫п╢.п╡п╟п╨п╟п╫я┌п╫.я│я┌я─. SPISOK */
char SPISOK  [NSPIS][80];                         /*п╪п╟я│я│.я┘я─п╟п╫п╣п╫.я│п©п╦я│п╨п╟ п©я─п╬пЁя─*/

WINDOW *wblue, *wgreen, *wred, *wcyan, *wmargenta;

struct STR_BUF_TXT                                /*я│я┌я─я┐п╨я┌.п╠я┐я└п╣я─п╟ п╨п╟я─я┌я▀ TXT */
 {
  unsigned char POLE1      ;                      /*п╪п╣я│я┌п╬ п╢п╩я▐ п╨п╬п╢п╟ 0x02     */
  unsigned char POLE2  [ 3];                      /*п©п╬п╩п╣ я┌п╦п©п╟ п╬п╠'п╣п╨я┌п╫.п╨п╟я─я┌я▀ */
  unsigned char POLE3      ;                      /*п©я─п╬п╠п╣п╩                  */
  unsigned char ADOP   [ 3];                      /*п╬я┌п╫п╬я│п╦я┌.п╟п╢я─п╣я│ п╬п©я─п╣п╟я├п╦п╦  */
  unsigned char POLE5  [ 2];                      /*п©я─п╬п╠п╣п╩я▀                 */
  unsigned char DLNOP  [ 2];                      /*п╢п╩п╦п╫п╟ п╬п©п╣я─п╟я├п╦п╦          */
  unsigned char POLE7  [ 2];                      /*п©я─п╬п╠п╣п╩я▀                 */
  unsigned char POLE71 [ 2];                      /*п╡п╫я┐я┌я─п╣п╫п╫п╦п╧ п╦п╢п╣п╫я┌.п©я─п╬пЁя─. */
  unsigned char OPER   [56];                      /*я┌п╣п╩п╬ п╬п©п╣я─п╟я├п╦п╦           */
  unsigned char POLE9  [ 8];                      /*п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я├п╦п╬п╫п╫п╬п╣ п©п╬п╩п╣  */
 };


union                                             /*п╬п©я─п╣п╢п╣п╩п╦я┌я▄ п╬п╠'п╣п╢п╦п╫п╣п╫п╦п╣  */
 {
  struct STR_BUF_TXT STR_TXT;                     /*я│я┌я─я┐п╨я┌я┐я─п╟ п╠я┐я└п╣я─п╟        */
  unsigned char BUF_TXT [80];                     /*п╠я┐я└п╣я─ п╨п╟я─я┌я▀ TXT         */
 } TXT;


unsigned char INST [6];                           /*п╪п╟я│я│п╦п╡, я│п╬п╢п╣я─п╤. п╬п╠я─п╟п╠п╟я┌.*/
						  /*п╨п╬п╪п╟п╫п╢я┐                 */


/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FRR();                                        /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RR-я└п╬я─п╪. */

/*..........................................................................*/

						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FRX();                                        /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RX-я└п╬я─п╪. */
/*..........................................................................*/


int X1 = 1;                                       /* п╦п╫п╦я├п╦п╟п╩п╦п╥п╟я├п╦я▐ п╨п╬п╬я─п╢.   */
int Y1 = 15;                                      /* п╫п╟ я█п╨я─п╟п╫п╣              */
int R1,                                           /*п╫п╬п╪п╣я─ 1-пЁп╬ я─п╣пЁп╦я│я┌я─п╟-п╬п©п╣-*/
						  /*я─п╟п╫п╢п╟ п╡ я└п╬я─п╪п╟я┌п╟я┘ RR п╦ RX*/
    R2,                                           /*п╫п╬п╪п╣я─ 2-пЁп╬ я─п╣пЁп╦я│я┌я─п╟-п╬п©п╣-*/
						  /*я─п╟п╫п╢п╟ п╡ я└п╬я─п╪п╟я┌п╣ RX      */
    D,                                            /*я│п╪п╣я┴п╣п╫п╦п╣ п╡ я└п╬я─п╪п╟я┌п╣ RX   */
    X,                                            /*п╫п╬п╪п╣я─ п╦п╫п╢п╣п╨я│п╫. я─п╣пЁп╦я│я┌я─п╟ */
						  /*п╡ я└п╬я─п╪п╟я┌п╣ RX            */
    B;                                            /*п╫п╬п╪п╣я─ п╠п╟п╥п╬п╡п╬пЁп╬ я─п╣пЁп╦я│я┌я─п╟ */
						  /*п╡ я└п╬я─п╪п╟я┌п╣ RX            */
unsigned long I,                                  /*я│я┤п╣я┌я┤п╦п╨ п╟п╢я─.я┌п╣п╨.п╨п╬п╪-п╢я▀  */
	      BAS_ADDR,                           /*п╟п╢я─п╣я│ п╫п╟я┤п╟п╩п╟ п╬п╠п╩.п╥п╟пЁя─я┐п╥.*/
	      I1,ADDR,ARG,VS;                     /*п╡я│п©п╬п╪п╬пЁп╟я┌п╣п╩я▄п╫я▀п╣ п©п╣я─п╣п╪.  */
unsigned long VR[16],                             /*п╪п╟я│я│п╦п╡,я│п╬п╢п╣я─п╤.п╥п╫п╟я┤.я─п╣пЁ. */
	      LIGHTPTR;                           /*п╟п╢я─п╣я│ п╫п╟я┤п╟п╩п╟ п╬п╠п╩.п╬я┌я│п╡п╣я┌.*/


int x,y,i,j,k,kk;                                 /*я─п╟п╠п╬я┤п╦п╣ п©п╣я─п╣п╪п╣п╫п╫я▀п╣      */

int CUR_IND;                                      /*п╦п╫п╢п╣п╨я│ п╪п╟я│я│.п╬п╠п╩.п╥п╟пЁя─.,  */
						  /*я│п╬п╬я┌п╡.я┌п╣п╨я┐я┴.п╨п╬п╪-п╢п╣ п©я─п╬пЁя─*/
int BAS_IND;                                      /*п╦п╫п╢п╣п╨я│ п╪п╟я│я│.п╬п╠п╩.п╥п╟пЁя─.,  */
						  /*я│п╬п╬я┌п╡.п©п╣я─п╡п╬п╧ п╨п╬п╪-п╢я▀ п©я─п╬пЁ*/

  union U1                                        /*п©п╬я│я┌п╬я▐п╫п╫п╟я▐ я┤п╟я│я┌я▄ я┬п╟п╠п╩п╬- */
   {                                              /*п╫п╟ п╬я┌я│п╡п╣я┌п╨п╦ я─п╣пЁп╦я│я┌я─п╬п╡ п╫п╟*/
    struct                                        /*я█п╨я─п╟п╫п╣ п╨п╬п╫я│п╬п╩п╦          */
     {
      char NOMREG  [ 3];
      char ZNEQUEL [1];
     } REGS_ASC [16];

    char BUFR [16][4];
   }R_ASC;

  union u2                                        /*я┬п╟п╠п╩п╬п╫ п╢п╩я▐ я─п╟я│я┤п╣я┌п╟      */
   {                                              /*я█п╩п╣п╪п╣п╫я┌п╬п╡ п╟п╠я│п╬п╩я▌я┌п╫п╬пЁп╬   */
    struct
     {
      unsigned int SMESH;
      unsigned int SEGM;
     } VAL_P;
   unsigned char *P_OBLZ ;
   } POINT;

  unsigned char OBLZ [DOBLZ] ;                    /*п╬п╠п╩п╟я│я┌я▄ п╥п╟пЁя─я┐п╥п╨п╦ я┌я─п╟я│-  */
						  /*я│п╦я─я┐п╣п╪п╬п╧ п©я─п╬пЁя─п╟п╪п╪я▀      */
/*
***** п╒п░п▒п⌡п≤п╕п░ п╪п╟я┬п╦п╫п╫я▀я┘ п╬п©п╣я─п╟я├п╦п╧
*/

 struct TMOP                                      /*я│я┌я─я┐п╨я┌.я│я┌я─.я┌п╟п╠п╩.п╪п╟я┬.п╬п©п╣я─*/
  {
   unsigned char MNCOP [5];                       /*п╪п╫п╣п╪п╬п╨п╬п╢ п╬п©п╣я─п╟я├п╦п╦       */
   unsigned char CODOP    ;                       /*п╪п╟я┬п╦п╫п╫я▀п╧ п╨п╬п╢ п╬п©п╣я─п╟я├п╦п╦   */
   unsigned char DLOP     ;                       /*п╢п╩п╦п╫п╟ п╬п©п╣я─п╟я├п╦п╦ п╡ п╠п╟п╧я┌п╟я┘ */
   int (*BXPROG)()        ;                       /*я┐п╨п╟п╥п╟я┌п╣п╩я▄ п╫п╟ п©п╬п╢п©я─.п╬п╠я─п╟п╠*/
  } T_MOP [NOP]  =                                /*п╬п╠'я▐п╡п╩п╣п╫п╦п╣ я┌п╟п╠п╩.п╪п╟я┬.п╬п©п╣я─*/
    {
{{'B' , 'A' , 'L' , 'R' , ' '} , '\x05', 2 , FRR},/*п╦п╫п╦я├п╦п╟п╩п╦п╥п╟я├п╦я▐           */
{{'B' , 'C' , 'R' , ' ' , ' '} , '\x07', 2 , FRR}, /*я│я┌я─п╬п╨                   */
{{'S' , 'T' , ' ' , ' ' , ' '} , '\x50', 4 , FRX}, /*я┌п╟п╠п╩п╦я├я▀                 */
{{'L' , ' ' , ' ' , ' ' , ' '} , '\x58', 4 , FRX}, /*п╪п╟я┬п╦п╫п╫я▀я┘                */
{{'A' , ' ' , ' ' , ' ' , ' '} , '\x5A', 4 , FRX}, /*п╬п©п╣я─п╟я├п╦п╧                */
{{'S' , ' ' , ' ' , ' ' , ' '} , '\x5B', 4 , FRX}, /*                        */
    };
//..........................................................................
//п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟ я─п╣п╟п╩п╦п╥п╟я├п╦п╦ я│п╣п╪п╟п╫я┌п╦п╨п╦ п╨п╬п╪п╟п╫п╢я▀ BALR
int P_BALR(void)
{
  if (R2 != 0)
    I = VR[R2];
  if (R1 != 0)
    VR[R1] = I;
    
  return 0;
}
//..........................................................................
//п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟ я─п╣п╟п╩п╦п╥п╟я├п╦п╦ я│п╣п╪п╟п╫я┌п╦п╨п╦ п╨п╬п╪п╟п╫п╢я▀ BCR я│ п╪п╟я│п╨п╬п╧ 15
int P_BCR(void)
{
  int ret;
  
  ret = 1;
  if (R1 == 15)
  {
    ret = 0;
    if ((VR[R2] != 0) && (R2 != 0))
      I = VR[R2];
    else
    {
      if (R2 != 0)
      {
        waddstr(wcyan, "п©п╣я─п╣я┘п╬п╢ п©п╬ п╟п╢я─п╣я│я┐ = 0 п╦п╩п╦ п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ я┌я─п╟я│я│п╦я─п╬п╡п╨п╦ п©я─п╬пЁя─п╟п╪п╪я▀ п©п╬я│п╩п╣ п╫п╟п╤п╟я┌п╦я▐ п╨п╩п╟п╡п╦я┬п╦");
	wrefresh(wcyan);
	ret = 1;
      }
    }
  }  

  return ret;
}
/*..........................................................................*/

int P_ST()                                        /*  п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟     */
						  /*я─п╣п╟п╩п╦п╥п╟я├п╦п╦ я│п╣п╪п╟п╫я┌п╦п╨п╦    */
 {                                                /*п╨п╬п╪п╟п╫п╢я▀ ST              */
  int sm,i;                                       /*я─п╟п╠п╬я┤п╦п╣                 */
  char bytes[4];                                  /*п©п╣я─п╣п╪п╣п╫п╫я▀п╣              */

  ADDR = VR[B] + VR[X] + D;                       /*п╡я▀я┤п╦я│п╩п╣п╫п╦п╣ п╟п╠я│.п╟п╢я─п╣я│п╟ п╦ */
  sm = (int) (ADDR -I);                           /*я│п╪п╣я┴п╣п╫п╦я▐                */

  bytes[0] = (VR[R1] -                            /*п©я─п╣п╬п╠я─п╟п╥п╬п╡п╟п╫п╦п╣ я│п╬п╢п╣я─п╤п╦п╪.*/
		VR[R1]% 0x1000000L)/0x1000000L;   /*п═п·п², п╦я│п©п╬п╩я▄п╥п╬п╡п╟п╫п╫п╬пЁп╬ п╡  */
  bytes[1] = ((VR[R1] -                           /*п╨п╟я┤п╣я│я┌п╡п╣ п©п╣я─п╡п╬пЁп╬ п╬п©-п╢п╟, */
		VR[R1]%0x10000L)/0x10000L)%0x100; /*п╨ п╡п╦п╢я┐, п©я─п╦п╫я▐я┌п╬п╪я┐ п╡     */
  bytes[2] = ((VR[R1] % 0x10000L) -               /*п∙п║ п╜п▓п°                  */
		((VR[R1]%0x10000L)%0x100))/0x100; /*                        */
  bytes[3] = (VR[R1] % 0x10000L) % 0x100;         /*                        */

  for (i=0; i<4; i++)                             /*п╥п╟п©п╦я│я▄ п©я─п╣п╬п╠я─п╟п╥п╬п╡п╟п╫п╬пЁп╬  */
   OBLZ[BAS_IND + CUR_IND + sm + i] = bytes[i];   /*п╥п╫п╟я┤п╣п╫п╦я▐ п©п╬ п╟п╢я─п╣я│я┐ 2-пЁ  */
						  /*п╬п©п╣я─п╟п╫п╢п╟                */
  return 0;                                       /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©я─п╬пЁя─.  */
 }

/*..........................................................................*/

int P_L()                                         /*  п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟     */
						  /*я─п╣п╟п╩п╦п╥п╟я├п╦п╦ я│п╣п╪п╟п╫я┌п╦п╨п╦    */
 {                                                /*п╨п╬п╪п╟п╫п╢я▀ L               */
   int sm;                                        /*я─п╟п╠п╬я┤п╟я▐ п©п╣я─п╣п╪п╣п╫п╫п╟я▐      */

   ADDR = VR[B] + VR[X] + D;                      /*п╡я▀я┤п╦я│п╩п╣п╫п╦п╣ п╟п╠я│.п╟п╢я─п╣я│п╟ п╦ */
   sm = (int) ( ADDR - I );                       /*я│п╪п╣я┴п╣п╫п╦я▐                */
   VR[R1] =                                       /*п©я─п╣п╬п╠я─п╟п╥п╬п╡п╟п╫п╦п╣ я│п╬п╢п╣я─п╤п╦п╪.*/
    OBLZ[BAS_IND + CUR_IND + sm] * 0x1000000L +   /*п╡я┌п╬я─п╬пЁп╬ п╬п©п╣я─п╟п╫п╢п╟ п╨ п╡п╦п╢я┐,*/
    OBLZ[BAS_IND + CUR_IND + sm + 1] * 0x10000L + /*п©я─п╦п╫я▐я┌п╬п╪я┐ п╡ IBM PC, п╦   */
    OBLZ[BAS_IND + CUR_IND + sm + 2] * 0x100 +    /*п╥п╟п©п╦я│я▄ п╡ п═п·п², п╦я│п©п╬п╩я▄п╥.п╡ */
    OBLZ[BAS_IND + CUR_IND + sm + 3];             /*п╨п╟я┤п╣я│я┌п╡п╣ 1-пЁп╬ п╬п©п╣я─п╟п╫п╢п╟  */

   return 0;                                      /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©я─п╬пЁя─.  */
 }

/*..........................................................................*/

int P_A()                                         /*  п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟     */
						  /*я─п╣п╟п╩п╦п╥п╟я├п╦п╦ я│п╣п╪п╟п╫я┌п╦п╨п╦    */
 {                                                /*п╨п╬п╪п╟п╫п╢я▀ A               */
  int sm;                                         /*я─п╟п╠п╬я┤п╟я▐ п©п╣я─п╣п╪п╣п╫п╫п╟я▐      */

  ADDR = VR[B] + VR[X] + D;                       /*п╡я▀я┤п╦я│п╩п╣п╫п╦п╣ п╟п╠я│.п╟п╢я─п╣я│п╟ п╦ */
  sm = ( int ) ( ADDR -I );                       /*я│п╪п╣я┴п╣п╫п╦я▐                */
  ARG = OBLZ[BAS_IND + CUR_IND + sm] * 0x1000000L+/*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ я│п╬п╢п╣я─п╤п╦п╪п╬пЁп╬*/
   OBLZ[BAS_IND + CUR_IND + sm + 1] * 0x10000L +  /*п╡я┌п╬я─п╬пЁп╬ п╬п©п╣я─п╟п╫п╢п╟ п╡ я│п╬пЁ- */
   OBLZ[BAS_IND + CUR_IND + sm + 2] * 0x100 +     /*п╩п╟я┬п╣п╫п╦я▐я┘ п∙п║ п╜п▓п°         */
   OBLZ[BAS_IND + CUR_IND + sm + 3];              /*                        */
						  /*п╦                       */
  VR[R1] = VR[R1] + ARG;                          /*я│п╩п╬п╤п╣п╫п╦п╣ я│ 1-п╪ п╬п©п╣я─п╟п╫п╢п╬п╪*/

  return 0;                                       /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬. п©я─п╬пЁя─. */
 }

/*..........................................................................*/

int P_S()                                         /* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
						  /* я─п╣п╟п╩п╦п╥п╟я├п╦п╦ я│п╣п╪п╟п╫я┌п╦п╨п╦   */
 {                                                /* п╨п╬п╪п╟п╫п╢я▀ S              */
  int sm;                                         /*я─п╟п╠п╬я┤п╟я▐ п©п╣я─п╣п╪п╣п╫п╫п╟я▐      */

  ADDR = VR[B] + VR[X] + D;                       /*п╡я▀я┤п╦я│п╩п╣п╫п╦п╣ я─п╟п╠п╬я┤п╣пЁп╬     */
  sm = ( int ) ( ADDR - I );                      /*п╟п╢я─п╣я│п╟ п╦ я│п╪п╣я┴п╣п╫п╦я▐       */

  ARG = OBLZ[BAS_IND + CUR_IND + sm] * 0x1000000L+/*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ я│п╬п╢п╣я─п╤п╦п╪п╬пЁп╬*/
     OBLZ[BAS_IND + CUR_IND + sm + 1] * 0x10000L +/*п╡я┌п╬я─п╬пЁп╬ п╬п©п╣я─п╟п╫п╢п╟ п╡ я│п╬пЁ- */
     OBLZ[BAS_IND + CUR_IND + sm + 2] * 0x100 +   /*п╩п╟я┬п╣п╫п╦я▐я┘ п∙п║ п╜п▓п°         */
     OBLZ[BAS_IND + CUR_IND + sm + 3];            /*                        */
						  /* п╦                      */
  VR[R1] = VR[R1] - ARG;                          /*п╡я▀я┤-п╦п╣ п╦п╥ 1-пЁп╬ п╬п©п╣я─п╟п╫п╢п╟ */

  return 0;                                       /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©я─п╬пЁя─.  */
 }


//..........................................................................
int FRR(void)
{
  int i, j;
  
  for (i = 0; i < NOP; i++)
  {
    if (INST[0] == T_MOP[i].CODOP)
    {
      waddstr(wgreen, "      ");
      for (j = 0; j < 5; j++)
        waddch(wgreen, T_MOP[i].MNCOP[j]);
      waddstr(wgreen, " "); 
      
      j = (INST[1] - (INST[1] % 0x10)) / 0x10;
      R1 = j;
      wprintw(wgreen, "%1d, ", j);
      j = INST[1] % 0x10;
      R2 = j;
      wprintw(wgreen, "%1d\n", j);
      break;
    }
  }

  return 0; 
}
//...........................................................................
int FRX(void)
{
  int i, j;
  
  for (i = 0; i < NOP; i++)
  {
    if (INST[0] == T_MOP[i].CODOP)
    {
      waddstr(wgreen, "  ");
      for (j = 0; j < 5; j++)
        waddch(wgreen, T_MOP[i].MNCOP[j]);
      waddstr(wgreen, " ");
      
      j = INST[1] >> 4;
      R1 = j;
      wprintw(wgreen, "%.1d, ", j);
      
      j = INST[2] % 16;
      j = j * 256 + INST[3];
      D = j;
      wprintw(wgreen, "X'%.3X'(", j);
      
      j = INST[1] % 16;
      X = j;
      wprintw(wgreen, "%1d, ", j);
      
      j = INST[2] >> 4;
      B = j;
      wprintw(wgreen, "%1d)", j);
      
      ADDR = VR[B] + VR[X] + D;
      wprintw(wgreen,"        %.06lX       \n", ADDR);
      if (ADDR % 4 != 0)
        return (7);
      break;
    }
  }

  return 0;
} 

//...........................................................................   
//---------------------------------------------------------------------------
int wind(void)
{
  int j1, k, temp;
  
  x = 0;
  y = 16;
   
  kk = CUR_IND;
  LIGHTPTR = I1;
  
  for (j1 = 0; j1 < 8; j1++)
  {
    wprintw(wred, "%.06lX: ", I1);	
    for (j = 0; j < 4; j++)
    {
      for (k = 0; k < 4; k++)
	wprintw(wred, "%.02X", OBLZ[BAS_IND + kk + j * 4 + k]);
      waddstr(wred, " ");
    }

    waddstr(wred, "/* ");
    for (j = 0; j < 16; j++)
    {
      if (isprint (OBLZ[BAS_IND + kk]) )  
      {
	waddch(wred, OBLZ[BAS_IND + kk++]);
	wrefresh(wred);
      }	
      else 
      {
        waddstr(wred, ".");
	kk++;
      }
    }

    waddstr(wred, " */");
    I1 += 16;
  }
  wrefresh(wred);			//п╡я▀п╡п╬п╢ п╫п╟ я█п╨я─п╟п╫
  wclear(wred);				//п╬я┤п╦я│я┌п╨п╟ я│п╬п╢п╣я─п╤п╦п╪п╬пЁп╬ п╬п╨п╫п╟ п╢п╟п╪п©п╟
  
  return 0;
}
//---------------------------------------------------------------------------
//п©я─п╬пЁя─п╟п╪п╪п╟ п©п╬п╨п╬п╪п╟п╫п╢п╫п╬п╧ п╦п╫я┌п╣я─п©я─п╣я┌п©я├п╦п╦(п╬я┌п╩п╟п╢п╨п╦)
// п╥п╟пЁя─я┐п╤п╣п╫п╫п╬п╧ п©я─п╬пЁя─п╟п╪п╪я▀
int sys(void) 			
{
  int res, temp;
  int ch;
  int gr_pos_x, gr_pos_y;
  int ii = 0, jj = 0;
  int gr_y;
  char wstr[80];
  int zizi = 0, tempI;
  
  
  I = BAS_ADDR;			//я┐я│я┌п╟п╫п╬п╡п╦я┌я▄ я┌п╣п╨я┐я┴п╦п╧ п╟п╢я─п╣я│
  				//я─п╟п╡п╫я▀п╧ п╫п╟я┤п╟п╩я▄п╫п╬п╪я┐
//п╫п╦п╤п╫п╣п╣ п©п╬п╩п╣     
  wmargenta = newwin(1, 80, 24, 0);
  wbkgd(wmargenta, COLOR_PAIR(COLOR_MAGENTA));
  waddstr(wmargenta, "\"PgUp\",\"PgDn\",\"Up\",\"Down\"->п©я─п╬я│п╪п╬я┌я─ п╢п╟п╪п©п╟; \"Enter\"->п╡я▀п©п╬п╩п╫п╦я┌я▄ п╬я┤п╣я─п╣п╢п╫я┐я▌ п╨п╬п╪п╟п╫п╢я┐");
      
//я│я┌я─п╬п╨п╟ я│п╬я│я┌п╬я▐п╫п╦я▐
  wcyan = newwin(1, 80, 23, 0);
  wbkgd(wcyan, COLOR_PAIR(COLOR_CYAN));
  
//п╢п╟п╪п© п╬п╠п╩п╟я│я┌п╦ п╥п╟пЁя─я┐п╥п╨п╦
  wred = newwin(8, 67, 15, 0);
  wbkgd(wred, COLOR_PAIR(COLOR_RED));
  
//п©п╬п╩п╣ я─п╣пЁп╦я│я┌я─п╬п╡
  wblue = newwin(16, 12, 0, 68);
  wbkgd(wblue, COLOR_PAIR(COLOR_BLUE));
  
//я┌п╣п╨я│я┌  
  gr_pos_x = 0;
  gr_pos_y = 14; 
  gr_y = 11;
  wgreen = newwin(gr_y, 67, gr_pos_y, gr_pos_x);	//я│п╬п╥п╢п╟п╢п╦п╪ п╫п╬п╡п╬п╣ п╬п╨п╫п╬
  wbkgd(wgreen, COLOR_PAIR(COLOR_GREEN));	//п╡я▀п╠п╬я─ я├п╡п╣я┌п╬п╡п╬п╧ п©п╟я─я▀
  
 
  keypad(wmargenta, TRUE);				//я─п╟п╥я─п╣я┬п╦я┌я▄ п©я─п╣п╬п╠я─п╟п╥п╬п╡п╟п╫п╦п╣ п╨п╬п╢п╬п╡ п╨п╩п╟п╡п╦п╟я┌я┐я─я▀

BEGIN:  

//п╡я│п╣ п╢п╬п©я┐я│я┌п╦п╪я▀п╣ п╨п╬п╢я▀ п╨-п╫п╢ я│я─п╟п╡п╫п╦я┌я▄ я│ я┌п╣п╨я┐я┴п╣п╧ п╦ п©я─п╦ 
//я│п╬п╡п©п╟п╢п╣п╫п╦п╦п╥п╟п©п╬п╪п╫п╦я┌я▄ п╫п╬п╪п╣я─ я│я┌я─п╬п╨п╦ я┌п╟п╠п╩п╦я├я▀ п╬п©п╣я─п╟я├п╦п╧
  for (i = 0; i < NOP; i++)
  {
    if (OBLZ[BAS_IND + CUR_IND] == T_MOP[i].CODOP)
    {
      k = i;
      wprintw(wgreen, "%.06lX: ", I);
//я─п╦я│я┐п╣п╪ п╬п╨п╫п╬, п╡я▀п╡п╬п╢п╦п╪ я┌п╣п╨я│я┌
      for (j = 0; j < 6; j++)                     /*                        */
      {                                        /*                        */
        if (j < T_MOP[i].DLOP)                  /*                        */
        {                                      /* п╡я▀п╢п╟я┌я▄ я┬п╣я│я┌п╫п╟п╢я├п╟я┌п╣я─п╦я┤п╫.*/
	     wprintw(wgreen, "%.02X", OBLZ[BAS_IND + CUR_IND + j]);
						  /* п╥п╟п©п╬п╪п╫п╦я┌я▄ п╣пЁп╬ п╤п╣ п╡     */
        INST[j] =                                   /* п©п╣я─п╣п╪п╣п╫п╫п╬п╧ INST,       */
  		     OBLZ [BAS_IND + CUR_IND + j];/*                        */
        }                                      /*                        */
        else INST [j] = '\x00';                     /*                        */
      }
      if ((res = T_MOP[i].BXPROG()) != 0)    /* я┐п╧я┌п╦ п╡ п©я─п╬пЁя─п╟п╪п╪я┐ п╬я┌п╬п╠я─.*/
	return (res);   			  /* п╟я│я│п╣п╪п╠п╩п╣я─п╫п╬пЁп╬ я█п╨п╡п╦п╡п╟п╩п╣-*/
						  /* п╫я┌п╟ я┌п╣п╨я┐я┴п╣п╧ п╨п╬п╪п╟п╫п╢я▀,   */
						  /*                        */
	goto l0;                                  /* п©п╣я─п╣п╧я┌п╦ п╨ п╢п╟п╩я▄п╫п╣п╧я┬п╣п╧  */
    }                  
  }
  return (6);
  
l0:
//я│п╢п╡п╦пЁ п╬п╨п╫п╟ п╡п╡п╣я─я┘
  wrefresh(wgreen);
  ii++;
  if (gr_pos_y > 14 - gr_y + 1)
    mvwin(wgreen, gr_pos_y--, gr_pos_x);
//п©я─п╦ п╢п╬я│я┌п╦п╤п╣п╫п╦п╦ п╫п╣п╨п╬я┌п╬я─п╬пЁп╬ п©п╬п╩п╬п╤п╣п╫п╦я▐, п╢п╡п╦п╤п╣п╫п╦п╣ п╬я│я┌п╟п╫п╟п╡п╩п╦п╡п╟п╣я┌я│я▐, п╦ п©я─п╬п╦п╥п╡п╬п╢п╦я┌я│я▐ 
//п©я─п╬п╨я─я┐я┌п╨п╟ п╬п╨п╫п╟
  else
  {
      for (jj = 0; jj < gr_y - 1; jj++)
      {
        temp = mvwinnstr(wgreen, jj + 1, 0, wstr, 67);    
        mvwaddnstr(wgreen, jj, 0, wstr, 67);
        wrefresh(wgreen);
      }
  } 
  wrefresh(wgreen);
  
  I += T_MOP[k].DLOP;                            /*п╨п╬я─я─п╣п╨я├п╦я▐ я│я┤п╣я┌-п╨п╟.п╟п╢я─п╣я│п╟*/
  CUR_IND = ( int ) ( I - BAS_ADDR );            /*я┐я│я┌-п╨п╟ я┌п╣п╨я┐я┴. п╦п╫п╢п╣п╨я│п╟   */
						  /*п╡ п╪п╟я│я│п╦п╡п╣ OBLZ          */
  I1 = I;                                        /*я┐я│я┌п╟п╫п╬п╡п╨п╟ п╟п╢я─п╣я│п╟ п╫п╟я┤п╟п╩п╟ */
						  /*п╬п╠п╩п╟я│я┌п╦ п╬я┌я│п╡п╣я┌п╨п╦        */
      
  for ( i = 0; i < 16; i++)
  {
    if (i < 10)
      waddstr(wblue, "R0");
    else 
      waddstr(wblue, "R");
    wprintw(wblue, "%d:", i);
    wprintw(wblue, "%.08lX", VR[i]);
  }      
  wrefresh(wblue);			//п╡я▀п╡п╬п╢ п╫п╟ я█п╨я─п╟п╫		  
  wclear(wblue);			//п╬я┤п╦я│я┌п╨п╟ п╬п╨п╫п╟ я─п╣пЁп╦я│я┌я─п╬п╡
  wind();   
      
  waddstr(wcyan, "пЁп╬я┌п╬п╡п╫п╬я│я┌я▄ п╨ п╡я▀п©п╬п╩п╫п╣п╫п╦я▌ п╬я┤п╣я─п╣п╢п╫п╬п╧ п╨п╬п╪п╟п╫п╢я▀ я│ п╟п╢я─п╣я│п╬п╪ ");
  wprintw(wcyan, "%.06lX", I - T_MOP[k].DLOP);
  waddstr(wcyan, "\n");    				
  wrefresh(wcyan);
  wclear(wcyan);

WAIT:
  
  CUR_IND = (int)(I - BAS_ADDR);

  ch = wgetch(wmargenta);

  switch (ch)
  {
    case 10:
    {
      goto SKIP;
    }
    
    case  KEY_UP:
    {
      I1 = LIGHTPTR - 16;
      CUR_IND = (int)(I1 - BAS_ADDR);
      wind();
      goto WAIT;
    }
    
    case  KEY_DOWN:
    {
      I1 = LIGHTPTR + 16;
      CUR_IND = (int)(I1 - BAS_ADDR);
      wind();
      goto WAIT;      
    }
    
    case  KEY_PPAGE:
    {
      I1 = LIGHTPTR - 128;
      CUR_IND = (int)(I1 - BAS_ADDR);
      wind();
      goto WAIT;
    }
    
    case  KEY_NPAGE:
    {
      I1 = LIGHTPTR + 128 ;
      CUR_IND = (int)(I1 - BAS_ADDR);
      wind();
      goto WAIT;
    }
  }
goto WAIT;

SKIP:

   switch (T_MOP[k].CODOP)                        //я│п╬пЁп╩п╟я│п╫п╬  п╨п╬п╢я┐ п╨п╬п╪п╟п╫п╢я▀, 
   {                                              //я│п╣п╩п╣п╨я┌п╦я─я┐п╣п╪п╬п╧ я│я┤.п╟п╢я─п╣я│п╟ 
						  //п╡я▀п╠я─п╟я┌я▄ п©п╬п╢п©я─п╬пЁя─.п╦п╫я┌п╣я─- 
    case '\x05' : P_BALR();                       //п©я─п╣я┌п╟я├п╦п╦ я│п╣п╪п╟п╫я┌п╦п╨п╦      
		   break;                         //я┌п╣п╨я┐я┴п╣п╧ п╨п╬п╪п╟п╫п╢я▀        
    case '\x07' : { i = P_BCR();
		    getch();
		    if (i == 1)
		     return 8;
		  }
		   break;
    case '\x50' : P_ST();
		   break;
    case '\x58' : P_L();
		   break;
    case '\x5A' : P_A();
		   break;
    case '\x5B' : P_S();
   }
   
   goto BEGIN;	
   
   delwin(wblue);			  
   delwin(wred);
   delwin(wgreen);
   delwin(wmargenta);

  return 0;
}
//...........................................................................
//..........................п≤п╫п╦я├п╦п╟п╩п╦п╥п╟я├п╦я▐ curses..............................
int InitCurses(void)
{
  initscr();					//п╦п╫п╦я├п╦п╟п╩п╦п╥п╟я├п╦я▐ п╠п╦п╠п╩п╦п╬я┌п╣п╨п╦ curses
  curs_set(0);
  noecho();					//п╫п╣ п©п╬п╨п╟п╥я▀п╡п╟я┌я▄ п╡п╡п╬п╢
  cbreak();					//я┤п╦я┌п╟я┌я▄ п╬п╢п╦п╫ я│п╦п╪п╡п╬п╩ 
                                                //п╥п╟ я─п╟п╥, п╫п╣ п╤п╢п╟я┌я▄ \n
  keypad(stdscr, TRUE);				//я─п╟п╥я─п╣я┬п╦я┌я▄ п©я─п╣п╬п╠я─п╟п╥п╬п╡п╟п╫п╦п╣ п╨п╬п╢п╬п╡ п╨п╩п╟п╡п╦п╟я┌я┐я─я▀
  start_color(); 

  
  if (has_colors())
  {
    init_pair(COLOR_BLUE, COLOR_WHITE, COLOR_BLUE);
    init_pair(COLOR_GREEN, COLOR_BLACK, COLOR_GREEN);
    init_pair(COLOR_RED, COLOR_WHITE, COLOR_RED);
    init_pair(COLOR_CYAN, COLOR_BLACK, COLOR_CYAN);
    init_pair(COLOR_MAGENTA, COLOR_WHITE, COLOR_MAGENTA);
  }

  
  return 0;
}
//...........................................................................

int main( int argc, char **argv )                /* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
						  /*п╟п╠я│п╬п╩я▌я┌п╫п╬пЁп╬ п╥п╟пЁя─я┐п╥я┤п╦п╨п╟  */
						  /*п╬п╠'п╣п╨я┌п╫я▀я┘ я└п╟п╧п╩п╬п╡        */
{
  int  I,K,N,J0,res;                              /*я─п╟п╠п╬я┤п╦п╣                 */
  unsigned long J;                                /*п©п╣я─п╣п╪п╣п╫п╫я▀п╣              */
  FILE *fp;                                       /*п©я─п╬пЁя─п╟п╪п╪я▀               */
  char *ptr;

//main programm


  if ( argc != 2 )
  {
    printf ( "%s\n", "п·я┬п╦п╠п╨п╟ п╡ п╨п╬п╪п╟п╫п╢п╫п╬п╧ я│я┌я─п╬п╨п╣" );
    return -1;
  }
 
  ptr = argv[1];
  strcpy ( NFIL, ptr );

  if ( strcmp ( &NFIL [ strlen ( NFIL )-3 ], "mod" ) )
  {
    goto ERR9;
    return -1;
  }
  
  if ((fp = fopen(NFIL,"rt")) == NULL)
    goto ERR1;                                     /*я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬п╦п╠п╨п╣     */
  else
  {
    while ( !feof( fp ) )                         /*я┤п╦я┌п╟я┌я▄ п╡я│п╣ п╨п╟я─я┌я▀ я└п╟п╧п╩п╟  */
     {                                            /*я│п╬ я│п©п╦я│п╨п╬п╪              */
      fgets ( SPISOK [ISPIS++] , 80 , fp );       /*п╡ п╪п╟я│я│п╦п╡ SPISOK         */
      if ( ISPIS == NSPIS )                       /*п╣я│п╩п╦ я█я┌п╬я┌ п╪п╟я│я│п╦п╡ п©п╣я─п╣-  */
       {                                          /*п©п╬п╩п╫п╣п╫, я┌п╬:             */
	fclose ( fp );                            /*п╥п╟п╨я─я▀я┌я▄ я└п╟п╧п╩ я│п╬ я│п©п╦я│п╨п╬п╪ */
	goto ERR4;                                /*п╦ п╡я▀п╢п╟я┌я▄ я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬*/
       }
     }
    fclose ( fp );                                /*п╥п╟п╨я─я▀я┌я▄ я└п╟п╧п╩ SPISOK     */

    if ( ISPIS == 0 )                             /*п╣я│п╩п╦ я│п©п╦я│п╬п╨ п©я┐я│я┌п╬п╧п╠     */
						  /*я┌п╬:                     */
     goto ERR2;                                   /* я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬п╦п╠п╨п╣    */
    else                                          /*п╦п╫п╟я┤п╣:                  */
     goto CONT1;                                  /* п©я─п╬п╢п╬п╩п╤п╦я┌я▄ п╬п╠я─п╟п╠п╬я┌п╨я┐   */
   }

CONT1:

  for ( I = 0; I < ISPIS; I++ )                   /*п©п╣я─п╣п╠п╦я─п╟я▐ п╡я│п╣ я│п╬п╠п╦я─п╟п╣п╪я▀п╣*/
   {      
                                      /*п╬п╠'п╣п╨я┌п╫я▀п╣ я└п╟п╧п╩я▀,        */
    if ((fp = fopen(SPISOK[I], "rb" )) ==  NULL)                                          
      goto ERR3;                                   /*                        */
    else                                          /* п╦п╫п╟я┤п╣:                 */
     {                                          /*                        */
      while ( !feof( fp) )                        /*  я┤п╦я┌п╟я┌я▄ я└п╟п╧п╩ п╢п╬ п╨п╬п╫я├п╟, */
       {                                          /*  я─п╟п╥п╪п╣cя┌п╦я┌я▄ п╥п╟п©п╦я│п╦ п╡   */   
	fread ( OBJCARD [IOBJC++] , 80 , 1 , fp );/*  п╪п╟я│я│п╦п╡п╣ OBJCARD п╦,п╣я│п╩п╦*/
	if ( IOBJC == NOBJ )                      /*  я│я┤п╦я┌п╟п╫я▀ п╫п╣ п╡я│п╣ п╥п╟п©п╦я│п╦,*/
	 {                                        /*  я┌п╬:                   */
	  fclose ( fp );                          /*   п╡я▀п╢п╟я┌я▄ я│п╬п╬п╠я┴.п╬п╠ п╬я┬п╦п╠.*/
	  goto ERR5;                              /*                        */
	 }                                                              
       }                                          /*                        */
      fclose ( fp );                              /*  п╥п╟п╨я─я▀я┌я▄ п╬я┤п╣я─п╣п╢п╫п╬п╧ я└п╟п╧п╩*/
       
      goto CONT2;                                 /*  п╦ п©я─п╬п╢п╬п╩п╤п╦я┌я▄ п╬п╠я─п╟п╠п╬я┌п╨я┐*/
     }
   }
       
CONT2:

  POINT.P_OBLZ = OBLZ;                            /*я─п╟я│я┤п╦я┌п╟я┌я▄ п╟п╠я│п╬п╩я▌я┌п╫я▀п╧    */
  J = POINT.VAL_P.SEGM ;                          /*п╟п╢я─п╣я│ п╬п╠п╩п╟я│я┌п╦ п╥п╟пЁя─я┐п╥п╨п╦  */
  J = J << 4;                                     /*OBLZ п╡ п©п╣я─п╣п╪п╣п╫п╫п╬п╧ J     */
  J += POINT.VAL_P.SMESH;

  if ( ( J0 = (int) J%8 ) == 0 )                  /*п╡я▀я─п╬п╡п╫я▐я┌я▄ п©п╬п╩я┐я┤п╣п╫п╫п╬п╣    */
   {
    BAS_ADDR = J;                                 /*п╥п╫п╟я┤п╣п╫п╦п╣ п╫п╟ пЁя─п╟п╫п╦я├я┐     */
    BAS_IND  = 0;
   }
  else                                            /*п╢п╡п╬п╧п╫п╬пЁп╬ я│п╩п╬п╡п╟ п╦ п╥п╟п©п╬п╪п╫.*/
   {
    BAS_ADDR = ( ( J >> 3 ) + 1 ) << 3;           /*п╣пЁп╬ п╡ п©п╣я─п╣п╪.BAS_ADDR,п╟  */
    BAS_IND = 8 - J0;                             /*я│п╬п╬я┌п╡.п╦п╫п╢п╣п╨я│ п╪п╟я│я│.OBLZ-п╡*/
   }						  /*п©п╣я─п╣п╪.BAS_IND           */

  for ( I = 0; I < IOBJC; I++ )                   /*п©п╣я─п╣п╠п╦я─п╟я▐ п╡я│п╣ я│я┤п╦я┌п╟п╫п╫я▀п╣ */
   {                                              /*п╨п╟я─я┌я▀ п╬п╠'п╣п╨я┌п╫я▀я┘ я└п╟п╧п╩п╬п╡, */
    if ( !memcmp ( &OBJCARD [I][1] , "TXT" , 3 ) )/*п╬я┌п╬п╠я─п╟я┌я▄ п©я─п╦п╫п╟п╢п╩.п╨ я┌п╦п©я┐ */
     {                                            /*TXT п╦ я─п╟я│я┤п╦я┌п╟я┌я▄:        */
      memcpy ( TXT.BUF_TXT , OBJCARD [I] , 80 );  /*                        */
      J = TXT.STR_TXT.ADOP [0];                   /* п╡ п©п╣я─п╣п╪п╣п╫п╫п╬п╧ J п╫п╟я┤п╟п╩я▄п╫.*/
      J = (J << 8) + TXT.STR_TXT.ADOP [1];        /*  п╦п╫п╢п╣п╨я│ п╥п╟пЁя─я┐п╥п╨п╦ п╡ п╪п╟я│-*/
      J = (J << 8) + TXT.STR_TXT.ADOP [2];        /*  я│п╦п╡п╣ OBLZ             */
      J += BAS_IND;                               /*п╦                       */
						  /*                        */
      K = TXT.STR_TXT.DLNOP [0];                  /* п╡ п©п╣я─п╣п╪п╣п╫п╫п╬п╧ K п╢п╩п╦п╫я┐   */
      K = (K << 8) + TXT.STR_TXT.DLNOP [1];       /* п╥п╟пЁя─я┐п╤п╟п╣п╪я▀я┘ п╢п╟п╫п╫я▀я┘     */

      for ( N=0; N < K; N++ )                     /*п╥п╟пЁя─я┐п╥п╦я┌я▄ п╢п╟п╫п╫я▀п╣ я│ п╬я┤п╣я─.*/
       OBLZ [ (int) J++ ] = TXT.STR_TXT.OPER [N]; /*п╬п╠'п╣п╨я┌п╫п╬п╧ п╨п╟я─я┌я▀         */
     }
   }
   



  InitCurses();

  res = sys(); 
  
  switch (res)
  {
    case 6: 
    {
      endwin();
      goto ERR6;
    }
    case 7:
    {
      endwin();
      goto ERR7;
    }
    case 8:
    {
      endwin();
      goto ERR8;
    }
  }
  
  endwin(); 
  END:
  printf ("\n%s\n", "п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ п╬п╠я─п╟п╠п╬я┌п╨п╦");

  return 0;
//п▒ п⌡ п· п   п╡я▀п╢п╟я┤п╦ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤п╣я│п╨п╦я┘ я│п╬п╬п╠я┴п╣п╫п╦п╧
ERR1:
  printf ("%s%s\n", "п╬я┬п╦п╠п╨п╟ п╬я┌п╨я─я▀я┌п╦я▐ я└п╟п╧п╩п╟ я│п╬ я│п©п╦я│п╨п╬п╪ я│п╬п╠п╦я─п╟п╣п╪я▀я┘ ", "п╪п╬п╢я┐п╩п╣п╧");
  goto END;

ERR2:
  printf ("%s\n", "п©я┐я│я┌п╬п╧ я└п╟п╧п╩ я│п╬ я│п©п╦я│п╨п╬п╪ я│п╬п╠п╦я─п╟п╣п╪я▀я┘ п╪п╬п╢я┐п╩п╣п╧");
  goto END;

ERR3:
  printf ("%s: %s\n" ,
   "п╬я┬п╦п╠п╨п╟ п╬я┌п╨я─я▀я┌п╦я▐ я└п╟п╧п╩п╟" , SPISOK [I] );
  goto END;

ERR4:
  printf ("%s\n" ,
   "п©п╣я─п╣п©п╬п╩п╫п╣п╫п╦п╣ я│п©п╦я│п╨п╟ я│п╬п╠п╦я─п╟п╣п╪я▀я┘ п╪п╬п╢я┐п╩п╣п╧" );
  goto END;

ERR5:
  printf ("%s\n" ,
   "п©п╣я─п╣п©п╬п╩п╫п╣п╫п╦п╣ п╠я┐я└п╣я─п╟ я┘я─п╟п╫п╣п╫п╦я▐ п╬п╠'п╣п╨я┌п╫я▀я┘ п╨п╟я─я┌");
  goto END;

ERR6:
  printf ("%s\n" ,
   "п╫п╣п╢п╬п©я┐я│я┌п╦п╪я▀п╧ п╨п╬п╢ п╨п╬п╪п╟п╫п╢я▀" );
  goto END;
  
ERR7:
  printf("п©я─п╣я─я▀п╡п╟п╫п╦п╣ - п╬я┬п╦п╠п╨п╟ п╟п╢я─п╣я│п╟я├п╦п╦\n");
  goto END;
  
ERR8:
  goto END;

ERR9:
  printf ( "%s\n", "п²п╣п╡п╣я─п╫я▀п╧ я┌п╦п© я└п╟п╧п╩п╟ я│ п╦я│я┘п╬п╢п╫я▀п╪ я┌п╣п╨я│я┌п╬п╪" );
  goto END;
}
