EX10: PROC OPTIONS (MAIN);                                                     DCL A BIN FIXED (31) INIT ( 11B );                                              END EX10;                                                                           