/*
 ***** STARTING the compiler file from a high-level language
 */

/*
 ***** Block of macro definition declarations
 */

#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <stdlib.h>

void printNear(int I,int R,char* str)
{
    int start=I-R;
    int end=I+R;
    if(start<0){start=0;}
    int len=strlen(str);
    if(end>len){end=len;}
    for(;start<end;start++)
    {
        printf("%c",str[start]);
    }
    printf("\n");
}

/* front */
/* dimensions: */
#define MAXNISXTXT 50                             /* - source text;  */
#define NSINT     301                             /* - syntax rules table;  */
#define NCEL       20                             /* - stack of goals;  */
#define NDST      500                             /* - stack of achievements;  */
#define NVXOD      53                             /* - input table;  */
#define NSTROKA   200                             /* - dense text lines;  */
#define NNETRM     16                             /* - list of non-terminals;  */
#define MAXLTXT    50                             /* - output text;  */
#define MAXFORMT   30                             /* - formatted information  */
/* tolerated frag- */
/* ment of the original text; */
#define NSYM      100                             /* - tables of names and labels */

/*
 ***** Compiler DATABSE
 */

/*
 ***** Array declaration block with source text
 */

int NISXTXT;                                      /* п╢п╩п╦п╫п╟ п╪п╟я│я│п╦п╡п╟          */
char ISXTXT [MAXNISXTXT][80];                     /* я┌п╣п╩п╬ п╪п╟я│я│п╦п╡п╟           */

/*
 ***** Block for declaration of operating variables
 */

int I1,I2,I3,I4;                                  /* я│я┤п╣я┌я┤п╦п╨п╦ я├п╦п╨п╩п╬п╡        */

char PREDSYM = ' ';                               /*п©п╬я│п╩п╣п╢п╫п╦п╧ п╬п╠я─п╟п╠п╬я┌п╟п╫п╫я▀п╧  */
/*я│п╦п╪п╡п╬п╩ п╡ я┐п©п╩п╬я┌п╫п╣п╫п╫п╬п╪    */
/*п╦я│я┘п╬п╢п╫п╬п╪ я┌п╣п╨я│я┌п╣         */

char STROKA [ NSTROKA ];                          /*п╪п╣я│я┌п╬ я┘я─п╟п╫п╣п╫п╦я▐ я┐п©п╩п╬я┌п╫п╣п╫-*/
/*п╫п╬пЁп╬ п╦я│я┘п╬п╢п╫п╬пЁп╬ я┌п╣п╨я│я┌п╟   */

int I,J,K,L;                                      /*я┌п╣п╨я┐я┴п╦п╣ п╦п╫п╢п╣п╨я│я▀ я│п╬п╬я┌п╡п╣я┌-*/
/*specifically in: */
/*  - condensed text; */
/*  - table of grammatical rules; */
/*  - stack of delivered */
/*goals; */
/*  - stack of achieved */
/*goals; */

union                                             /* template for generation  */
{                                                 /* write output file */
    char BUFCARD [80];                            /* in IBM 370 ASSEMBLY  */
    struct
    {
        char METKA   [8];
        char PROB1;
        char OPERAC  [5];
        char PROB2;
        char OPERAND [12];
        char PROB3;
        char COMM    [52];
    } _BUFCARD;
} ASS_CARD;

char ASSTXT [ MAXLTXT ][80];                      /*п╪п╟я│я│п╦п╡ п╢п╩я▐ я┘я─п╟п╫п╣п╫п╦я▐     */
/*п╡я▀я┘п╬п╢п╫п╬пЁп╬ я┌п╣п╨я│я┌п╟ п╫п╟     */
/*п░п║п║п∙п°п▒п⌡п∙п═п∙ IBM 370      */

int IASSTXT;                                      /*п╦п╫п╢п╣п╨я│ п╡я▀я┘п╬п╢п╫п╬пЁп╬ п╪п╟я│я│п╦п╡п╟*/

char FORMT [MAXFORMT] [9];                        /*п╪п╟я│я│п╦п╡ п╢п╩я▐ я└п╬я─п╪п╟я┌п╦я─п╬п╡п╟п╫-*/
/*п╫п╬пЁп╬  (п╡ п╡п╦п╢п╣ п©п╬я│п╩п╣п╢п╬п╡п╟-*/
/*я┌п╣п╩я▄п╫п╬я│я┌п╦ 9-я┌п╦ п©п╬п╥п╦я├п╦п╬п╫-*/
/*п╫я▀я┘ я│я┌я─п╬п╨-п╩п╣п╨я│п╣п╪) п©я─п╣п╢- */
/*я│я┌п╟п╡п╩п╣п╫п╦я▐ п╦п╫я┌п╣я─п©я─п╣я┌п╦я─я┐- */
/*п╣п╪п╬пЁп╬ я└я─п╟пЁп╪п╣п╫я┌п╟ п╦я│я┘п╬п╢п╫п╬-*/
/*пЁп╬ п©п╩п╬я┌п╫п╬пЁп╬ я┌п╣п╨я│я┌п╟      */

int IFORMT;                                       /*п╦п╫п╢п╣п╨я│ я└п╬я─п╪п╟я┌п╦я─п╬п╡п╟п╫п╫п╬пЁп╬ */
/*  array               */
/*
 ***** Database table declaration block
 */

/*
 ***** Table used as a store (stack) of achievements
 */

struct
{
    char DST1 [ 4 ];
    int DST2;
    int DST3;
    int DST4;
    int DST5;
} DST [ NDST ];

/*
 ***** Table used as a store (stack) of targets
 */

struct
{
    char CEL1 [ 4 ];
    int CEL2;
    int CEL3;
} CEL [ NCEL ];

/*
 ***** Table of syntactic rules written in recognition form,
 ***** grouped into "bushes" and presented in the form of a bidirectional
 ***** list with alternative branches
 */

struct
{
    int POSL;
    int PRED;
    char DER[4];
    int ALT;
} SINT [ NSINT ] =
/*   __________ _________ _______ _______ ______
 |  NN      :    п©п╬я│п╩ : п©я─п╣п╢  :  п╢п╣я─  : п╟п╩я▄я┌ |
 |__________:_________:_______:_______:______|                          */
{
    { /*.    0     .*/ -1,    -1, "***",   -1 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 0      */
    { /*.    1     .*/ 2,     0, "0  ",    0 },
    { /*.    2     .*/ 3,     1, "CIF",    0 },
    { /*.    3     .*/ 0,     2, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 1      */
    { /*.    4     .*/ 5,     0, "1  ",    0 },
    { /*.    5     .*/ 6,     4, "CIF",    7 },
    { /*.    6     .*/ 0,     5, "*  ",    0 },
    
    { /*.    7     .*/ 8,     4, "MAN",    0 },
    { /*.    8     .*/ 0,     7, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 2      */
    { /*.    9     .*/ 10,     0, "2  ",    0 },
    { /*.   10     .*/ 11,     9, "CIF",    0 },
    { /*.   11     .*/ 0,    10, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 3      */
    { /*.   12     .*/ 13,     0, "3  ",    0 },
    { /*.   13     .*/ 14,    12, "CIF",    0 },
    { /*.   14     .*/ 0,    13, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 4      */
    { /*.   15     .*/ 16,     0, "4  ",    0 },
    { /*.   16     .*/ 17,    15, "CIF",    0 },
    { /*.   17     .*/ 0,    16, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 5      */
    { /*.   18     .*/ 19,     0, "5  ",    0 },
    { /*.   19     .*/ 20,    18, "CIF",    0 },
    { /*.   20     .*/ 0,    19, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 6      */
    { /*.   21     .*/ 22,     0, "6  ",    0 },
    { /*.   22     .*/ 23,    21, "CIF",    0 },
    { /*.   23     .*/ 0,    22, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 7      */
    { /*.   24     .*/ 25,     0, "7  ",    0 },
    { /*.   25     .*/ 26,    24, "CIF",    0 },
    { /*.   26     .*/ 0,    25, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 8      */
    { /*.   27     .*/ 28,     0, "8  ",    0 },
    { /*.   28     .*/ 29,    27, "CIF",    0 },
    { /*.   29     .*/ 0,    28, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - 9      */
    { /*.   30     .*/ 31,     0, "9  ",    0 },
    { /*.   31     .*/ 32,    30, "CIF",    0 },
    { /*.   32     .*/ 0,    31, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - A      */
    { /*.   33     .*/ 34,     0, "A  ",    0 },
    { /*.   34     .*/ 35,    33, "BUK",    0 },
    { /*.   35     .*/ 0,    34, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - B      */
    { /*.   36     .*/ 37,     0, "B  ",    0 },
    { /*.   37     .*/ 38,    36, "BUK",    0 },
    { /*.   38     .*/ 0,    37, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - C      */
    { /*.   39     .*/ 40,     0, "C  ",    0 },
    { /*.   40     .*/ 41,    39, "BUK",    0 },
    { /*.   41     .*/ 0,    40, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - D      */
    { /*.   42     .*/ 43,     0, "D  ",    0 },
    { /*.   43     .*/ 44,    42, "BUK",   45 },
    { /*.   44     .*/ 0,    43, "*  ",    0 },
    
    { /*.   45     .*/ 46,    42, "C  ",    0 },
    { /*.   46     .*/ 47,    45, "L  ",    0 },
    { /*.   47     .*/ 48,    46, "   ",    0 },
    { /*.   48     .*/ 49,    47, "IDE",    0 },
    { /*.   49     .*/ 50,    48, "   ",    0 },
    { /*.   50     .*/ 51,    49, "B  ",  187 },
    { /*.   51     .*/ 52,    50, "I  ",    0 },
    { /*.   52     .*/ 53,    51, "N  ",    0 },
    { /*.   53     .*/ 54,    52, "   ",    0 },
    { /*.   54     .*/ 55,    53, "F  ",    0 },
    { /*.   55     .*/ 56,    54, "I  ",    0 },
    { /*.   56     .*/ 57,    55, "X  ",    0 },
    { /*.   57     .*/ 58,    56, "E  ",    0 },
    { /*.   58     .*/ 59,    57, "D  ",    0 },
    { /*.   59     .*/ 60,    58, "(  ",  204 },
    { /*.   60     .*/ 61,    59, "RZR",   61 },
    { /*.   61     .*/ 62,    60, ")  ",    0 },
    { /*.   62     .*/ 63,    61, ";  ",   65 },
    { /*.   63     .*/ 64,    62, "ODC",    0 },
    { /*.   64     .*/ 0,    63, "*  ",    0 },
    
    { /*.   65     .*/ 66,    61, "I  ",    0 },
    { /*.   66     .*/ 67,    65, "N  ",    0 },
    { /*.   67     .*/ 68,    66, "I  ",    0 },
    { /*.   68     .*/ 69,    67, "T  ",    0 },
    { /*.   69     .*/ 70,    68, "(  ",    0 },
    { /*.   70     .*/ 71,    69, "LIT",    205 },
    { /*.   71     .*/ 72,    70, ")  ",    0 },
    { /*.   72     .*/ 73,    71, ";  ",    0 },
    { /*.   73     .*/ 186,    72, "ODC",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - E      */
    { /*.   74     .*/ 75,     0, "E  ",    0 },
    { /*.   75     .*/ 76,    74, "N  ",   82 },
    { /*.   76     .*/ 77,    75, "D  ",    0 },
    { /*.   77     .*/ 78,    76, "   ",    0 },
    { /*.   78     .*/ 79,    77, "IPR",    0 },
    { /*.   79     .*/ 80,    78, ";  ",    0 },
    { /*.   80     .*/ 81,    79, "OEN",    0 },
    { /*.   81     .*/ 0,    80, "*  ",    0 },
    
    { /*.   82     .*/ 83,    74, "BUK",    0 },
    { /*.   83     .*/ 0,    82, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - M      */
    { /*.   84     .*/ 85,     0, "M  ",    0 },
    { /*.   85     .*/ 86,    84, "BUK",    0 },
    { /*.   86     .*/ 0,    85, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - P      */
    { /*.   87     .*/ 88,     0, "P  ",    0 },
    { /*.   88     .*/ 89,    87, "BUK",    0 },
    { /*.   89     .*/ 0,    88, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - X      */
    { /*.   90     .*/ 91,     0, "X  ",    0 },
    { /*.   91     .*/ 92,    90, "BUK",    0 },
    { /*.   92     .*/ 0,    91, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - BUK    */
    { /*.   93     .*/ 94,     0, "BUK",    0 },
    { /*.   94     .*/ 95,    93, "IDE",    0 },
    { /*    95     .*/ 0,    94, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - IDE    */
    { /*.   96     .*/ 97,     0, "IDE",    0 },
    { /*.   97     .*/ 98,    96, "BUK",  100 },
    { /*.   98     .*/ 99,    97, "IDE",    0 },
    { /*.   99     .*/ 0,    98, "*  ",    0 },
    
    { /*.  100     .*/ 101,    96, "CIF",  103 },
    { /*.  101     .*/ 102,   100, "IDE",    0 },
    { /*.  102     .*/ 0,   101, "*  ",    0 },
    
    { /*.  103     .*/ 104,    96, "IPE",  105 },
    { /*.  104     .*/ 0,   103, "*  ",    0 },
    
    { /*.  105     .*/ 106,    96, "IPR",    0 },
    { /*.  106     .*/ 0,   105, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - +      */
    { /*.  107     .*/ 108,     0, "+  ",    0 },
    { /*.  108     .*/ 109,   107, "ZNK",    0 },
    { /*.  109     .*/ 0,   108, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - -      */
    { /*.  110     .*/ 111,     0, "-  ",    0 },
    { /*.  111     .*/ 112,   110, "ZNK",    0 },
    { /*.  112     .*/ 0,   111, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - IPR    */
    { /*.  113     .*/ 114,     0, "IPR",    0 },
    { /*.  114     .*/ 115,   113, ":  ",    0 },
    { /*.  115     .*/ 116,   114, "P  ",    0 },
    { /*.  116     .*/ 117,   115, "R  ",    0 },
    { /*.  117     .*/ 118,   116, "O  ",    0 },
    { /*.  118     .*/ 119,   117, "C  ",    0 },
    { /*.  119     .*/ 120,   118, "   ",    0 },
    { /*.  120     .*/ 121,   119, "O  ",    0 },
    { /*.  121     .*/ 122,   120, "P  ",    0 },
    { /*.  122     .*/ 123,   121, "T  ",    0 },
    { /*.  123     .*/ 124,   122, "I  ",    0 },
    { /*.  124     .*/ 125,   123, "O  ",    0 },
    { /*.  125     .*/ 126,   124, "N  ",    0 },
    { /*.  126     .*/ 127,   125, "S  ",    0 },
    { /*.  127     .*/ 128,   126, "(  ",    0 },
    { /*.  128     .*/ 129,   127, "M  ",    0 },
    { /*.  129     .*/ 130,   128, "A  ",    0 },
    { /*.  130     .*/ 131,   129, "I  ",    0 },
    { /*.  131     .*/ 132,   130, "N  ",    0 },
    { /*.  132     .*/ 133,   131, ")  ",    0 },
    { /*.  133     .*/ 134,   132, ";  ",    0 },
    { /*.  134     .*/ 135,   133, "OPR",    0 },
    { /*.  135     .*/ 0,   134, "*  ",    0 },
    /*                                                п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - CIF    */
    { /*.  136     .*/ 137,     0, "CIF",    0 },
    { /*.  137     .*/ 138,   136, "RZR",    0 },
    { /*.  138     .*/ 0,     0, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - RZR    */
    { /*.  139     .*/ 140,     0, "RZR",    0 },
    { /*.  140     .*/ 141,   139, "CIF",    0 },
    { /*.  141     .*/ 142,   140, "RZR",    0 },
    { /*.  142     .*/ 0,   141, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - MAN    */
    { /*.  143     .*/ 144,     0, "MAN",    0 },
    { /*.  144     .*/ 145,   143, "B  ",  147 },
    { /*.  145     .*/ 146,   144, "LIT",    0 },
    { /*.  146     .*/ 0,   145, "*  ",    0 },
    
    { /*.  147     .*/ 148,   143, "0  ",  150 },
    { /*.  148     .*/ 149,   147, "MAN",    0 },
    { /*.  149     .*/ 0,   148, "*  ",    0 },
    
    { /*.  150     .*/ 151,   143, "1  ",    0 },
    { /*.  151     .*/ 152,   150, "MAN",    0 },
    { /*.  152     .*/ 0,   151, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - IPE    */
    { /*.  153     .*/ 154,     0, "IPE",    0 },
    { /*.  154     .*/ 155,   153, "=  ",  159 },
    { /*.  155     .*/ 156,   154, "AVI",    0 },
    { /*.  156     .*/ 157,   155, ";  ",    0 },
    { /*.  157     .*/ 158,   156, "OPA",    0 },
    { /*.  158     .*/ 0,   157, "*  ",    0 },
    
    { /*.  159     .*/ 160,   153, "AVI",    0 },
    { /*.  160     .*/ 0,   159, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - LIT    */
    { /*.  161     .*/ 162,     0, "LIT",    0 },
    { /*.  162     .*/ 163,   161, "AVI",    0 },
    { /*.  163     .*/ 0,   162, "*  ",    0 },
    /*.                                              п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - AVI    */
    { /*.  164     .*/ 165,     0, "AVI",    0 },
    { /*.  165     .*/ 166,   164, "ZNK",  206 },
    { /*.  166     .*/ 167,   165, "LIT",  168 },
    { /*.  167     .*/ 197,   166, "AVI",    0 },
    
    { /*.  168     .*/ 169,   165, "IPE",    0 },
    { /*.  169     .*/ 170,   168, "AVI",    0 },
    { /*.  170     .*/ 0,   169, "*  ",    0 },
    /*                                               п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - OPR    */
    { /*.  171     .*/ 172,     0, "OPR",    0 },
    { /*.  172     .*/ 173,   171, "TEL",    0 },
    { /*.  173     .*/ 174,   172, "OEN",    0 },
    { /*.  174     .*/ 175,   173, "PRO",    0 },
    { /*.  175     .*/ 0,   174, "*  ",    0 },
    /*.                                              п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - ODC    */
    { /*.  176     .*/ 177,     0, "ODC",    0 },
    { /*.  177     .*/ 178,   176, "TEL",    0 },
    { /*.  178     .*/ 0,   177, "*  ",    0 },
    /*.                                              п╡я┘п╬п╢ я│ я│п╦п╪п╡п╬п╩п╟ - TEL    */
    { /*.  179     .*/ 180,     0, "TEL",    0 },
    { /*.  180     .*/ 181,   179, "ODC",  183 },
    { /*.  181     .*/ 182,   180, "TEL",    0 },
    { /*.  182     .*/ 0,   181, "*  ",    0 },
    
    { /*.  183     .*/ 184,   179, "OPA",    0 },
    { /*.  184     .*/ 185,   183, "TEL",    0 },
    { /*.  185     .*/ 0,   184, "*  ",    0 },
    
    { /*.  186     .*/ 0,    73, "*  ",    0 },
    
    
    { /*.  187     .*/ 188,    49, "C  ",    201 },
    { /*.  188     .*/ 189,   187, "H  ",    0 },
    { /*.  189     .*/ 190,   188, "A  ",    0 },
    { /*.  190     .*/ 191,   189, "R  ",    0 },
    { /*.  191     .*/ 192,   190, "(  ",    0 },
    { /*.  192     .*/ 193,   191, "RZR",    0 },
    { /*.  193     .*/ 194,   192, ")  ",    0 },
    { /*.  194     .*/ 195,   193, ";  ",    0 },
    { /*.  195     .*/ 196,   194, "ODC",    0 },
    { /*.  196     .*/ 0,   195, "*  ",    0 },
    
    { /*.  197     .*/ 0,   166, "*  ",    0 },
    
    { /*.  198     .*/ 199,     0, "*  ",    0 },
    { /*.  199     .*/ 200,   198, "ZNK",    0 },
    { /*.  200     .*/ 0,     199, "*  ",    0 },
    
    //DCL B <DEC> FIXED
    { /*.  201     .*/ 202,    49, "D  ",    0 },
    { /*.  202     .*/ 203,   201, "E  ",    0 },
    { /*.  203     .*/ 53,    202, "C  ",    0 },
    
    
    //DCL B DEC FIXED <> INIT
    { /*.  204     .*/ 65,     59, "   ",    62 },
    
    
    //DCL A BIN FIXED INIT ( <33> );
    { /*.  205     .*/ 71,    70, "RZR",     0 },
    
    //C = A <=> B;
    { /*.  206     .*/ 166,   164, "=  ",    0 },
    
    //TODO add NETERMINAL
    
    
    
    
    
};

/*
 ***** Table of inputs to the Б─°bushesБ─² (roots) of grammar rules,
 ***** containing the type (terminality or nonterminality) of the root
 ***** characters
 */

struct
{
    char SYM [4];
    int VX;
    char TYP;
} VXOD [ NVXOD ] =
/*   __________ ___________ _____ ______
 |  NN      |    я│п╦п╪п╡п╬п╩ | п╡я┘п╬п╢| я┌п╦п©  |
 |__________|___________|_____|______|                                  */

{
    { /*.   1     .*/ "AVI", 164, 'N' },
    { /*.   2     .*/ "BUK",  93, 'N' },
    { /*.   3     .*/ "CIF", 136, 'N' },
    { /*.   4     .*/ "IDE",  96, 'N' },
    { /*.   5     .*/ "IPE", 153, 'N' },
    { /*.   6     .*/ "IPR", 113, 'N' },
    { /*.   7     .*/ "LIT", 161, 'N' },
    { /*.   8     .*/ "MAN", 143, 'N' },
    { /*.   9     .*/ "ODC", 176, 'N' },
    { /*.  10     .*/ "OEN",   0, 'N' },
    { /*.  11     .*/ "OPA",   0, 'N' },
    { /*.  12     .*/ "OPR", 171, 'N' },
    { /*.  13     .*/ "PRO",   0, 'N' },
    { /*.  14     .*/ "RZR", 139, 'N' },
    { /*.  15     .*/ "TEL", 179, 'N' },
    { /*.  16     .*/ "ZNK",   0, 'N' },
    { /*.  17     .*/ "A  ",  33, 'T' },
    { /*.  18     .*/ "B  ",  36, 'T' },
    { /*.  19     .*/ "C  ",  39, 'T' },
    { /*.  20     .*/ "D  ",  42, 'T' },
    { /*.  21     .*/ "E  ",  74, 'T' },
    { /*.  22     .*/ "M  ",  84, 'T' },
    { /*.  23     .*/ "P  ",  87, 'T' },
    { /*.  24     .*/ "X  ",  90, 'T' },
    { /*.  25     .*/ "0  ",   1, 'T' },
    { /*.  26     .*/ "1  ",   4, 'T' },
    { /*.  27     .*/ "2  ",   9, 'T' },
    { /*.  28     .*/ "3  ",  12, 'T' },
    { /*.  29     .*/ "4  ",  15, 'T' },
    { /*.  30     .*/ "5  ",  18, 'T' },
    { /*.  31     .*/ "6  ",  21, 'T' },
    { /*.  32     .*/ "7  ",  24, 'T' },
    { /*.  33     .*/ "8  ",  27, 'T' },
    { /*.  34     .*/ "9  ",  30, 'T' },
    { /*.  35     .*/ "+  ", 107, 'T' },
    { /*.  36     .*/ "-  ", 110, 'T' },
    { /*.  37     .*/ ":  ",   0, 'T' },
    { /*.  38     .*/ "I  ",   0, 'T' },
    { /*.  39     .*/ "R  ",   0, 'T' },
    { /*.  40     .*/ "N  ",   0, 'T' },
    { /*.  41     .*/ "O  ",   0, 'T' },
    { /*.  42     .*/ "T  ",   0, 'T' },
    { /*.  43     .*/ "S  ",   0, 'T' },
    { /*.  44     .*/ "(  ",   0, 'T' },
    { /*.  45     .*/ ")  ",   0, 'T' },
    { /*.  46     .*/ "   ",   0, 'T' },
    { /*.  47     .*/ ";  ",   0, 'T' },
    { /*.  48     .*/ "L  ",   0, 'T' },
    { /*.  49     .*/ "F  ",   0, 'T' },
    { /*.  50     .*/ "=  ",   0, 'T' },
    { /*.  51     .*/ "H  ",   0, 'T' },
    { /*.  52     .*/ "*  ", 198, 'T' }
};

/*
 ***** Table of the adjacency matrix - the basis for constructing the matrix
 ***** successors
 */

char TPR [ NVXOD ] [ NNETRM ] =
{
    /*
     __________ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
     |       AVI:BUK:CIF:IDE:IPE:IPR:LIT:MAN:ODC:OEN:OPA:OPR:PRO:RZR:TEL:ZNK|
     |__________:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___| */
    { /*AVI*/ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*BUK*/ 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*CIF*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0  },
    { /*IDE*/ 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*IPE*/ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0  },
    { /*IPR*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0  },
    { /*LIT*/ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*MAN*/ 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*ODC*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0  },
    { /*OEN*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*OPA*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*OPR*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0  },
    { /*PRO*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*RZR*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0  },
    { /*TEL*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0  },
    { /*ZNK*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    /*
     __________ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
     |       AVI:BUK:CIF:IDE:IPE:IPR:LIT:MAN:ODC:OEN:OPA:OPR:PRO:RZR:TEL:ZNK|
     |__________:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___| */
    { /*  A*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  B*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  C*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  D*/ 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0  },
    { /*  E*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0  },
    { /*  M*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  P*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  X*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  0*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  1*/ 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  2*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  3*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  4*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  5*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0  },
    { /*  6*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0  },
    { /*  7*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    /*
     __________ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
     |       AVI:BUK:CIF:IDE;IPE:IPR:LIT:MAN:ODC:OEN:OPA:OPR:PRO:RZR:TEL:ZNK|
     |__________:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___| */
    { /*  8*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  9*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  +*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1  },
    { /*  -*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1  },
    { /*  :*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  I*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  R*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  N*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  O*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  T*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  S*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  (*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  )*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  ;*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*   */ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  L*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    /*
     __________ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
     |       AVI:BUK:CIF:IDE:IPE:IPR:LIT:MAN:ODC:OEN;OPA:OPR:PR0:RZR:TEL:ZNK|
     |__________:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___| */
    { /*  F*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  =*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  H*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0  },
    { /*  **/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1  }
    /*|_______________________________________________________________________| */
};
/*..........................................................................*/

/*
 ****** STARTING ON Source Text Processing
 */

/*..........................................................................*/

void compress_ISXTXT()                            /* п÷я─п╬пЁя─п╟п╪п╪п╟ я┐п©п╩п╬я┌п╫п╣п╫п╦я▐   */
/* п╦я│я┘п╬п╢п╫п╬пЁп╬ я┌п╣п╨я│я┌п╟ п©я┐я┌п╣п╪ */
/* я┐п╢п╟п╩п╣п╫п╦я▐ "п╩п╦я┬п╫п╦я┘"      */
/* п©я─п╬п╠п╣п╩п╬п╡, п╡я▀п©п╬п╩п╫я▐я▌я┴п╟я▐  */
/* я─п╬п╩я▄ п©я─п╦п╪п╦я┌п╦п╡п╫п╬пЁп╬ п╩п╣п╨- */
/* я│п╦я┤п╣я│п╨п╬пЁп╬ п╟п╫п╟п╩п╦п╥п╟я┌п╬я─п╟  */
{
    printf("compress\n");
    I3 = 0;
    for ( I1 = 0 ; I1 < NISXTXT ; I1++ )
    {
        for ( I2 = 0 ; I2 < 80 ; I2++ ) {
            
            
            if ( ISXTXT [ I1 ][ I2 ] != '\x0' )
            {
                if ( (ISXTXT [ I1 ][ I2 ] == ' ' || ISXTXT [ I1 ][ I2 ] == '\t' || ISXTXT [ I1 ][ I2 ] == '\n') &&
                    ( PREDSYM == ' ' || PREDSYM == '\t' || PREDSYM == '\n' || PREDSYM == ';' ||
                     PREDSYM == ')' || PREDSYM == ':' ||
                     PREDSYM == '('
                     )
                    )
                {
                    PREDSYM = ' ';
                    goto L2;
                }
                
                if
                    (
                     ( ISXTXT [ I1 ][ I2 ] == '+' ||
                      ISXTXT [ I1 ][ I2 ] == '-' ||
                      ISXTXT [ I1 ][ I2 ] == '=' ||
                      ISXTXT [ I1 ][ I2 ] == '(' ||
                      ISXTXT [ I1 ][ I2 ] == ')' ||
                      ISXTXT [ I1 ][ I2 ] == '*'
                      )
                     &&
                     (PREDSYM == ' ' || PREDSYM == '\t' || PREDSYM == '\n')
                     )
                {
                    I3-- ;
                    goto L1;
                }
                
                
                if ( (ISXTXT [ I1 ][ I2 ] == ' ' || ISXTXT [ I1 ][ I2 ] == '\t' || ISXTXT [ I1 ][ I2 ] == '\n') &&
                    ( PREDSYM == '+' || PREDSYM == '-' ||
                     PREDSYM == '=' || PREDSYM == '*'
                     )
                    )
                {
                    goto L2;
                }
                
            L1:
                PREDSYM = ISXTXT [ I1 ][ I2 ];
                if (PREDSYM == '\t') {
                    PREDSYM = ' ';
                }
                STROKA [ I3 ] = PREDSYM;
                //printf("123\n");
                //printf("%s", STROKA[I3]);
                //std::cout<<STROKA[I3];
                I3++ ;
                
            L2:    continue;
            }
            else
                break;
        }
    }
    STROKA [I3] = '\x0';
}

/*..........................................................................*/

void build_TPR ()                                 /* п÷п╬я│я┌я─п╬п╣п╫п╦п╣ я┌п╟п╠п╩п╦я├я▀     */
/* п©я─п╣п╣п╪п╫п╦п╨п╬п╡ п╦п╥ п╪п╟я┌я─п╦я├я▀  */
/* я│п╪п╣п╤п╫п╬я│я┌п╦ п©п╬ п╟п╩пЁп╬я─п╦я┌п╪я┐ */
/* п▓п╟я─я┬п╟п╩п╩п╟               */
{
    for ( I1 = 0; I1 < NNETRM; I1++ )
    {
        for ( I2 = 0; I2 < NVXOD; I2++ )
        {
            if ( TPR [ I2 ][ I1 ] & ( I1 != I2 ) )
            {
                for ( I3 = 0; I3 < NNETRM; I3++ )
                    TPR [ I2 ][ I3 ] |= TPR [ I1 ][ I3 ];
            }
        }
    }
}

/*..........................................................................*/

void mcel ( char* T1, int T2, int T3 )            /* п©я─п╬пЁя─п╟п╪п╪п╟ п╥п╟п©п╬п╩п╫п╣п╫п╦я▐   */
{                                                 /* я▐я┤п╣п╧п╨п╦ я│я┌п╣п╨п╟ п©п╬я│я┌п╟п╡п╩п╣п╫-*/
    /* п╫я▀я┘ я├п╣п╩п╣п╧              */
    strcpy ( CEL [ K ].CEL1, T1 );
    CEL [ K ].CEL2 = T2;
    CEL [ K ].CEL3 = T3;
    K++;
    //printf("%s\n", CEL [ K ].CEL1);
}

/*..........................................................................*/

void mdst ( char* T1, int T2, int T3, int T4, int T5 )
{                                                 /* п©я─п╬пЁя─п╟п╪п╪п╟ п╥п╟п©п╬п╩п╫п╣п╫п╦я▐   */
    strcpy ( DST [ L ].DST1, T1 );            /* я▐я┤п╣п╧п╨п╦ я│я┌п╣п╨п╟ п╢п╬я│я┌п╦пЁп╫я┐- */
    DST [ L ].DST2 = T2;                      /* я┌я▀я┘ я├п╣п╩п╣п╧              */
    DST [ L ].DST3 = T3;
    DST [ L ].DST4 = T4;
    DST [ L ].DST5 = T5;
    printf("%d) %s %d %d %d %d\n", L, DST [ L ].DST1, T2, T3, T4, T5);
    L++;
}


/*..........................................................................*/
/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
int numb ( char* T1, int T2 )                     /* п╡я▀я┤п╦я│п╩п╣п╫п╦я▐ п©п╬я─я▐п╢п╨п╬п╡п╬пЁп╬ */
/* п╫п╬п╪п╣я─п╟ я│я┌я─п╬п╨п╦ п╡ я┌п╟п╠п╩.  */
/* VXOD, я│п╬п╬я┌п╡п╣я┌я│я┌п╡я┐я▌я┴п╣п╧  */
/* я│я┌я─п╬п╨п╣-п©п╟я─п╟п╪п╣я┌я─я┐ я└я┐п╫п╨я├.*/
{
    int k;
    
    for ( I1 = 0; I1 < NVXOD; I1++ )
    {
        for ( k = 0; k < T2; k++ )
        {
            if ( (*(T1+k) != VXOD [ I1 ].SYM [k] ) )
                goto numb1;
        }
        if ( (VXOD [ I1 ].SYM [k] == '\x0') ||
            (VXOD [ I1 ].SYM [k] == ' '  )
            )
            return ( I1 );
    numb1:
        continue;
    }
    return -1;
}


/*..........................................................................*/
/*   п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟    */
/*   п©п╬я│я┌я─п╬п╣п╫п╦я▐  п╢п╣я─п╣п╡п╟   */
/*я│п╦п╫я┌п╟п╨я│п╦я┤п╣я│п╨п╬пЁп╬ я─п╟п╥п╠п╬я─п╟,*/
/*п╡я▀п©п╬п╩п╫я▐я▌я┴п╟я▐ я─п╬п╩я▄ я│п╦п╫я┌п╟п╨-*/
/*я│п╦я┤п╣я│п╨п╬пЁп╬ п╟п╫п╟п╩п╦п╥п╟я┌п╬я─п╟   */
int sint_ANAL ()
{
    I4 = 0;
    
L1:    // п▒п╩п╬п╨ п╫п╟я┤п╟п╩я▄п╫я▀я┘ я┐я│я┌п╟п╫п╬п╡п╬п╨
    
    K = 0;
    L = 0;
    I = 0;
    J = 1;
    mcel ( "PRO", I, 999 );
    
    if (!TPR [numb ( &STROKA [I], 1 )][numb ( "PRO", 3 )])
        return 1;
    
L2:  // п▒п╩п╬п╨ п©я─п╬п╣я├п╦я─п╬п╡п╟п╫п╦я▐ п©п╬ п╡я▀п╠я─п╟п╫п╫п╬п╧ пЁп╦п©п╬я┌п╣п╥п╣
    
    J = VXOD [ numb ( &STROKA [ I ], 1 ) ].VX;
    
L3:
    
    J = SINT [ J ].POSL;
    
L31:
    
    I++;
    
    if ( I > I4 )
        
        
        I4 = I;
    
    if (VXOD [ numb ( SINT [ J ].DER, 3 ) ].TYP == 'T')
    {// п▒п╩п╬п╨ п╬п╠я─п╟п╠п╬я┌п╨п╦ я┌п╣я─п╪п╦п╫п╟п╩п╟
        
        if ( STROKA [ I ] == SINT [ J ].DER [ 0 ] ) {
            //printf("T: %c\n", STROKA[ I ]);
            goto L3;
        }
        else
            goto L8; //п÷я─п╬п╡п╣я─п╨п╟ п╫п╟ п╨п╬п╫п╣я├ пЁя─п╟п╪п╪п╟я┌п╦я┤п╣я│п╨п╬пЁп╬ п©я─п╟п╡п╦п╩п╟
        
    }
    
L4: // п▒п╩п╬п╨ п╬п╠я─п╟п╠п╬я┌п╨п╦ п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╬п╡
    
    if ( SINT [ SINT [ J ].POSL ].DER [ 0 ] == '*' )
    {
        I--;
        //printf("N: %c\n", STROKA[ I ]);
        
        
        if ( !strcmp (SINT [J].DER, CEL [K-1].CEL1 ) )
        {
            mdst ( CEL[K-1].CEL1,CEL[K-1].CEL2,CEL[K-1].CEL3,I,J );
            
            if ( !strcmp( CEL[K-1].CEL1, "PRO" ) ) {
                
                return 0;
            }
            
        L5:
            
            if (TPR [numb (CEL[K-1].CEL1, 3)] [numb (CEL[K-1].CEL1, 3)])
            {
                J = VXOD [ numb ( CEL[K-1].CEL1, 3 ) ].VX;
                goto L3;
            }
            
        L6:
            
            J = CEL[K-1].CEL3;
            K--;
            goto L3;
        }
        
        if (!TPR [numb (SINT[J].DER, 3)] [numb (CEL[K-1].CEL1, 3)])
            goto L9;
        
        mdst ( SINT[J].DER, CEL[K-1].CEL2,0,I,J );
        J = VXOD [numb (SINT[J].DER, 3)].VX;
        goto L3;
    }
    
    if (!TPR [numb (&STROKA [I], 1)] [numb (SINT[J].DER, 3)])
        goto L8;
    
    mcel ( SINT[J].DER,I,J );
    goto L2;
    
L8:  // п▒п╩п╬п╨ п©п╣я─п╣п╠п╬я─п╟ пЁп╦п©п╬я┌п╣п╥
    
    I--;
    
L9:
    
    if (SINT[J].ALT != 0)
    {
        J = SINT[J].ALT;
        goto L31;
    }
    
    J = SINT[J].PRED;
    
    if
        (
	        ( VXOD [numb (SINT[J].DER, 3)].TYP == 'N' )
	        &&
	        ( SINT[J].PRED > 0 )
         )
    {
        mcel (DST[L-1].DST1, DST[L-1].DST2, DST[L-1].DST3);
        //printDST();
        
        
    L10:
        
        J = DST[L-1].DST5;
        L--;
        goto L9;
    }
    
    if
        (
	        ( VXOD [numb (SINT[J].DER, 3)].TYP == 'N' )
	        &&
	        ( SINT[J].PRED == 0 )
         )
    {
        if (!strcmp ( CEL[K-1].CEL1, DST[L-1].DST1 ) )
            goto L6;
        else
            goto L10;
    }
    
    if ( SINT[J].PRED > 0 )
        goto L8;
    
    J = CEL[K-1].CEL3;
    K--;
    //if(J==97)
    //{
    //printNear(I, 10, STROKA);
    //printf("%s\n",SINT[J].DER);
    //}
    if ( J == 999 )
        return 2;
    else
        goto L8;
    
}

/*..........................................................................*/

struct                                            /* я┌п╟п╠п╩п╦я├п╟ п╦п╪п╣п╫ п╪п╣я┌п╬п╨ п╦   */
{                                                 /* п©п╣я─п╣п╪п╣п╫п╫я▀я┘, п╥п╟п©п╬п╩п╫я▐п╣п╪п╟я▐*/
    char NAME [8];                            /* п╫п╟ п©п╣я─п╡п╬п╪ п©я─п╬я┘п╬п╢п╣ я│п╣-  */
    char TYPE;                                /* п╪п╟п╫я┌п╦я┤п╣я│п╨п╬пЁп╬ п╡я▀я┤п╦я│п╩п╣п╫п╦я▐*/
    char RAZR [5];                            /* п╦ п╦я│п©п╬п╩я▄п╥я┐п╣п╪п╟я▐ п╫п╟ п╡я┌п╬- */
    char INIT [50];                           /* я─п╬п╪ п©я─п╬я┘п╬п╢п╣ я│п╣п╪п╟п╫я┌п╦я┤п╣я│-*/
} SYM [ NSYM ];                                   /* п╨п╬пЁп╬ п╡я▀я┤п╦я│п╩п╣п╫п╦я▐        */

int ISYM = 0;                                     /* я┌п╣п╨я┐я┴п╦п╧ п╦п╫п╢п╣п╨я│ я┌п╟п╠п╩п╦я├я▀ */
/* п╦п╪п╣п╫                   */

char NFIL [30]="\x0";                             /* я┘я─п╟п╫п╦п╩п╦я┴п╣ п╦п╪п╣п╫п╦ я┌я─п╟п╫я│- */
/* п╩п╦я─я┐п╣п╪п╬п╧ п©я─п╬пЁя─п╟п╪п╪я▀     */

/*..........................................................................*/
/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* п©п╣я─п╣п╡п╬п╢п╟ п╢п╡п╬п╦я┤п╫п╬п╧      */
/* п╨п╬п╫я│я┌п╟п╫я┌я▀ п╦п╥ ASCIIz-п╡п╦-*/
/* п╢п╟ п╡п╬ п╡п╫я┐я┌я─п╣п╫п╫п╣п╣ п©я─п╣п╢- */
/* я│я┌п╟п╡п╩п╣п╫п╦п╣ я┌п╦п©п╟ long int*/
long int VALUE ( char* s )
{
    long int S;
    unsigned long length = strlen(s);
    if (s[length - 1] == 'B') {
        int i;
        
        i = 0;
        S = 0;
        while ( *(s + i) != 'B' )
            
        {
            
            S <<= 1;
            if ( *(s + i) == '1' )
                S++;
            i++;
        }
    } else {
        S = atoi(s);
    }
    
    return (S);
}



/*..........................................................................*/
/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* п©я─п╣п╢я│я┌п╟п╡п╩п╣п╫п╦я▐ я└я─п╟пЁп╪п╣п╫я┌п╟*/
/* п©п╩п╬я┌п╫п╬пЁп╬ я┌п╣п╨я│я┌п╟ п╡ п╡п╦п╢п╣ */
/* п╪п╟я│я│п╦п╡п╟ 9-я┌п╦ я│п╦п╪п╡п╬п╩я▄п╫я▀я┘*/
/* п╩п╣п╨я│п╣п╪                 */
void FORM ()
{
    int i,j;
    
    for ( IFORMT = 0; IFORMT < MAXFORMT; IFORMT++ )
        memcpy ( FORMT [IFORMT], "\x0\x0\x0\x0\x0\x0\x0\x0\x0", 9 );
    
    IFORMT = 0;
    j = DST [I2].DST2;
    
FORM1:
    
    for ( i = j; i <= DST [I2].DST4+1; i++ )
    {
        if ( STROKA [i] == ':' || STROKA [i] == ' ' ||
            STROKA [i] == '(' || STROKA [i] == ')' ||
            STROKA [i] == ';' || STROKA [i] == '+' ||
            STROKA [i] == '-' || STROKA [i] == '=' ||
            STROKA [i] == '*'
            )
        {
            FORMT [IFORMT] [i-j] = '\x0';
            IFORMT++;
            j = i+1;
            goto FORM1;
        }
        else
            FORMT [IFORMT][i-j] = STROKA [i];
        
    }
    
    return;
}

/*..........................................................................*/
/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
void ZKARD ()                                     /* п╥п╟п©п╦я│п╦ п╬я┤п╣я─п╣п╢п╫п╬п╧ я│пЁп╣п╫п╣-*/
{                                                 /* я─п╦я─п╬п╡п╟п╫п╫п╬п╧ п╥п╟п©п╦я│п╦ п╡я▀-  */
    /* я┘п╬п╢п╫п╬пЁп╬ я└п╟п╧п╩п╟ п╡ п╪п╟я│я│п╦п╡ */
    /* ASSTXT                 */
    char i;
    memcpy ( ASSTXT [ IASSTXT ],
            ASS_CARD.BUFCARD, 80 );
    printf("%d) %s\n", IASSTXT, ASSTXT [ IASSTXT ]);
    ASSTXT[IASSTXT][79]=0;
    IASSTXT++;
    
    for ( i = 0; i < 79; i++ )
        ASS_CARD.BUFCARD [i] = ' ';
    return;
}

/*..........................................................................*/
/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ AVI п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* AVI -   "п╟я─п╦я└п╪.п╡я▀я─п╟п╤." */
int AVI1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ BUK п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* BUK -   "п╠я┐п╨п╡п╟"        */
int BUK1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ CIF п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* CIF -   "я├п╦я└я─п╟"        */
int CIF1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ IDE п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* IDE -   "п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─"*/
int IDE1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ IPE п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* IPE - "п╦п╪я▐ п©п╣я─п╣п╪п╣п╫п╫п╬п╧" */
int IPE1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ IPR п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* IPR -   "п╦п╪я▐ п©я─п╬пЁя─п╟п╪п╪я▀" */
int IPR1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ LIT п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* LIT -   "п╩п╦я┌п╣я─п╟п╩"      */
int LIT1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ MAN п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* MAN -   "п╪п╟п╫я┌п╦я│я│п╟"     */
int MAN1 ()
{
    return 0;
}

/*..........................................................................*/

/* program */
/* semantic calculations */
/* non-terminal ODC on the per- */
/* in the aisle. Here */
/* ODC - "oper.PL1-DCL" */
int ODC1 ()
{
    int i;
    FORM ();                                  /* я└п╬я─п╪п╟я┌п╦я─п╬п╡п╟п╫п╦п╣ п÷п⌡1-п╬п©п╣-*/
    /* я─п╟я┌п╬я─п╟ DCL             */
    
    for ( i = 0; i < ISYM; i++ )              /* п╣я│п╩п╦ я└п╦п╨я│п╦я─я┐п╣п╪ п©п╬п╡я┌п╬я─- */
    {                                         /* п©п╬п╡я┌п╬я─п╫п╬п╣ п╬п╠я┼я▐п╡п╩п╣п╫п╦п╣   */
        if (  !strcmp ( SYM [i].NAME, FORMT [1] ) &&/* п╡я┌п╬я─п╬пЁп╬ я┌п╣я─п╪п╟ п╬п©п╣я─п╟я┌п╬я─п╟*/
            strlen ( SYM [i].NAME ) == /* DCL, я┌п╬                */
            strlen ( FORMT [1] )
            )
            return 6;                 /* п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ п©я─п╬пЁя─п╟п╪п╪я▀   */
        /* п©п╬ п╬я┬п╦п╠п╨п╣              */
    }
    
    strcpy ( SYM [ISYM].NAME, FORMT [1] );    /* п©я─п╦ п╬я┌я│я┐я┌я│я┌п╡п╦п╦ п©п╬п╡я┌п╬я─- */
    strcpy ( SYM [ISYM].RAZR, FORMT [4] );    /* п╫п╬пЁп╬ п╬п╠я┼я▐п╡п╩п╣п╫п╦я▐ п╦п╢п╣п╫я┌п╦-*/
    /* я└п╦п╨п╟я┌п╬я─п╟ п╥п╟п©п╬п╪п╦п╫п╟п╣п╪ п╣пЁп╬*/
    /* п╡п╪п╣я│я┌п╣ я│ я─п╟п╥я─я▐п╢п╫п╬я│я┌я▄я▌ п╡*/
    /* я┌п╟п╠п╩.SYM               */
    
    if ( !strcmp ( FORMT [2], "BIN" ) &&      /* п╣я│п╩п╦ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─ п╬п©- */
        !strcmp ( FORMT [3], "FIXED" ) )/* я─п╣п╢п╣п╩п╣п╫ п╨п╟п╨ bin fixed, */
    {
        SYM [ISYM].TYPE = 'B';            /* я┌п╬ я┐я│я┌п╟п╫п╟п╡п╩п╦п╡п╟п╣п╪ я┌п╦п©   */
        /* п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─п╟ = 'B' п╦ */
        goto ODC11;                       /* п╦п╢п╣п╪ п╫п╟ п©я─п╬п╢п╬п╩п╤п╣п╫п╦п╣ п╬п╠-*/
        /* я─п╟п╠п╬я┌п╨п╦, п╟             */
    }
    else  if (!strcmp ( FORMT [2], "DEC" )) //decimal
    {
        //TODO alloc 3 bytes for this variable
        SYM [ISYM].TYPE = 'D';            /* я┌п╬ я┐я│я┌п╟п╫п╟п╡п╩п╦п╡п╟п╣п╪ я┌п╦п©   */
        /* п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─п╟ = 'B' п╦ */
        goto ODC11;
    } else
    { /* п╦п╫п╟я┤п╣                  */
        SYM [ISYM].TYPE = 'U';            /* я┐я│я┌п╟п╫п╟п╡п╩п╦п╡п╟п╣п╪ я┌п╦п© п╦п╢п╣п╫-*/
        /* я┌п╦я└п╦п╨п╟я┌п╬я─п╟ = 'U'  п╦    */
        return 2;                         /* п╥п╟п╡п╣я─я┬п╟п╣п╪ п©я─п╬пЁя─п╟п╪п╪я┐    */
        /* п©п╬ п╬я┬п╦п╠п╨п╣              */
    }
    
ODC11:
    if ( !strcmp(FORMT[4], "INIT")) {
        //init without range description
        strcpy ( SYM [ISYM++].INIT, FORMT [5] ); /* п╣п╪ п╡ я┌п╟п╠п╩. SYM я█я┌п╬ п╫п╟- */
        ISYM++;
    } else {
        //range described before init
        /* п╣я│п╩п╦ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─     */
        /* п╦п╪п╣п╣я┌ п╫п╟я┤п╟п╩я▄п╫я┐я▌ п╦п╫п╦я├п╦- */
        if ( !strcmp ( FORMT [5], "INIT" )  )     /* п╟п╩п╦п╥п╟я├п╦я▌, я┌п╬ п╥п╟п©п╬п╪п╦п╫п╟- */
            strcpy ( SYM [ISYM++].INIT, FORMT [6] ); /* п╣п╪ п╡ я┌п╟п╠п╩. SYM я█я┌п╬ п╫п╟- */
        /* я┤п╟п╩я▄п╫п╬п╣ п╥п╫п╟я┤п╣п╫п╦п╣, п╟    */
        else                                      /* п╦п╫п╟я┤п╣                  */
            strcpy ( SYM [ISYM++].INIT, "0B" ); /* п╦п╫п╦я├п╦п╟п╩п╦п╥п╦я─я┐п╣п╪ п╦п╢п╣п╫я┌п╦- */
        /* я└п╦п╨п╟я┌п╬я─ п╫я┐п╩п╣п╪          */
    }
    return 0;                                 /* я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я┬п╣п╫п╦п╣     */
    /* п©я─п╬пЁя─п╟п╪п╪я▀              */
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ OEN п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* OEN - "п╬п©п╣я─п╟я┌.п÷п⌡1-END" */
int OEN1 ()
{
    char i = 0;
    FORM ();                                  /* я└п╬я─п╪п╟я┌п╦я─п╬п╡п╟п╫п╦п╣ п÷п⌡1-п╬п©п╣-*/
    /* я─п╟я┌п╬я─п╟ END             */
    
    for ( i = 0; i < ISYM; i++ )              /* п╣я│п╩п╦ п╡я┌п╬я─п╧ я┌п╣я─п╪ п╬п©п╣я─п╟- */
    /* я┌п╬я─п╟ END п╥п╟п©п╦я│п╟п╫ п╡ я┌п╟п╠п╩*/
    {                                         /* SYM п╦ п╣пЁп╬ я┌п╦п© = "P",я┌п╬:*/
        if ( !strcmp ( SYM [i].NAME, FORMT [1] ) &&
            (SYM [i].TYPE == 'P') &&
            strlen (SYM [i].NAME) ==
            strlen ( FORMT [1] ) )
            return 0;                 /* я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬п╣п╫п╦п╣    */
        /* п©я─п╬пЁя─п╟п╪п╪я▀              */
    }
    
    return 1;                                 /* п╦п╫п╟я┤п╣ п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ п©я─п╬пЁ- */
    /* я─п╟п╪п╪я▀ п©п╬ п╬я┬п╦п╠п╨п╣        */
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ OPA п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* OPA - "п╬п©п╣я─п╟я┌.п©я─п╦я│п╡п╟п╦- */
/* п╡п╟п╫п╦я▐ п╟я─п╦я└п╪п╣я┌п╦я┤п╣я│п╨п╦п╧   */
int OPA1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ OPR п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* OPR - "п╬п©п╣я─п╟я┌.п÷п⌡1-PROC"*/
int OPR1 ()
{
    FORM ();                                  /* я└п╬я─п╪п╟я┌п╦я─я┐п╣п╪ п╬п©п╣я─п╟я┌п╬я─   */
    /* п÷п⌡1 PROC               */
    
    strcpy ( SYM [ISYM].NAME, FORMT [0] );    /* п©п╣я─п╣п©п╦я┬п╣п╪ п╦п╪я▐ п÷п⌡1-п©я─п╬пЁ-*/
    /* я─п╟п╪п╪я▀ п╡ я┌п╟п╠п╩. SYM,     */
    
    SYM [ISYM].TYPE   = 'P';                  /* я┐я│я┌п╟п╫п╬п╡п╦п╪ я┌п╦п© я█я┌п╬пЁп╬    */
    /* п╦п╪п╣п╫п╦ = 'P'            */
    SYM [ISYM++].RAZR [0] = '\x0';            /* я┐я│я┌п╟п╫п╬п╡п╦п╪ я─п╟п╥я─я▐п╢п╫п╬я│я┌я▄  */
    /* я─п╟п╡п╫п╬п╧ 0               */
    
    return 0;                                 /* я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬п╣п╫п╦п╣    */
    /* п©я─п╬пЁя─п╟п╪п╪я▀              */
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ PRO п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* PRO - "п©я─п╬пЁя─п╟п╪п╪п╟"      */

int PRO1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ RZR п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* RZR - "я─п╟п╥я─я▐п╢п╫п╬я│я┌я▄"    */

int RZR1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ TEL п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* TEL - "я┌п╣п╩п╬ п©я─п╬пЁя─п╟п╪п╪я▀" */

int TEL1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ ZNK п╫п╟ п©п╣я─-*/
/* п╡п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* ZNK - "п╥п╫п╟п╨ п╬п©п╣я─п╟я├п╦п╦"  */

int ZNK1 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ AVI п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* AVI -   "п╟я─п╦я└п╪.п╡я▀я─п╟п╤." */


int AVI2 ()
{
    char i;
    FORM ();                                  /*я└п╬я─п╪п╟я┌п╦я─я┐п╣п╪ п©я─п╟п╡я┐я▌ я┤п╟я│я┌я▄*/
    /*п╟я─п╦я└п╪п╣я┌п╦я┤п╣я│п╨п╬пЁп╬ п÷п⌡1-п╬п©п╣-*/
    /*я─п╟я┌п╬я─п╟ п©я─п╦я│п╡п╟п╦п╡п╟п╫п╦я▐     */
    
    if ( IFORMT == 1 )                        /* п╣я│п╩п╦ п©я─п╟п╡п╟я▐ я┤п╟я│я┌я▄ п╬п╢п╫п╬-*/
    {                                         /* я┌п╣я─п╪п╬п╡п╟я▐, я┌п╬:          */
        for ( i = 0; i < ISYM; i++ )      /* п╦я┴п╣п╪ я█я┌п╬я┌ я┌п╣я─п╪ п╡ я┌п╟п╠п╩п╦-*/
        {                                 /* я├п╣ п╦п╪п╣п╫  п╦             */
            if ( !strcmp ( SYM [i].NAME, FORMT [0] )  &&/* п╣я│п╩п╦ п╫п╟я┘п╬п╢п╦п╪, я┌п╬:      */
                strlen ( SYM [i].NAME ) ==
                strlen ( FORMT [0] )
                )
            {
                if ( SYM [i].TYPE == 'B' ) /* п╡ я│п╩я┐я┤п╟п╣ я┌п╦п©п╟=bin fixed*/
                {
                    
                    if ( strcmp ( SYM [i].RAZR, "15" ) /* п╦ я─п╟п╥я─я▐п╢п╫п╬я│я┌п╦ <= 15    */
                        <= 0 )
                        memcpy ( ASS_CARD._BUFCARD.OPERAC, /* я└п╬я─п╪п╦я─я┐п╣п╪ п╨п╬п╢ п╟я│я│п╣п╪п╠п╩п╣-*/
                                "LH", 2 ); /* я─п╬п╡я│п╨п╬п╧ п╬п©п╣я─п╟я├п╦п╦ LH,   */
                    else
                        memcpy ( ASS_CARD._BUFCARD.OPERAC, /* п╟ п©я─п╦ я─п╟п╥я─я▐п╢п╫п╬я│я┌п╦ >15  */
                                "L", 1 ); /* я└п╬я─п╪п╦я─я┐п╣п╪ п╨п╬п╢ п╟я│я│п╣п╪п╠п╩п╣-*/
                    /* я─п╬п╡я│п╨п╬п╧ п╬п©п╣я─п╟я├п╦п╦ L     */
                    
                    strcpy ( ASS_CARD._BUFCARD.OPERAND, /*       я└п╬я─п╪п╦я─я┐п╣п╪        */
                            "R2," );/*       п©п╣я─п╡я▀п╧  п╦        */
                    strcat ( ASS_CARD._BUFCARD.OPERAND, /* п╡я┌п╬я─п╬п╧ п╬п©п╣я─п╟п╫п╢я▀ п╟я│я│п╣п╪п╠-*/
                            FORMT [0]);/* п╩п╣я─п╬п╡я│п╨п╬п╧ п╬п©п╣я─п╟я├п╦п╦     */
                    
                    ASS_CARD._BUFCARD.OPERAND [ strlen /* п╡я│я┌п╟п╡п╩я▐п╣п╪ я─п╟п╥п╢п╣п╩п╦я┌п╣п╩я▄  */
                                               ( ASS_CARD._BUFCARD.OPERAND ) ] = ' ';
                    
                    memcpy ( ASS_CARD._BUFCARD.COMM, /* п╦ п©п╬я│я┌я─п╬я┤п╫я▀п╧ п╨п╬п╪п╣п╫я┌п╟я─п╦п╧*/
                            "Loading a variable into a register", 29 );
                    
                    ZKARD (); /* п╥п╟п©п╬п╪п╫п╦я┌я▄ п╬п©п╣я─п╟я├п╦я▌ п╟я│- */
                    /* я│п╣п╪п╠п╩п╣я─п╟  п╦            */
                    return 0; /* п╥п╟п╡п╣я─я┬п╦я┌я▄ п©я─п╬пЁя─п╟п╪п╪я┐    */
                }
                else
                    return 3; /* п╣я│п╩п╦ я┌п╦п© я┌п╣я─п╪п╟ п╫п╣ bin  */
                /* fixed,я┌п╬ п╡я▀я┘п╬п╢ п©п╬ п╬я┬п╦п╠-*/
                /* п╨п╣                     */
            }
        }
        return 4;                         /* п╣я│п╩п╦ я┌п╣я─п╪-п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─*/
        /* п╫п╣п╬п©я─п╣п╢п╣п╩п╣п╫, я┌п╬ п╡я▀я┘п╬п╢  */
        /* п©п╬ п╬я┬п╦п╠п╨п╣              */
    }
    else                                      /* п╣я│п╩п╦ п©я─п╟п╡п╟я▐ я┤п╟я│я┌я▄ п╟я─п╦я└-*/
    /* п╪п╣я┌п╦я┤п╣я│п╨п╬пЁп╬ п╡я▀я─п╟п╤п╣п╫п╦я▐  */
    /* п╢п╡я┐я┘я┌п╣я─п╪п╬п╡п╟я▐, я┌п╬:      */
    {
        for ( i = 0; i < ISYM; i++ )      /* п╣я│п╩п╦ п©я─п╟п╡я▀п╧ я┌п╣я─п╪ п╟я─п╦я└- */
        {                                 /* п╪п╣я┌п╦я┤п╣я│п╨п╬пЁп╬ п╡я▀я─п╟п╤п╣п╫п╦я▐  */
            if ( !strcmp ( SYM [i].NAME, /*п╬п©я─п╣п╢п╣п╩п╣п╫ п╡ я┌п╟п╠п╩.SYM,я┌п╬:*/
                          FORMT [IFORMT-1] )  &&
                strlen ( SYM [i].NAME ) ==
                strlen ( FORMT [IFORMT-1] )
                )
            {
                
                
                if ( SYM [i].TYPE == 'D' ) {
                    //convert from decimal to binary
                    //L     RRAB,B
                    //ST    RRAB,BUF+5
                    //CVB   R3,BUF
                    
                    /*
                     memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                     memcpy ( ASS_CARD._BUFCARD.OPERAC, "LH",2 );
                     strcpy ( ASS_CARD._BUFCARD.OPERAND, "R2," );
                     strcat ( ASS_CARD._BUFCARD.OPERAND, FORMT [IFORMT-1] );
                     ZKARD ();
                     */
                    
                    
                    
                    /*
                     memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                     memcpy ( ASS_CARD._BUFCARD.OPERAC, "L", 1 );
                     //TODO what to do if razr will be set later after initialization?
                     strcpy ( ASS_CARD._BUFCARD.OPERAND, "RRAB," );
                     strcat ( ASS_CARD._BUFCARD.OPERAND, FORMT [IFORMT-1] );
                     strcat ( ASS_CARD._BUFCARD.OPERAND, "\n");
                     ZKARD ();
                     
                     memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                     memcpy ( ASS_CARD._BUFCARD.OPERAC, "ST",2 );
                     memcpy ( ASS_CARD._BUFCARD.OPERAND, "RRAB,BUF+5", 10 );
                     ZKARD ();*/
                    
                    
                    memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                    memcpy ( ASS_CARD._BUFCARD.OPERAC, "MVC", 3 );
                    //TODO what to do if razr will be set later after initialization?
                    strcpy ( ASS_CARD._BUFCARD.OPERAND, "BUF+5(3)," );
                    strcat ( ASS_CARD._BUFCARD.OPERAND, FORMT [IFORMT-1] );
                    strcat ( ASS_CARD._BUFCARD.OPERAND, "\n");
                    ZKARD ();
                    
                    
                    
                    memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                    memcpy ( ASS_CARD._BUFCARD.OPERAC, "CVB",3 );
                    memcpy ( ASS_CARD._BUFCARD.OPERAND, "R3,BUF", 6 );
                    ZKARD ();
                    /*
                     memcpy ( ASS_CARD._BUFCARD.METKA, "TRUE", 4 );
                     memcpy ( ASS_CARD._BUFCARD.OPERAC, "DC",2 );
                     memcpy ( ASS_CARD._BUFCARD.OPERAND, "H'1'", 4 );
                     ZKARD ();
                     
                     memcpy ( ASS_CARD._BUFCARD.METKA, "TRUE", 4 );
                     memcpy ( ASS_CARD._BUFCARD.OPERAC, "DC",2 );
                     memcpy ( ASS_CARD._BUFCARD.OPERAND, "H'1'", 4 );
                     ZKARD ();*/
                    
                    
                    if ( STROKA [ DST [I2].DST4 - /* п╣я│п╩п╦ п╤п╣ п╥п╫п╟п╨ п╬п©п╣я─п╟я├п╦п╦  */
                                 strlen ( FORMT [IFORMT-1] ) ] == /* п╟я─п╦я└п╪п╣я┌п╦я┤п╣я│п╨п╬пЁп╬ п╡я▀я─п╟-  */
                        '=' )/* п╤п╣п╫п╦я▐ "=", я┌п╬:         */
                        
                    {
                        
                        //      LH    RRAB,TRUE
                        //      CR    R2,R3
                        //      BC    7,L2      not equal
                        //      BC    15,L1     unconditional
                        //L2    LH    RRAB,FALSE
                        //L1
                        
                        memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAC, "LH", 2 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAND, "RRAB,TRUE", 9 );
                        ZKARD ();
                        
                        memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAC, "CR", 2 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAND, "R2,R3", 5 );
                        ZKARD ();
                        
                        memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAC, "BC", 2 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAND, "7,L2", 4 );
                        ZKARD ();
                        
                        memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAC, "BC", 2 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAND, "15,L1", 5 );
                        ZKARD ();
                        
                        memcpy ( ASS_CARD._BUFCARD.METKA, "L2", 2 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAC, "LH", 2 );
                        memcpy ( ASS_CARD._BUFCARD.OPERAND, "RRAB,FALSE", 10 );
                        ZKARD ();
                        
                        memcpy ( ASS_CARD._BUFCARD.METKA, "L1", 2 );
                        //memcpy ( ASS_CARD._BUFCARD.OPERAC, "NOP", 3 );
                        //memcpy ( ASS_CARD._BUFCARD.OPERAND, "", 0 );
                        //ZKARD ();
                        
                        
                        
                        
                    } else {
                        
                        //error unsupported operation for decimal fixed
                        return 5;
                    }
                    
                    return 0;
                    
                }
                
                
                
                
                
                if ( SYM [i].TYPE == 'D' || SYM [i].TYPE == 'B' ) /* п╣я│п╩п╦ я┌п╦п© п©я─п╟п╡п╬пЁп╬ п╬п©п╣-  */
                {           /* я─п╟п╫п╢п╟ bin fixed, я┌п╬:   */
                    
                    if ( STROKA [ DST [I2].DST4 - /* п╣я│п╩п╦ п╥п╫п╟п╨ п╬п©п╣я─."+",я┌п╬: */
                                 strlen( FORMT [IFORMT-1] ) ] == '+' )
                    {
                        if ( strcmp ( SYM [i].RAZR, "15" ) /* п╣я│п╩п╦ я─п╟п╥я─я▐п╢п╫п╬я│я┌я▄ п©я─п╟п╡. */
                            <= 0 ) /* п╬п©п╣я─п╟п╫п╢п╟ <= 15, я┌п╬:    */
                            memcpy ( ASS_CARD._BUFCARD.OPERAC,
                                    "AH", 2 ); /* я└п╬я─п╪п╦я─я┐п╣п╪ п╨п╬п╢ п╟я│я│п╣п╪п╠п╩п╣-*/
                        else /* я─п╬п╡я│п╨п╬п╧ п╬п©п╣я─п╟я├п╦п╦ "AH",п╟*/
                            memcpy ( ASS_CARD._BUFCARD.OPERAC,
                                    "A", 1 ); /* п╦п╫п╟я┤п╣ - "A"            */
                    }
                    
                    else if ( STROKA [ DST [I2].DST4 - /* п╣я│п╩п╦ п╤п╣ п╥п╫п╟п╨ п╬п©п╣я─п╟я├п╦п╦  */
                                      strlen ( FORMT [IFORMT-1] ) ] == /* п╟я─п╦я└п╪п╣я┌п╦я┤п╣я│п╨п╬пЁп╬ п╡я▀я─п╟-  */
                             '-' )/* п╤п╣п╫п╦я▐ "-", я┌п╬:         */
                        
                    {
                        if ( strcmp ( SYM [i].RAZR, "15" )/* п©я─п╦ я─п╟п╥я─я▐п╢п╫п╬я│я┌п╦ п╟я─п╦я└-  */
                            <= 0 ) /* п╪п╣я┌п╦я┤.п╡я▀я─п╟п╤.<= 15      */
                            memcpy( ASS_CARD._BUFCARD.OPERAC,/* я└п╬я─п╪п╦я─я┐п╣п╪ п╨п╬п╢ п╟я│я│п╣п╪п╠п╩п╣-*/
                                   "SH", 2 ); /* я─п╬п╡я│п╨п╬п╧ п╬п©п╣я─п╟я├п╦п╦ "SH",F*/
                        else
                            memcpy( ASS_CARD._BUFCARD.OPERAC,/* п╦п╫п╟я┤п╣ - "S"            */
                                   "S", 1 );
                    }
                    
                    else
                    {
                        
                        return 5; /* п╣я│п╩п╦ п╥п╫п╟п╨ п╬п©п╣я─п╟я├п╦п╦ п╫п╣  */
                        /* "+" п╦ п╫п╣ "-", я┌п╬ п╥п╟п╡п╣я─-*/
                        /* я┬п╣п╫п╦п╣  п©я─п╬пЁя─п╟п╪п╪я▀  п©п╬   */
                        /* п╬я┬п╦п╠п╨п╣                 */
                    }
                    /* я└п╬я─п╪п╦я─я┐п╣п╪:             */
                    strcpy ( ASS_CARD._BUFCARD.OPERAND, /* - п©п╣я─п╡я▀п╧ п╬п©п╣я─п╟п╫п╢ п╟я│я│п╣п╪-*/
                            "RRAB," );/*п╠п╩п╣я─п╬п╡я│п╨п╬п╧ п╬п©п╣я─п╟я├п╦п╦;    */
                    strcat ( ASS_CARD._BUFCARD.OPERAND, /* - п╡я┌п╬я─п╬п╧ п╬п©п╣я─п╟п╫п╢ п╟я│я│п╣п╪-*/
                            FORMT [IFORMT-1] );/*п╠п╩п╣я─п╬п╡я│п╨п╬п╧ п╬п©п╣я─п╟я├п╦п╦;    */
                    ASS_CARD._BUFCARD.OPERAND [ strlen
                                               ( ASS_CARD._BUFCARD.OPERAND )] =/* - я─п╟п╥п╢п╣п╩я▐я▌я┴п╦п╧ п©я─п╬п╠п╣п╩;  */
                    ' ';
                    memcpy ( ASS_CARD._BUFCARD.COMM,
                            "Formation of intermediate value",/* - п©п╬я│я┌я─п╬я┤п╫я▀п╧ п╨п╬п╪п╣п╫я┌п╟я─п╦п╧*/
                            36 );
                    ZKARD (); /* п╥п╟п©п╬п╪п╦п╫п╟п╫п╦п╣ п╟я│я│п╣п╪п╠п╩п╣-  */
                    /* я─п╬п╡я│п╨п╬п╧ п╬п©п╣я─п╟я├п╦п╦       */
                    
                    return 0; /* я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬п╣п╫п╦п╣    */
                    /* п©п╬пЁя─п╟п╪п╪я▀               */
                }
                else
                    
                    
                    
                    return 3; /* п╣я│п╩п╦ я┌п╦п© п©я─п╟п╡п╬пЁп╬ п╬п©п╣-  */
                /* я─п╟п╫п╢п╟ п╟я─п╦я└п╪п╣я┌п╦я┤п╣я│п╨п╬пЁп╬  */
                /* п╡я▀я─п╟п╤п╣п╫п╦я▐ п╫п╣ bin fixed,*/
                /* я┌п╬ п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ п©я─п╬пЁя─п╟п╪- */
                /* п╪я▀ п©п╬ п╬я┬п╦п╠п╨п╣           */
            }
        }
        return 4;                         /* п╣я│п╩п╦ п©я─п╟п╡я▀п╧ п╬п©п╣я─п╟п╫п╢    */
        /* п╟я─п╦я└п╪п╣я┌п╦я┤п╣я│п╨п╬пЁп╬ п╡я▀я─п╟п╤п╣-*/
        /*п╫п╦я▐ п╫п╣ п╬п©я─п╣п╢п╣п╩п╣п╫ п╡ я┌п╟п╠п╩.*/
        /* SYM, я┌п╬ п╥п╟п╡п╣я─я┬п╦я┌я▄ п©я─п╬- */
        /* пЁя─п╟п╪п╪я┐ п©п╬ п╬я┬п╦п╠п╨п╣       */
    }
    
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ BUK п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* BUK -   "п╠я┐п╨п╡п╟"        */

int BUK2 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ CIF п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* CIF -   "я├п╦я└я─п╟"        */

int CIF2 ()
{
    return 0;
}

/*..........................................................................*/


/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ IDE п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* IDE -   "п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─"*/

int IDE2 ()
{
    return 0;
}


/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ IPE п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* IPE - "п╦п╪я▐ п©п╣я─п╣п╪п╣п╫п╫п╬п╧" */

int IPE2 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ IPR п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* IPR -   "п╦п╪я▐ п©я─п╬пЁя─п╟п╪п╪я▀" */

int IPR2 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ LIT п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* LIT -   "п╩п╦я┌п╣я─п╟п╩"      */

int LIT2 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ MAN п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* MAN -   "п╪п╟п╫я┌п╦я│я│п╟"     */

int MAN2 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ ODC п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* ODC - "п╬п©п╣я─п╟я┌.п÷п⌡1- DCL"*/

int ODC2 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ OEN п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* OEN - "п╬п©п╣я─п╟я┌.п÷п⌡1-END" */

/* п©я─п╬пЁя─п╟п╪п╪п╟    я└п╬я─п╪п╦я─я┐п╣я┌ */
/* я█п©п╦п╩п╬пЁ п╟я│я│п╣п╪п╠п╩п╣я─п╬п╡я│п╨п╬пЁп╬*/
/* я█п╨п╡п╦п╡п╟п╩п╣п╫я┌п╟ п÷п⌡1-п©я─п╬пЁ-  */
/* я─п╟п╪п╪я▀                  */
int OEN2 ()
{
    char RAB [20];
    char i = 0;
    FORM ();                                  /* я└п╬я─п╪п╟я┌п╦я─я┐п╣п╪ п÷п⌡1-п╬п©п╣я─п╟- */
    /* я┌п╬я─ END                */
    
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "BCR", 3 ); /* я└п╬я─п╪п╦я─я┐п╣п╪ п╨п╬п╢ п╠п╣п╥я┐я│п╩п╬п╡-*/
    /*п╫п╬пЁп╬ п╡п╬п╥п╡я─п╟я┌п╟ я┐п©я─п╟п╡п╩п╣п╫п╦я▐*/
    /* п╡ п╡я▀п╥я▀п╡п╟я▌я┴я┐я▌ п©я─п╬пЁя─п╟п╪п╪я┐ */
    
    memcpy ( ASS_CARD._BUFCARD.OPERAND,"15,14", 5 );/* п╬п©п╣я─п╟п╫п╢я▀ п╨п╬п╪п╟п╫п╢я▀ п╦     */
    
    memcpy ( ASS_CARD._BUFCARD.COMM,          /* п©п╬п╩п╣ п©п╬я│я┌я─п╬я┤п╫п╬пЁп╬ п╨п╬п╪п╣п╫-*/
            "п▓я▀я┘п╬п╢ п╦п╥ п©я─п╬пЁя─п╟п╪п╪я▀", 18 );/* я┌п╟я─п╦я▐                  */
    
    ZKARD ();                                 /* п╥п╟п©п╬п╪п╫п╦я┌я▄ п╬п©я─п╣п╟я├п╦я▌     */
    /* п░я│я│п╣п╪п╠п╩п╣я─п╟             */
    
    /* п╢п╟п╩п╣п╣ п╦п╢п╣я┌ п╠п╩п╬п╨ я└п╬я─п╪п╦- */
    /* я─п╬п╡п╟п╫п╦я▐ п╢п╣п╨п╩п╟я─п╟я┌п╦п╡п╫я▀я┘  */
    /* п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦п╧ DC п╢п╩я▐  */
    /* п╨п╟п╤п╢п╬пЁп╬ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─п╟,*/
    /* п©п╬п©п╟п╡я┬п╣пЁп╬ п╡ я┌п╟п╠п╩.SYM   */
    
    
    
    //TRUE     DC    H'1'
    memcpy ( ASS_CARD._BUFCARD.METKA, "TRUE", 4 );
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "DC",2 );
    memcpy ( ASS_CARD._BUFCARD.OPERAND, "H'1'", 4 );
    ZKARD ();
    
    //FALSE    DC    H'0'
    memcpy ( ASS_CARD._BUFCARD.METKA, "FALSE", 5 );
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "DC",2 );
    memcpy ( ASS_CARD._BUFCARD.OPERAND, "H'0'", 4 );
    ZKARD ();
    
    
    
    for ( i = 0; i < ISYM; i++ )
    {                                         /* п╣я│п╩п╦ я│я┌я─п╬п╨п╟ я┌п╟п╠п╩.SYM   */
        if ( isalpha ( SYM [i].NAME [0] ) ) /* я│п╬п╢п╣я─п╤п╦я┌ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─,*/
        /* я┌.п╣.п╫п╟я┤п╦п╫п╟п╣я┌я│я▐ я│ п╠я┐п╨п╡я▀,*/
        {                                 /* я┌п╬:                    */
            if ( SYM [i].TYPE == 'B' ) /* п╣я│п╩п╦ я┌п╦п© п╬п©п╣я─п╟я┌п╬я─п╟ bin */
            /* fixed, я┌п╬:             */
            {
                /*
                //reserve bytes before binary (unnessecary in some cases)
                //         DS    0H
                memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
                memcpy ( ASS_CARD._BUFCARD.OPERAC, "DS",2 );
                memcpy ( ASS_CARD._BUFCARD.OPERAND, "0H", 2 );
                ZKARD ();
                */
                
                strcpy ( ASS_CARD._BUFCARD.METKA, /* п©п╦я┬п╣п╪ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─ п╡  */
                        SYM [i].NAME ); /* п©п╬п╩п╣ п╪п╣я┌п╨п╦ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟-*/
                /* я├п╦п╦ DC                 */
                ASS_CARD._BUFCARD.METKA [ strlen
                                         ( ASS_CARD._BUFCARD.METKA ) ] = ' '; /* п©п╦я┬п╣п╪ я─п╟п╥п╢п╣п╩п╦я┌п╣п╩я▄ п©п╬п╩п╣п╧*/
                
                memcpy ( ASS_CARD._BUFCARD.OPERAC, /* п©п╦я┬п╣п╪ п╨п╬п╢ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟- */
                        "DC", 2 ); /* я├п╦п╦ DC                 */
                
                if ( strcmp ( SYM [i].RAZR, "15" ) <= 0 ) /* я└п╬я─п╪п╦я─я┐п╣п╪ п╬п©п╣я─п╟п╫п╢я▀ п©я│п╣-*/
                /* п╡п╢п╬п╬п©п╣я─п╟я├п╦п╦ DC         */
                    strcpy ( ASS_CARD._BUFCARD.OPERAND, /* п╢п╩я▐ я│п╩я┐я┤п╟я▐ п©п╬п╩я┐я│п╩п╬п╡п╟   */
                            "H\'" );
                else        /* п╦п╩п╦                    */
                    
                    strcpy ( ASS_CARD._BUFCARD.OPERAND,      /* п╢п╩я▐ я│п╩я┐я┤п╟я▐ я│п╩п╬п╡п╟       */ "F\'" );
                
                //Dos command
                //  strcat ( ASS_CARD._BUFCARD.OPERAND,       /* я└п╬я─п╪п╦я─я┐п╣п╪ я├п╦я└я─п╬п╡я┐я▌     */
                //     ltoa ( VALUE (SYM [i].INIT),     /* я┤п╟я│я┌я▄ п╬п©п╣я─п╟п╫п╢п╟ п©я│п╣п╡п╢п╬- */
                //         &RAB [0], 10) ); /* п╬п©п╣я─п╟я├п╦п╦,              */
                //let's do that in Unix!
                long int val = VALUE(SYM[i].INIT);
                //printf("%d",val);
                strcat(ASS_CARD._BUFCARD.OPERAND, gcvt(val, 10, &RAB[0]));
                ASS_CARD._BUFCARD.OPERAND [ strlen /* п╥п╟п╪я▀п╨п╟я▌я┴п╦п╧ п╟п©п╬я│я┌я─п╬я└    */
                                           ( ASS_CARD._BUFCARD.OPERAND ) ] = '\''; /*          п╦             */
                
                memcpy ( ASS_CARD._BUFCARD.COMM, /* п©п╬п╩п╣ п©п╬я│я┌я─п╬я┤п╫п╬пЁп╬ п╨п╬п╪п╣п╫-*/
                        "Defining a Variable", 22 ); /* я┌п╟я─п╦я▐                  */
                
                ZKARD ();   /* п╥п╟п©п╬п╪п╫п╦я┌я▄ п╬п©п╣я─п╟я├п╦я▌     */
                /*    п░я│я│п╣п╪п╠п╩п╣я─п╟          */
            } else if (SYM[i].TYPE == 'D') {
                strcpy ( ASS_CARD._BUFCARD.METKA, /* п©п╦я┬п╣п╪ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─ п╡  */
                        SYM [i].NAME ); /* п©п╬п╩п╣ п╪п╣я┌п╨п╦ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟-*/
                /* я├п╦п╦ DC                 */
                ASS_CARD._BUFCARD.METKA [ strlen
                                         ( ASS_CARD._BUFCARD.METKA ) ] = ' '; /* п©п╦я┬п╣п╪ я─п╟п╥п╢п╣п╩п╦я┌п╣п╩я▄ п©п╬п╩п╣п╧*/
                
                memcpy ( ASS_CARD._BUFCARD.OPERAC, /* п©п╦я┬п╣п╪ п╨п╬п╢ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟- */
                        "DC", 2 ); /* я├п╦п╦ DC                 */
                
                strcpy ( ASS_CARD._BUFCARD.OPERAND,      /* п╢п╩я▐ я│п╩я┐я┤п╟я▐ я│п╩п╬п╡п╟       */ "DL3\'" );
                
                //Dos command
                //  strcat ( ASS_CARD._BUFCARD.OPERAND,       /* я└п╬я─п╪п╦я─я┐п╣п╪ я├п╦я└я─п╬п╡я┐я▌     */
                //     ltoa ( VALUE (SYM [i].INIT),     /* я┤п╟я│я┌я▄ п╬п©п╣я─п╟п╫п╢п╟ п©я│п╣п╡п╢п╬- */
                //         &RAB [0], 10) ); /* п╬п©п╣я─п╟я├п╦п╦,              */
                //let's do that in Unix!
                strcat(ASS_CARD._BUFCARD.OPERAND, gcvt(VALUE(SYM[i].INIT), 10, &RAB[0]));
                ASS_CARD._BUFCARD.OPERAND [ strlen /* п╥п╟п╪я▀п╨п╟я▌я┴п╦п╧ п╟п©п╬я│я┌я─п╬я└    */
                                           ( ASS_CARD._BUFCARD.OPERAND ) ] = '\''; /*          п╦             */
                
                memcpy ( ASS_CARD._BUFCARD.COMM, /* п©п╬п╩п╣ п©п╬я│я┌я─п╬я┤п╫п╬пЁп╬ п╨п╬п╪п╣п╫-*/
                        "Defining a Variable", 22 ); /* я┌п╟я─п╦я▐                  */
                
                ZKARD ();   /* п╥п╟п©п╬п╪п╫п╦я┌я▄ п╬п©п╣я─п╟я├п╦я▌     */
                
            }
        }
    }
    
    
    //TODO place buf to SUM (declare constant buffers only if nessecary for code)
    
    //         DS    0F
    //BUF      DC    DL8'0'
    memcpy ( ASS_CARD._BUFCARD.METKA, "", 0 );
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "DS",2 );
    memcpy ( ASS_CARD._BUFCARD.OPERAND, "0F", 2 );
    ZKARD ();
    memcpy ( ASS_CARD._BUFCARD.METKA, "BUF", 3 );
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "DC",2 );
    memcpy ( ASS_CARD._BUFCARD.OPERAND, "DL8'0'", 6 );
    ZKARD ();
    
    
    
    /* п╢п╟п╩п╣п╣ п╦п╢п╣я┌ п╠п╩п╬п╨ п╢п╣п╨п╩п╟- */
    /* я─п╟я┌п╦п╡п╫я▀я┘ п╟я│я│п╣п╪п╠п╩п╣я─п╬п╡я│- */
    /* п╨п╦я┘ EQU-п╬п©п╣я─п╟я┌п╬я─п╬п╡, п╬п©-*/
    /* я─п╣п╢п╣п╩я▐я▌я┴п╦я┘ п╠п╟п╥п╬п╡я▀п╧ п╦   */
    /* я─п╟п╠п╬я┤п╦п╧ я─п╣пЁп╦я│я┌я─я▀ п╬п╠я┴п╣пЁп╬*/
    /* п╫п╟п╥п╫п╟я┤п╣п╫п╦я▐             */
    
    memcpy ( ASS_CARD._BUFCARD.METKA, "RBASE", 5 ); /* я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ EQU-п©я│п╣п╡- */
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "EQU",3 ); /* п╢п╬п╬п©п╣я─п╟я├п╦п╦ п╬п©я─п╣п╢п╣п╩п╣п╫п╦я▐ */
    memcpy ( ASS_CARD._BUFCARD.OPERAND, "15", 2 ); /* п╫п╬п╪п╣я─п╟ п╠п╟п╥п╬п╡п╬пЁп╬ я─п╣пЁп╦я│я┌-*/
    /* я─п╟ п╬п╠я┴п╣пЁп╬ п╫п╟п╥п╫п╟я┤п╣п╫п╦я▐   */
    /*           п╦            */
    ZKARD ();                                 /* п╥п╟п©п╬п╪п╦п╫п╟п╫п╦п╣ п╣п╣         */
    
    memcpy ( ASS_CARD._BUFCARD.METKA, "RRAB", 4 ); /* я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ EQU-п©я│п╣п╡- */
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "EQU",3 ); /* п╢п╬п╬п©п╣я─п╟я├п╦п╦ п╬п©я─п╣п╢п╣п╩п╣п╫п╦я▐ */
    memcpy ( ASS_CARD._BUFCARD.OPERAND, "5", 1 ); /* п╫п╬п╪п╣я─п╟ п╠п╟п╥п╬п╡п╬пЁп╬ я─п╣пЁп╦я│я┌-*/
    /* я─п╟ п╬п╠я┴п╣пЁп╬ п╫п╟п╥п╫п╟я┤п╣п╫п╦я▐   */
    /*            п╦           */
    ZKARD ();                                 /* п╥п╟п©п╬п╪п╦п╫п╟п╫п╦п╣ п╣п╣         */\
    
    memcpy ( ASS_CARD._BUFCARD.METKA, "R2", 2 ); /* я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ EQU-п©я│п╣п╡- */
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "EQU",3 ); /* п╢п╬п╬п©п╣я─п╟я├п╦п╦ п╬п©я─п╣п╢п╣п╩п╣п╫п╦я▐ */
    memcpy ( ASS_CARD._BUFCARD.OPERAND, "2", 1 ); /* п╫п╬п╪п╣я─п╟ п╠п╟п╥п╬п╡п╬пЁп╬ я─п╣пЁп╦я│я┌-*/
    /* я─п╟ п╬п╠я┴п╣пЁп╬ п╫п╟п╥п╫п╟я┤п╣п╫п╦я▐   */
    /*            п╦           */
    ZKARD ();                                 /* п╥п╟п©п╬п╪п╦п╫п╟п╫п╦п╣ п╣п╣         */
    
    memcpy ( ASS_CARD._BUFCARD.METKA, "R3", 2 ); /* я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ EQU-п©я│п╣п╡- */
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "EQU",3 ); /* п╢п╬п╬п©п╣я─п╟я├п╦п╦ п╬п©я─п╣п╢п╣п╩п╣п╫п╦я▐ */
    memcpy ( ASS_CARD._BUFCARD.OPERAND, "3", 1 ); /* п╫п╬п╪п╣я─п╟ п╠п╟п╥п╬п╡п╬пЁп╬ я─п╣пЁп╦я│я┌-*/
    /* я─п╟ п╬п╠я┴п╣пЁп╬ п╫п╟п╥п╫п╟я┤п╣п╫п╦я▐   */
    /*            п╦           */
    ZKARD ();                                 /* п╥п╟п©п╬п╪п╦п╫п╟п╫п╦п╣ п╣п╣         */
    
    
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "END", 3 ); /* я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ п╨п╬п╢п╟ п╟я│-  */
    /* я│п╣п╪п╠п╩п╣я─п╬п╡я│п╨п╬п╧ п©я│п╣п╡п╢п╬-  */
    /* п╬п©п╣я─п╟я├п╦п╦ END,          */
    i = 0;
    
    while ( FORMT [1][i] != '\x0' )           /* п╣п╣ п╬п©п╣я─п╟п╫п╢п╟            */
        ASS_CARD._BUFCARD.OPERAND [i] = FORMT [1][i++]; /*         п╦              */
    
    memcpy ( ASS_CARD._BUFCARD.COMM,          /* п©п╬я│я┌я─п╬я┤п╫п╬пЁп╬ п╨п╬п╪п╣п╫я┌п╟я─п╦я▐ */
            "End of program", 15 );
    
    ZKARD ();                                 /* п╥п╟п©п╬п╪п╦п╫п╟п╫п╦п╣ п©я│п╣п╡п╢п╬п╬п©п╣- */
    /* я─п╟я├п╦п╦                  */
    
    return 0;                                 /* п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ п©я─п╬пЁя─п╟п╪п╪я▀   */
}

/*..........................................................................*/

/* program*/
/* semantic calculations*/
/* non-terminal OPA to VTO*/
/* rum aisle. Here*/
/* OPA - "operational assignment"*/
/* Vania arithmetic*/

int OPA2 ()
{
    int i;
    
    FORM ();                                  /*я└п╬я─п╪п╟я┌п╦я─я┐п╣п╪ п÷п⌡1-п╬п©п╣я─п╟я┌п╬я─*/
    /*п©я─п╦я│п╡п╟п╦п╡п╟п╫п╦я▐ п╟я─п╦я└п╪п╣я┌п╦я┤. */
    
    for ( i = 0; i < ISYM; i++ )
    {                                         /* п╣я│п╩п╦ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─ п©я─п╟-*/
        /* п╡п╬п╧ я┤п╟я│я┌п╦ п╬п©п╣я─п╟я┌п╬я─п╟ п╬п©-*/
        if ( !strcmp ( SYM [i].NAME, FORMT [0] )  &&/* я─п╣п╢п╣п╩п╣п╫ я─п╟п╫п╣п╣ я┤п╣я─п╣п╥    */
            strlen ( SYM [i].NAME ) == /* п╬п©п╣я─п╟я┌п╬я─ DCL, я┌п╬:      */
            strlen ( FORMT [0] )
            )
        {
            if ( SYM [i].TYPE == 'B' ) /* п╣я│п╩п╦ я█я┌п╬я┌ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─*/
            {                   /* п╦п╪п╣п╣я┌ я┌п╦п© bin fixed,я┌п╬:*/
                
                if ( strcmp ( SYM [i].RAZR, "15" ) /* п╣я│п╩п╦ bin fixed (15),я┌п╬:*/
                    <= 0 )
                    memcpy ( ASS_CARD._BUFCARD.OPERAC, /* я│я└п╬я─п╪п╦я─п╬п╡п╟я┌я▄ п╨п╬п╪п╟п╫п╢я┐   */
                            "STH", 3 ); /* п╥п╟п©п╦я│п╦ п©п╬п╩я┐я│п╩п╬п╡п╟       */
                
                else        /* п╦п╫п╟я┤п╣:                 */
                    memcpy ( ASS_CARD._BUFCARD.OPERAC, /* п╨п╬п╪п╟п╫п╢я┐ п╥п╟п©п╦я│п╦ я│п╩п╬п╡п╟   */
                            "ST", 2 );
                
                strcpy ( ASS_CARD._BUFCARD.OPERAND, /*       п╢п╬я└п╬я─п╪п╦я─п╬п╡п╟я┌я▄    */
                        "RRAB," );/*          п╬п©п╣я─п╟п╫п╢я▀      */
                
                strcat ( ASS_CARD._BUFCARD.OPERAND, /*           п╨п╬п╪п╟п╫п╢я▀      */
                        FORMT [0]);
                ASS_CARD._BUFCARD.OPERAND [ strlen /*              п╦         */
                                           ( ASS_CARD._BUFCARD.OPERAND ) ] = ' ';
                
                memcpy ( ASS_CARD._BUFCARD.COMM, /* п©п╬я│я┌я─п╬я┤п╫я▀п╧ п╨п╬п╪п╣п╫я┌п╟я─п╦п╧  */
                        "Generating the value of an arithmetic expression",
                        37 );
                ZKARD ();   /* п╥п╟п©п╬п╪п╫п╦я┌я▄ п╬п©п╣я─п╟я├п╦я▌     */
                /* п░я│я│п╣п╪п╠п╩п╣я─п╟  п╦          */
                return 0;   /* п╥п╟п╡п╣я─я┬п╦я┌я▄ п©я─п╬пЁя─п╟п╪п╪я┐    */
            }
            
            else                /* п╣я│п╩п╦ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─ п╫п╣  */
            /* п╦п╪п╣п╣я┌ я┌п╦п© bin fixed,я┌п╬:*/
                return 3;   /* п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ я│ п╢п╦п╟пЁп╫п╬я│я┌п╦-*/
            /* п╨п╬п╧ п╬я┬п╦п╠п╨п╦             */
        }
    }
    return 4;                                 /* п╣я│п╩п╦ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─ я─п╟- */
    /* п╫п╣п╣ п╫п╣ п╬п©я─п╣п╢п╣п╩п╣п╫ я┤п╣я─п╣п╥ */
    /* п÷п⌡1-п╬п©п╣я─п╟я┌п╬я─ DCL,я┌п╬ п╥п╟-*/
    /* п╡п╣я─я┬п╣п╫п╦п╣ я│ п╢п╦п╟пЁп╫п╬я│я┌п╦п╨п╬п╧*/
    /* п╬я┬п╦п╠п╨п╦                 */
    
}

/*..........................................................................*/

/* program */
/* semantic calculations */
/* non-terminal OPR on second- */
/* rum aisle. Here */
/* OPR - "oper.PL1-PROC" */

/* the program generates */
/* assembler prologue */
/* equivalent to the original */
/* PL1-programs */
int OPR2 ()
{
    char i = 0;
    FORM ();                                  /* я└п╬я─п╪п╟я┌п╦я─я┐п╣п╪ п╬п©п╣я─п╟я┌п╬я─   */
    /* п÷п⌡1 - "п╫п╟я┤п╟п╩п╬ п©я─п╬я├п╣п╢я┐я─-*/
    /* п╫п╬пЁп╬ п╠п╩п╬п╨п╟"            */
    while ( FORMT [0][i] != '\x0' )
        ASS_CARD._BUFCARD.METKA [i++] = FORMT [0][i]; /* п╫я┐п╩п╣п╡п╬п╧ я┌п╣я─п╪ п╦я│п©п╬п╩я▄п╥я┐п╣п╪*/
    /* п╨п╟п╨ п╪п╣я┌п╨я┐ п╡ START-п©я│п╣п╡-*/
    /* п╢п╬п╬п©п╣я─п╟я├п╦п╦ п░я│я│п╣п╪п╠п╩п╣я─п╟  */
    
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "START", 5 );/* п╢п╬я│я┌я─п╟п╦п╡п╟п╣п╪ п╨п╬п╢ п╦ п╬п©п╣- */
    memcpy ( ASS_CARD._BUFCARD.OPERAND, "0", 1 ); /* я─п╟п╫п╢я▀  п╡  START-п©я│п╣п╡п╢п╬-*/
    memcpy ( ASS_CARD._BUFCARD.COMM,          /* п╬п©п╣я─п╟я├п╦п╦ п░я│я│п╣п╪п╠п╩п╣я─п╟    */
            "Start program", 16 );
    ZKARD ();                                 /* п╥п╟п©п╬п╪п╦п╫п╟п╣п╪ п╨п╟я─я┌я┐ п░я│я│п╣п╪-*/
    /* п╠п╩п╣я─п╟                  */
    
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "BALR", 4 ); /* я└п╬я─п╪п╦я─я┐п╣п╪ BALR-п╬п©п╣я─п╟я├п╦я▌*/
    memcpy ( ASS_CARD._BUFCARD.OPERAND,       /* п░я│я│п╣п╪п╠п╩п╣я─п╟             */
            "RBASE,0", 7 );
    memcpy ( ASS_CARD._BUFCARD.COMM,
            "Load base register", 22 );
    ZKARD ();                                 /* п╦ п╥п╟п©п╬п╪п╦п╫п╟п╣п╪ п╣п╣        */
    
    memcpy ( ASS_CARD._BUFCARD.OPERAC, "USING", 5 );/* я└п╬я─п╪п╦я─я┐п╣п╪ USING-п©я│п╣п╡п╢п╬-*/
    memcpy ( ASS_CARD._BUFCARD.OPERAND,       /* п╬п©п╣я─п╟я├п╦я▌ п░я│я│п╣п╪п╠п╩п╣я─п╟    */
            "*,RBASE", 7 );
    memcpy ( ASS_CARD._BUFCARD.COMM,
            "Set register as base", 23 );
    ZKARD ();                                 /* п╦ п╥п╟п©п╬п╪п╦п╫п╟п╣п╪ п╣п╣        */
    
    return 0;                                 /* п╥п╟п╡п╣я─я┬п╦я┌я▄ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪я┐ */
}

/*..........................................................................*/

/* program */
/* semantic calculations */
/* non-terminal PRO on auto- */
/* rum aisle. Here */
/* PRO - "program" */

int PRO2 ()                                       /*п©я─п╬пЁя─.я└п╬я─п╪п╦я─я┐п╣я┌ п╡я▀я┘п╬п╢п╫п╬п╧*/
{                                                 /*я└п╟п╧п╩                    */
    
    FILE *fp;                                 /*п╫п╟п╠п╬я─                   */
    /*я─п╟п╠п╬я┤п╦я┘                 */
    /*п©п╣я─п╣п╪п╣п╫п╫я▀я┘              */
    
    strcat ( NFIL, "ass" );                   /*я│я└п╬я─п╪п╦я─п╬п╡п╟я┌я▄ п╦п╪я▐ п╡я▀я┘п╬п╢- */
    /*п╫п╬пЁп╬ я└п╟п╧п╩п╟              */
    
    if ( (fp = fopen ( NFIL, "wt" )) == NULL ) /*п©я─п╦ п╫п╣я┐п╢п╟я┤п╫.п╬я┌п╨я─я▀я┌.я└-п╩п╟ */
        return (7);                       /* я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬п╦п╠п╨п╣    */
    
    else                                      /*п╦п╫п╟я┤п╣:                  */
        //fwrite (ASSTXT, 80, IASSTXT, fp); /* я└п╬я─п╪п╦я─я┐п╣п╪ я┌п╣п╩п╬ п╬п╠.я└п╟п╧п╩п╟*/
        
        for(int assi=0;assi<MAXLTXT;assi++)
        {
            ASSTXT[assi][78]='\n';
            fprintf(fp, "%s",ASSTXT[assi]);
            printf("%s",ASSTXT[assi]);
        }
    fclose ( fp );                            /*п╥п╟п╨я─я▀п╡п╟п╣п╪ п╬п╠'п╣п╨я┌п╫я▀п╧ я└п╟п╧п╩*/
    return ( 0 );                             /*п╥п╟п╡п╣я─я┬п╦я┌я▄ п©п╬п╩п╢п©я─п╬пЁя─п╟п╪п╪я┐ */
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ RZR п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* RZR - "я─п╟п╥я─я▐п╢п╫п╬я│я┌я▄"    */

int RZR2 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ TEL п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* TEL - "я┌п╣п╩п╬ п©я─п╬пЁя─п╟п╪п╪я▀" */

int TEL2 ()
{
    return 0;
}

/*..........................................................................*/

/* п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟      */
/* я│п╣п╪п╟п╫я┌п╦я┤. п╡я▀я┤п╦я│п╩п╣п╫п╦я▐   */
/* п╫п╣я┌п╣я─п╪п╦п╫п╟п╩п╟ ZNK п╫п╟ п╡я┌п╬-*/
/* я─п╬п╪ п©я─п╬я┘п╬п╢п╣.   п≈п╢п╣я│я▄   */
/* ZNK - "п╥п╫п╟п╨ п╬п©п╣я─п╟я├п╦п╦"  */

int ZNK2 ()
{
    return 0;
}

/*..........................................................................*/

/*  п© я─ п╬ пЁ я─ п╟ п╪ п╪ п╟     */
/* я┐п©я─п╟п╡п╩п╣п╫п╦я▐ п╟п╠я│я┌я─п╟п╨я┌п╫п╬п╧ */
/* п╜п▓п°  -  я│п╣п╪п╟п╫я┌п╦я┤п╣я│п╨п╬пЁп╬ */
/* п╡я▀я┤п╦я│п╩п╦я┌п╣п╩я▐, п╦п╫я┌п╣я─п©я─п╣- */
/* я┌п╦я─я┐я▌я┴п╣пЁп╬ п╟п╠я│я┌я─п╟п╨я┌п╫я┐я▌  */
/* п©я─п╬пЁя─п╟п╪п╪я┐, я│я└п╬я─п╪п╦я─п╬п╡п╟п╫-*/
/* п╫я┐я▌ я│п╦п╫я┌п╟п╨я│п╦я┤п╣я│п╨п╦п╪ п╟п╫п╟-*/
/* п╩п╦п╥п╟я┌п╬я─п╬п╪ п╡ я│я┌п╣п╨п╣ п╢п╬я│- */
/* я┌п╦пЁп╫я┐я┌я▀я┘ я├п╣п╩п╣п╧.        */

/* п║я┐я┌я▄ п╟п╩пЁп╬я─п╦я┌п╪п╟ я┐п©я─п╟п╡п╩п╣-*/
/*п╫п╦я▐  п╡  п©п╬я│п╩п╣п╢п╬п╡п╟я┌п╣п╩я▄п╫п╬п╧*/
int gen_COD ()                                    /*п╦п╫я┌п╣я─п©я─п╣я┌п╟я├п╦п╦ я│я┌я─п╬п╨ я│я┌п╣-*/
{                                                 /*п╨п╟ п╢п╬я│я┌п╦п╤п╣п╫п╦п╧  п╡ п╫п╟п©я─п╟п╡-*/
    int NOSH;                                 /*п╩п╣п╫п╦п╦ п╬я┌ п╢п╫п╟ п╨ п╡п╣я─я┬п╦п╫п╣. */
    
    int (*FUN [NNETRM][2]) () =               /*п÷я─п╦ я█я┌п╬п╪ п╨п╟п╤п╢п╟я▐ я│я┌я─п╬п╨п╟  */
    {                                         /*п╡п╬я│п©я─п╦п╫п╦п╪п╟п╣я┌я│я▐ п╨п╟п╨ п╨п╬п╪п╟-*/
        { /*    1  */ AVI1, AVI2 },       /*п╫п╢п╟ п╟п╠я│я┌я─п╟п╨я┌п╫п╬п╧ п╜п▓п° я│п╬  */
        { /*    2  */ BUK1, BUK2 },       /*я│п╩п╣п╢я┐я▌я┴п╦п╪п╦ п©п╬п╩я▐п╪п╦:      */
        { /*    3  */ CIF1, CIF2 },
        { /*    4  */ IDE1, IDE2 }, /* - DST.DST1 - п╨п╬п╢ п╬п©п╣я─п╟-*/
        { /*    5  */ IPE1, IPE2 }, /*я├п╦п╦;                    */
        { /*    6  */ IPR1, IPR2 },
        { /*    7  */ LIT1, LIT2 },       /* - DST.DST2 - п╩п╣п╡п╟я▐ пЁя─п╟-*/
        { /*    8  */ MAN1, MAN2 }, /*п╫п╦я├п╟ п╦п╫я┌п╣я─п©я─п╣я┌п╦я─я┐п╣п╪п╬пЁп╬  */
        { /*    9  */ ODC1, ODC2 }, /*я└я─п╟пЁп╪п╣п╫я┌п╟ п╦я│я┘.я┌п╣п╨я│я┌п╟;   */
        { /*   10  */ OEN1, OEN2 },
        { /*   11  */ OPA1, OPA2 }, /* - DST.DST4 -п©я─п╟п╡п╟я▐ пЁя─п╟-*/
        { /*   12  */ OPR1, OPR2 }, /*п╫п╦я├п╟ п╦п╫я┌п╣я─п©я─п╣я┌п╦я─я┐п╣п╪п╬пЁп╬  */
        { /*   13  */ PRO1, PRO2 }, /*я└я─п╟пЁп╪п╣п╫я┌п╟ п╦я│я┘.я┌п╣п╨я│я┌п╟.   */
        { /*   14  */ RZR1, RZR2 },
        { /*   15  */ TEL1, TEL2 },
        { /*   16  */ ZNK1, ZNK2 }
    };
    
    for ( I2 = 0; I2 < L; I2++ )              /* п╬я─пЁп╟п╫п╦п╥п╟я├п╦я▐ п©п╣я─п╡п╬пЁп╬    */
        if ( ( NOSH = FUN [               /* п©я─п╬я┘п╬п╢п╟ я│п╣п╪п╟п╫я┌п╦я┤п╣я│п╨п╬пЁп╬ */
                           numb ( DST [I2].DST1, 3 ) /* п╡я▀я┤п╦я│п╩п╣п╫п╦я▐             */
                           ][0] ()
              ) != 0
            )
            return (NOSH);            /* п╡я▀я┘п╬п╢ п╦п╥ п©я─п╬пЁя─п╟п╪п╪я▀     */
    /* п©п╬ п╬я┬п╦п╠п╨п╣              */
    
    for ( I2 = 0; I2 < L; I2++ )              /* п╬я─пЁп╟п╫п╦п╥п╟я├п╦я▐ п╡я┌п╬я─п╬пЁп╬    */
        if ( ( NOSH = FUN [               /* п©я─п╬я┘п╬п╢п╟ я│п╣п╪п╟п╫я┌п╦я┤п╣я│п╨п╬пЁп╬ */
                           numb ( DST [I2].DST1, 3 ) /* п╡я▀я┤п╦я│п╩п╣п╫п╦я▐             */
                           ][1] ()
              ) != 0
            )
            return (NOSH);            /* п╡я▀я┘п╬п╢ п╦п╥ п©я─п╬пЁя─п╟п╪п╪я▀     */
    /* п©п╬ п╬я┬п╦п╠п╨п╣              */
    
    return 0;                                 /* я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬п╣п╫п╦п╣    */
    /* п©я─п╬пЁя─п╟п╪п╪я▀              */
}

/*..........................................................................*/

/*  program,    */
/* organizing sequential processing of */
/* the source text:        */
/* - lexical analyzer; */
/* - syntax analyzer; */
/* - semantic calculator */
int main (int argc, char **argv )
{                                                 /* working variables:    */
    FILE *fp;                                 /* - file pointer;   */
    char *ptr=argv[1];                        /* - pointer to the first */
    /* command line parameter */
    
    system("pwd");
    
    strcpy ( NFIL, ptr );                     /* extract the name of the translated */
    /* program from the command line */
    /* into the working field   */
    
    /* check the correctness of the command line */
    if ( argc != 2 )
        
    {                                         /* in case of an error in the command line */
        printf ("%s\n", "Error in command line"); /* output diagnostic message and */
        return 1;                           /* end translation   */
    }
    
    /* check the type of source file */
    if
        (
	        strcmp ( &NFIL [ strlen ( NFIL )-3 ], "pli" ) /* if type is not "pli", then: */
         )
        
    {
        printf ( "%s\n",                  /* output diagnostic message and */
                "Incorrect source file type" );
        return 1;                           /* end translation   */
    }
    
    
    else                                      /* if file type is "pli", then */
        
    {                                         /* try to open file and */
        if ( (fp = fopen ( NFIL, "rb" )) == NULL ) /* if file open fails */
        /* error message and  */
        {
            printf ( "%s\n",
                    "Source file not found" );
            return 1;                   /* end translation  */
        }
        
        else                              /* otherwise:                 */
        /* write the file to the array */
        /*  ISXTXT                */
        {
            for ( NISXTXT = 0; NISXTXT <= MAXNISXTXT; NISXTXT++ )
            {
                memset(ISXTXT[NISXTXT], 0, 80*sizeof(char));
                if ( fgets(ISXTXT[NISXTXT], 80, fp) == NULL )//!fread ( ISXTXT [NISXTXT], 80, 1, fp ) )
                {
                    if ( feof ( fp ) ) /* at the end of the file go to */
                        goto main1; /* label main1           */
                    else          /* on read failure        */
                    {            /* output diagnostic message     */
                        printf ( "%s\n",
                                "Error reading file with source text" );
                        return 1; /* and end translation */
                    }
                }
                for (int i=0; i<strlen(ISXTXT[NISXTXT]); i++)
                {
                    if(ISXTXT[NISXTXT][i]=='\n')
                        ISXTXT[NISXTXT][i]=0;
                }
            }
            
            printf ( "%s\n",          /* upon array overflow */
                    "Source text buffer overflow" ); /* ISXTXT output diagnostic */
            return 1;                   /* and end translation */
        }
        
    }
main1:                                            /* upon completion of reading */
    /* the source file forms */
    fclose ( fp );                            /* prefix of the output file name */
    NFIL [ strlen ( NFIL )-3 ] = '\x0';       /* for the Assembler file */
    
    memset ( ASS_CARD.BUFCARD, ' ', 80 );     /* clearing the output assembler */
    /* file line buffer */
    
    compress_ISXTXT ();                       /* lexical analysis */
    /* of the source text */
    
    build_TPR ();                             /* building the successor matrix */
    
    if ( (sint_ANAL ()) )                     /* syntax analysis */
    {                                         /* of the source text */
        STROKA [I4 +20] = '\x0';
        printf                            /* if syntax errors are found */
        (                         /* then: */
         "%s%s%s%s\n",
         "syntax error in source text -> ", /* output diagnostic message and */
         "\"...",&STROKA [I4], "...\""
         );
        printf
        (
         "%s\n", "translation aborted"
         );
        return 1;                           /* end translation   */
    }
    else                                      /* otherwise */
    {
        switch ( gen_COD () )             /* semantic calculation */
        {
            case  0:                          /* if termination code = 0, */
                /* then:                    */
                
                printf ( "%s\n",          /* - diagnostic message; */
                        "translation successfully completed" );
                return 1;                   /* - end the translation */
                
                
            case  1:                          /* if termination code = 1, */
                /* then:                    */
                printf ( "%s\n",          /* - diagnostic message; */
                        "procedure name mismatch in prologue-epilogue" );
                break;                    /* - exit to general */
                /* diagnostic message; */
                /* diagnostic */
                
            case  2:                          /* if termination code = 2, */
                /* then:                    */
                STROKA [ DST [I2].DST2 +20 ] = '\x0'; /* - diagnostic message; */
                printf ( "%s%s\n%s%s%s\n",
                        "invalid identifier type: ",
                        &FORMT [1], " in source text -> \"...",
                        &STROKA [ DST [I2].DST2 ], "...\"" );
                break;                    /* - exit to general */
                /* diagnostic */
                
            case  3:                          /* if termination code = 3, */
                /* then:                    */
                STROKA [ DST [I2].DST2 + 20 ] = '\x0'; /* - diagnostic message; */
                printf ( "%s%s\n%s%s%s\n",
                        "invalid identifier type: ",
                        &FORMT [IFORMT-1], " in source text -> \"...",
                        &STROKA [ DST [I2].DST2 ], "...\"" );
                break;                    /* -exit to general */
                /* diagnostic */
                
            case  4:                          /* if termination code = 4, */
                /* then:                    */
                STROKA [ DST [I2].DST2 + 20 ] = '\x0'; /* - diagnostic message; */
                printf ( "%s%s\n%s%s%s\n",
                        "undefined identifier: ",
                        &FORMT [IFORMT-1], " in source text -> \"...",
                        &STROKA [ DST [I2].DST2 ], "...\"" );
                break;                    /* - exit to general */
                /* diagnostic */
                
            case  5:                          /* if termination code = 5, */
                /* then:                    */
                STROKA [ DST [I2].DST2 + 20 ] = '\x0'; /* - diagnostic message; */
                printf ( "%s%c\n%s%s%s\n",
                        "invalid operation: ",
                        STROKA [ DST [I2].DST4 - strlen ( FORMT [IFORMT-1] ) ],
                        " in source text -> \"...", &STROKA [ DST [I2].DST2 ], "...\"");
                break;                    /* - exit to general */
                /* diagnostic */
                
            case  6:                          /* if termination code = 6 */
                /* then:                    */
                STROKA [ DST [I2].DST2 + 20 ] = '\x0'; /* - diagnostic message; */
                printf ( "%s%s\n%s%s%s\n",
                        "redeclaration of identifier: ",
                        &FORMT [1], " in source text -> \"...",
                        &STROKA [ DST [I2].DST2 ], "...\"" );
                break;                    /* - exit to general */
                /* diagnostic */
                
        }
        
    }
    
    printf ( "%s\n", "translation aborted" ); /* general diagnostic */
    return 0;
}
/*..........................................................................*/