#define DL_ASSTEXT 16
#define DL_OBJTEXT 50                             /*п╢п╩п╦п╫п╟ п╬п╠'п╣п╨я┌п╫. я┌п╣п╨я│я┌п╟   */
#define NSYM 10                                   /*я─п╟п╥п╪п╣я─ я┌п╟п╠п╩.я│п╦п╪п╡п╬п╩п╬п╡    */
#define NPOP 6                                    /*я─п╟п╥п╪п╣я─ я┌п╟п╠п╩.п©я│п╣п╡п╢п╬п╬п©п╣я─. */
#define NOP  6                                    /*я─п╟п╥п╪п╣я─ я┌п╟п╠п╩.п╬п©п╣я─п╟я├п╦п╧    */
#include <string.h>                               /*п╡п╨п╩.я│я┌я─п╬п╨п╬п╡я▀п╣ п©п╬п╢п©я─п╬пЁя─. */
#include <stdlib.h>                               /*п╡п╨п╩.п©п╬п╢п©я─п╬пЁя─.п©я─п╣п╬п╠я─.п╢п╟п╫п╫*/
#include <stdio.h>                                /*п╡п╨п╩.п©п╬п╢п©я─.я│я┌п╟п╫п╢.п╡п╡/п╡я▀п╡  */
#include <ctype.h>                                /*п╡п╨п╩.п©п╬п╢п©я─.п╨п╩п╟я│я│п╦я└.я│п╦п╪п╡. */

/*
******* п▒ п⌡ п· п   п╬п╠'я▐п╡п╩п╣п╫п╦п╧ я│я┌п╟я┌п╦я┤п╣я│п╨п╦я┘ я─п╟п╠п╬я┤п╦я┘ п©п╣я─п╣п╪п╣п╫п╫я▀я┘
*/

char NFIL [30] = "\x0";

unsigned char PRNMET = 'N';                       /*п╦п╫п╢п╦п╨п╟я┌п╬я─ п╬п╠п╫п╟я─я┐п╤.п╪п╣я┌п╨п╦ */
int I3;                                           /*я│я┤п╣я┌я┤п╦п╨ я├п╦п╨п╩п╟           */

/*
***** п▒ п⌡ п· п   п╬п╠'я▐п╡п╩п╣п╫п╦п╧ п©я─п╬я┌п╬я┌п╦п©п╬п╡ п╬п╠я─п╟я┴п╣п╫п╦п╧ п╨ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪п╟п╪ 1-пЁп╬ п©я─п╬я│п╪п╬я┌я─п╟
*/

						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FDC();                                        /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.DC    */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FDS();                                        /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.DS    */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FEND();                                       /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.END   */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FEQU();                                       /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.EQU   */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FSTART();                                     /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.START */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FUSING();                                     /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.USING */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FRR();                                        /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RR-я└п╬я─п╪. */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int FRX();                                        /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RX-я└п╬я─п╪. */
/*..........................................................................*/

/*
***** п▒ п⌡ п· п   п╬п╠'я▐п╡п╩п╣п╫п╦п╧ п©я─п╬я┌п╬я┌п╦п©п╬п╡ п╬п╠я─п╟я┴п╣п╫п╦п╧ п╨ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪п╟п╪ 2-пЁп╬ п©я─п╬я│п╪п╬я┌я─п╟
*/

						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int SDC();                                        /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.DC    */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int SDS();                                        /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.DS    */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int SEND();                                       /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.END   */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int SEQU();                                       /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.EQU   */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int SSTART();                                     /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.START */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int SUSING();                                     /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.USING */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int SRR();                                        /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RR-я└п╬я─п╪. */
/*..........................................................................*/
						  /*п© я─ п╬ я┌ п╬ я┌ п╦ п©  п╬п╠я─п╟я┴.п╨*/
int SRX();                                        /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RX-я└п╬я─п╪. */
/*..........................................................................*/

/*
******* п▒ п⌡ п· п   п╬п╠'я▐п╡п╩п╣п╫п╦п╧ я┌п╟п╠п╩п╦я├ п╠п╟п╥я▀ п╢п╟п╫п╫я▀я┘ п╨п╬п╪п©п╦п╩я▐я┌п╬я─п╟
*/

/*
******* п·п▒'п╞п▓п⌡п∙п²п≤п∙ я│я┌я─я┐п╨я┌я┐я─я▀ я│я┌я─п╬п╨п╦ (п╨п╟я─я┌я▀) п╦я│я┘п╬п╢п╫п╬пЁп╬ я┌п╣п╨я│я┌п╟
*/

 struct ASSKARTA                                  /*я│я┌я─я┐п╨я┌.п╨п╟я─я┌я▀ п░п║п║п∙п°п▒п⌡п∙п═п░ */
  {
   unsigned  char METKA    [ 8];                  /*п©п╬п╩п╣ п╪п╣я┌п╨п╦              */
   unsigned  char PROBEL1  [ 1];                  /*п©я─п╬п╠п╣п╩-я─п╟п╥п╢п╣п╩п╦я┌п╣п╩я▄      */
   unsigned  char OPERAC   [ 5];                  /*п©п╬п╩п╣ п╬п©п╣я─п╟я├п╦п╦           */
   unsigned  char PROBEL2  [ 1];                  /*п©я─п╬п╠п╣п╩-я─п╟п╥п╢п╣п╩п╦я┌п╣п╩я▄      */
   unsigned  char OPERAND  [12];                  /*п©п╬п╩п╣ п╬п©п╣я─п╟п╫п╢п╟           */
   unsigned  char PROBEL3  [ 1];                  /*п©я─п╬п╠п╣п╩ я─п╟п╥п╢п╣п╩п╦я┌п╣п╩я▄      */
   unsigned  char COMM     [52];                  /*п©п╬п╩п╣ п╨п╬п╪п╪п╣п╫я┌п╟я─п╦я▐        */
  };

/*
******* п²п░п⌡п·п√п∙п²п≤п∙ я│я┌я─я┐п╨я┌я┐я─я▀ п╨п╟я─я┌я▀ п╦я│я┘. я┌п╣п╨я│я┌п╟ п╫п╟ п╡я┘п╬п╢п╫п╬п╧ п╠я┐я└п╣я─
*/

 union                                            /*п╬п©я─п╣п╢п╣п╩п╦я┌я▄ п╬п╠'п╣п╢п╦п╫п╣п╫п╦п╣  */
  {
   unsigned char BUFCARD [80];                    /*п╠я┐я└п╣я─ п╨п╟я─я┌я▀.п╦я│я┘.я┌п╣п╨я│я┌п╟  */
   struct ASSKARTA STRUCT_BUFCARD;                /*п╫п╟п╩п╬п╤п╣п╫п╦п╣ я┬п╟п╠п╩.п╫п╟ п╠я┐я└п╣я─ */
  } TEK_ISX_KARTA;

/*
***** п║п╖п∙п╒п╖п≤п  п╬я┌п╫п╬я│п╦я┌п╣п╩я▄п╫п╬пЁп╬ п╟п╢я─п╣я│п╟ (я│п╪п╣я┴п╣я┬п╦я▐ п╬я┌п╫п╬я│п╦я┌п╣п╩я▄п╫п╬ п╠п╟п╥я▀ )
*/

 int CHADR;                                       /*я│я┤п╣я┌я┤п╦п╨                 */

/*
***** п╒п░п▒п⌡п≤п╕п░ я│п╦п╪п╡п╬п╩п╬п╡
*/

 int ITSYM = -1;                                  /*п╦п╫п╢.я│п╡п╬п╠.я│я┌я─. я┌п╟п╠п╩.я│п╦п╪п╡.*/
 struct TSYM                                      /*я│я┌я─я┐п╨я┌.я│я┌я─п╬п╨п╦ я┌п╟п╠п╩.я│п╦п╪п╡.*/
  {
   unsigned char IMSYM [8];                       /*п╦п╪я▐ я│п╦п╪п╡п╬п╩п╟             */
   int           ZNSYM;                           /*п╥п╫п╟я┤п╣п╫п╦п╣ я│п╦п╪п╡п╬п╩п╟        */
   int           DLSYM;                           /*п╢п╩п╦п╫п╟ я│п╦п╪п╡п╬п╩п╟           */
   char          PRPER;                           /*п©я─п╦п╥п╫п╟п╨ п©п╣я─п╣п╪п╣я┴п╣п╫п╦я▐     */
  };

 struct TSYM T_SYM [NSYM];                        /*п╬п©я─п╣п╢п╣п╩п╣п╫п╦п╣ я┌п╟п╠п╩.я│п╦п╪п╡.  */

/*
***** п╒п░п▒п⌡п≤п╕п░ п╪п╟я┬п╦п╫п╫я▀я┘ п╬п©п╣я─п╟я├п╦п╧
*/

 struct TMOP                                      /*я│я┌я─я┐п╨я┌.я│я┌я─.я┌п╟п╠п╩.п╪п╟я┬.п╬п©п╣я─*/
  {
   unsigned char MNCOP [5];                       /*п╪п╫п╣п╪п╬п╨п╬п╢ п╬п©п╣я─п╟я├п╦п╦       */
   unsigned char CODOP    ;                       /*п╪п╟я┬п╦п╫п╫я▀п╧ п╨п╬п╢ п╬п©п╣я─п╟я├п╦п╦   */
   unsigned char DLOP     ;                       /*п╢п╩п╦п╫п╟ п╬п©п╣я─п╟я├п╦п╦ п╡ п╠п╟п╧я┌п╟я┘ */
   int (*BXPROG)()        ;                       /*я┐п╨п╟п╥п╟я┌п╣п╩я▄ п╫п╟ п©п╬п╢п©я─.п╬п╠я─п╟п╠*/
  } T_MOP [NOP]  =                                /*п╬п╠'я▐п╡п╩п╣п╫п╦п╣ я┌п╟п╠п╩.п╪п╟я┬.п╬п©п╣я─*/
    {
     {{'B','A','L','R',' '} , '\x05' , 2 , FRR} , /*п╦п╫п╦я├п╦п╟п╩п╦п╥п╟я├п╦я▐           */
     {{'B','C','R',' ',' '} , '\x07' , 2 , FRR} , /*я│я┌я─п╬п╨                   */
     {{'S','T',' ',' ',' '} , '\x50' , 4 , FRX} , /*я┌п╟п╠п╩п╦я├я▀                 */
     {{'L',' ',' ',' ',' '} , '\x58' , 4 , FRX} , /*п╪п╟я┬п╦п╫п╫я▀я┘                */
     {{'A',' ',' ',' ',' '} , '\x5A' , 4 , FRX} , /*п╬п©п╣я─п╟я├п╦п╧                */
     {{'S',' ',' ',' ',' '} , '\x5B' , 4 , FRX} , /*                        */
    };

/*
***** п╒п░п▒п⌡п≤п╕п░ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦п╧
*/

 struct TPOP                                      /*я│я┌я─я┐п╨я┌.я│я┌я─.я┌п╟п╠п╩.п©я│.п╬п©eя─.*/
  {
   unsigned char MNCPOP[5];                       /*п╪п╫п╣п╪п╬п╨п╬п╢ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦п╦ */
   int (*BXPROG) ()       ;                       /*я┐п╨п╟п╥п╟я┌п╣п╩я▄ п╫п╟ п©п╬п╢п©я─.п╬п╠я─п╟п╠*/
  } T_POP [NPOP] =                                /*п╬п╠'я▐п╡п╩п╣п╫п╦п╣ я┌п╟п╠п╩.п©я│п╣п╡п╢п╬п╬п©*/
    {
     {{'D','C',' ',' ',' '} , FDC   },            /*п╦п╫п╦я├п╦п╟п╩п╦п╥п╟я├п╦я▐           */
     {{'D','S',' ',' ',' '} , FDS   },            /*я│я┌я─п╬п╨                   */
     {{'E','N','D',' ',' '} , FEND  },            /*я┌п╟п╠п╩п╦я├я▀                 */
     {{'E','Q','U',' ',' '} , FEQU  },            /*п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦п╧          */
     {{'S','T','A','R','T'} , FSTART},            /*                        */
     {{'U','S','I','N','G'} , FUSING}             /*                        */
    };

/*
***** п╒п░п▒п⌡п≤п╕п░ п╠п╟п╥п╬п╡я▀я┘ я─п╣пЁп╦я│я┌я─п╬п╡
*/

 struct TBASR                                     /*я│я┌я─я┐п╨я┌.я│я┌я─.я┌п╟п╠п╩.п╠п╟п╥.я─п╣пЁ.*/
  {
   int SMESH;                                     /*                        */
   char PRDOST;                                   /*                        */
  } T_BASR[15] =                                  /*                        */
    {
     {0x00,'N'},                                  /*п╦п╫п╦я├п╦п╟п╩п╦п╥п╟я├п╦я▐           */
     {0x00,'N'},                                  /*я│я┌я─п╬п╨                   */
     {0x00,'N'},                                  /*я┌п╟п╠п╩п╦я├я▀                 */
     {0x00,'N'},                                  /*п╠п╟п╥п╬п╡я▀я┘                 */
     {0x00,'N'},                                  /*я─п╣пЁп╦я│я┌я─п╬п╡               */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'}                                   /*                        */
    };

/*
***** п▒ п⌡ п· п    п╬п╠'я▐п╡п╩п╣п╫п╦я▐ п╪п╟я│я│п╦п╡п╟ я│ п╬п╠'п╣п╨я┌п╫я▀п╪ я┌п╣п╨я│я┌п╬п╪
*/

  unsigned char OBJTEXT [DL_OBJTEXT][80];         /*п╪п╟я│я│п╦п╡ п╬п╠'п╣п╨я┌п╫я▀я┘ п╨п╟я─я┌   */
  int ITCARD = 0;                                 /*я┐п╨п╟п╥п╟я┌п╣п╩я▄ я┌п╣п╨я┐я┴.п╨п╟я─я┌я▀   */

  struct OPRR                                     /*я│я┌я─я┐п╨я┌.п╠я┐я└.п╬п©п╣я─.я└п╬я─п╪.RR */
   {
    unsigned char OP;                             /*п╨п╬п╢ п╬п©п╣я─п╟я├п╦п╦            */
    unsigned char R1R2;                           /*R1 - п©п╣я─п╡я▀п╧ п╬п©п╣я─п╟п╫п╢     */
						  /*R2 - п╡я┌п╬я─п╬п╧ п╬п©п╣я─п╟п╫п╢     */
   };

  union                                           /*п╬п©я─п╣п╢п╣п╩п╦я┌я▄ п╬п╠'п╣п╢п╦п╫п╣п╫п╦п╣  */
   {
    unsigned char BUF_OP_RR [2];                  /*п╬я─п╣п╢п╣п╩п╦я┌я▄ п╠я┐я└п╣я─         */
    struct OPRR OP_RR;                            /*я│я┌я─я┐п╨я┌я┐я─п╦я─п╬п╡п╟я┌я▄ п╣пЁп╬     */
   } RR;

  struct OPRX                                     /*я│я┌я─я┐п╨я┌.п╠я┐я└.п╬п©п╣я─.я└п╬я─п╪.RX */
   {
    unsigned char OP;                             /*п╨п╬п╢ п╬п©п╣я─п╟я├п╦п╦            */
    unsigned char R1X2;                           /*R1 - п©п╣я─п╡я▀п╧ п╬п©п╣я─п╟п╫п╢     */
    short B2D2;                                     /*X2 - п╡я┌п╬я─п╬п╧ п╬п©п╣я─п╟п╫п╢     */
//    int B2D2;                                     /*X2 - п╡я┌п╬я─п╬п╧ п╬п©п╣я─п╟п╫п╢     */
						  /*B2 - п╠п╟п╥.я─п╣пЁ.2-пЁп╬ п╬п©-п╢п╟ */
						  /*D2 - я│п╪п╣я┴п╣п╫.п╬я┌п╫п╬я│п╦я┌.п╠п╟п╥я▀*/
   };

  union                                           /*п╬п©я─п╣п╢п╣п╩п╦я┌я▄ п╬п╠'п╣п╢п╦п╫п╣п╫п╦п╣  */
   {
    unsigned char BUF_OP_RX [4];                  /*п╬я─п╣п╢п╣п╩п╦я┌я▄ п╠я┐я└п╣я─         */
    struct OPRX OP_RX;                            /*я│я┌я─я┐п╨я┌я┐я─п╦я─п╬п╡п╟я┌я▄ п╣пЁп╬     */
   } RX;

  struct STR_BUF_ESD                              /*я│я┌я─я┐п╨я┌.п╠я┐я└п╣я─п╟ п╨п╟я─я┌я▀ ESD */
   {
    unsigned char POLE1      ;                    /*п╪п╣я│я┌п╬ п╢п╩я▐ п╨п╬п╢п╟ 0x02     */
    unsigned char POLE2  [ 3];                    /*п©п╬п╩п╣ я┌п╦п©п╟ п╬п╠'п╣п╨я┌п╫.п╨п╟я─я┌я▀ */
    unsigned char POLE3  [ 6];                    /*п©я─п╬п╠п╣п╩я▀                 */
    unsigned char POLE31 [ 2];                    /*п╢п╩п╦п╫п╟ п╢п╟п╫п╫я▀я┘ п╫п╟ п╨п╟я─я┌п╣   */
    unsigned char POLE32 [ 2];                    /*п©я─п╬п╠п╣п╩я▀                 */
    unsigned char POLE4  [ 2];                    /*п╡п╫я┐я┌я─.п╦п╢-я─ п╦п╪п╣п╫п╦ п©я─п╬пЁя─. */
    unsigned char IMPR   [ 8];                    /*п╦п╪я▐ п©я─п╬пЁя─п╟п╪п╪я▀           */
    unsigned char POLE6      ;                    /*п╨п╬п╢ я┌п╦п©п╟ ESD-п╦п╪п╣п╫п╦      */
    unsigned char ADPRG  [ 3];                    /*п╬я┌п╫п╬я│п╦я┌.п╟п╢я─п╣я│ п©я─п╬пЁя─п╟п╪п╪я▀ */
    unsigned char POLE8      ;                    /*п©я─п╬п╠п╣п╩я▀                 */
    unsigned char DLPRG  [ 3];                    /*п╢п╩п╦п╫п╟ п©я─п╬пЁя─п╟п╪п╪я▀         */
    unsigned char POLE10 [40];                    /*п©я─п╬п╠п╣п╩я▀                 */
    unsigned char POLE11 [ 8];                    /*п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я├п╦п╬п╫п╫п╬п╣ п©п╬п╩п╣  */
   };

 struct STR_BUF_TXT                               /*я│я┌я─я┐п╨я┌.п╠я┐я└п╣я─п╟ п╨п╟я─я┌я▀ TXT */
   {
    unsigned char POLE1      ;                    /*п╪п╣я│я┌п╬ п╢п╩я▐ п╨п╬п╢п╟ 0x02     */
    unsigned char POLE2  [ 3];                    /*п©п╬п╩п╣ я┌п╦п©п╟ п╬п╠'п╣п╨я┌п╫.п╨п╟я─я┌я▀ */
    unsigned char POLE3      ;                    /*п©я─п╬п╠п╣п╩                  */
    unsigned char ADOP   [ 3];                    /*п╬я┌п╫п╬я│п╦я┌.п╟п╢я─п╣я│ п╬п©я─п╣п╟я├п╦п╦  */
    unsigned char POLE5  [ 2];                    /*п©я─п╬п╠п╣п╩я▀                 */
    unsigned char DLNOP  [ 2];                    /*п╢п╩п╦п╫п╟ п╬п©п╣я─п╟я├п╦п╦          */
    unsigned char POLE7  [ 2];                    /*п©я─п╬п╠п╣п╩я▀                 */
    unsigned char POLE71 [ 2];                    /*п╡п╫я┐я┌я─п╣п╫п╫п╦п╧ п╦п╢п╣п╫я┌.п©я─п╬пЁя─. */
    unsigned char OPER   [56];                    /*я┌п╣п╩п╬ п╬п©п╣я─п╟я├п╦п╦           */
    unsigned char POLE9  [ 8];                    /*п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я├п╦п╬п╫п╫п╬п╣ п©п╬п╩п╣  */
   };

struct STR_BUF_END                                /*я│я┌я─я┐п╨я┌.п╠я┐я└п╣я─п╟ п╨п╟я─я┌я▀ END */
   {
    unsigned char POLE1      ;                    /*п╪п╣я│я┌п╬ п╢п╩я▐ п╨п╬п╢п╟ 0x02     */
    unsigned char POLE2  [ 3];                    /*п©п╬п╩п╣ я┌п╦п©п╟ п╬п╠'п╣п╨я┌п╫.п╨п╟я─я┌я▀ */
    unsigned char POLE3  [68];                    /*п©я─п╬п╠п╣п╩я▀                 */
    unsigned char POLE9  [ 8];                    /*п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я├п╦п╬п╫п╫п╬п╣ п©п╬п╩п╣  */
   };

  union                                           /*п╬п©я─п╣п╢п╣п╩п╦я┌я▄ п╬п╠'п╣п╢п╦п╫п╣п╫п╦п╣  */
   {
    struct STR_BUF_ESD STR_ESD;                   /*я│я┌я─я┐п╨я┌я┐я─п╟ п╠я┐я└п╣я─п╟        */
    unsigned char BUF_ESD [80];                   /*п╠я┐я└п╣я─ п╨п╟я─я┌я▀ ESD         */
   } ESD;


  union                                           /*п╬п©я─п╣п╢п╣п╩п╦я┌я▄ п╬п╠'п╣п╢п╦п╫п╣п╫п╦п╣  */
   {
    struct STR_BUF_TXT STR_TXT;                   /*я│я┌я─я┐п╨я┌я┐я─п╟ п╠я┐я└п╣я─п╟        */
    unsigned char BUF_TXT [80];                   /*п╠я┐я└п╣я─ п╨п╟я─я┌я▀ TXT         */
   } TXT;

  union                                           /*п╬п©я─п╣п╢п╣п╩п╦я┌я▄ п╬п╠'п╣п╢п╦п╫п╣п╫п╦п╣  */
   {
    struct STR_BUF_END STR_END;                   /*я│я┌я─я┐п╨я┌я┐я─п╟ п╠я┐я└п╣я─п╟        */
    unsigned char BUF_END [80];                   /*п╠я┐я└п╣я─ п╨п╟я─я┌я▀ ESD         */
   } END;


/*
******* п▒ п⌡ п· п   п╬п╠'я▐п╡п╩п╣п╫п╦п╧ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪, п╦я│п©п╬п╩я▄п╥я┐п╣п╪я▀я┘ п©я─п╦ 1-п╬п╪ п©я─п╬я│п╪п╬я┌я─п╣
*/

int FDC()                                         /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.DC    */
 {
  if ( PRNMET == 'Y' )                            /*п╣я│п╩п╦ п©я│п╣п╡п╢п╬п╬п©.DC п©п╬п╪п╣я┤.,*/
   {                                              /*я┌п╬:                     */
    if                                            /* п╣я│п╩п╦ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦я▐ DC */
     (                                            /* п╬п©я─п╣п╢п╣п╩я▐п╣я┌ п╨п╬п╫я│я┌п╟п╫я┌я┐   */
      TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0]=='F'/* я┌п╦п©п╟ F, я┌п╬ п╡я▀п©п╬п╩п╫п╦я┌я▄   */
     )                                            /* я│п╩п╣п╢я┐я▌я┴п╣п╣:             */
     {
      T_SYM[ITSYM].DLSYM = 4;                     /*  я┐я│я┌.п╢п╩п╦п╫я┐ я│п╦п╪п╡. =  4, */
      T_SYM[ITSYM].PRPER = 'R';                   /*  п╟,п©я─п╦п╥п╫.п©п╣я─п╣п╪п╣я│я┌.='R' */
      if ( CHADR % 4 )                            /*  п╦, п╣я│п╩п╦ CHADR п╫п╣ я┐п╨п╟п╥.*/
       {                                          /*  п╫п╟ пЁя─п╟п╫п╦я├я┐ я│п╩п╬п╡п╟, я┌п╬: */
	CHADR = (CHADR /4 + 1) * 4;               /*   я┐я│я┌.CHADR п╫п╟ пЁя─.я│п╩. п╦*/
	T_SYM[ITSYM].ZNSYM = CHADR;               /*   п╥п╟п©п╬п╪п╫. п╡ я┌п╟п╠п╩.я│п╦п╪п╡. */
       }
      PRNMET = 'N';                               /*  п╥п╟п╫я┐п╩п╦я┌я▄ PRNMET п╥п╫.'N'*/
     }
    else
     return (1);                                  /* п╦п╫п╟я┤п╣ п╡я▀я┘п╬п╢ п©п╬ п╬я┬п╦п╠п╨п╣  */
   }
  else                                            /*п╣я│п╩п╦ п╤п╣ п©я│п╣п╡п╢п╬п╬п©.п╫п╣п©п╬п╪п╣я┤*/
   if ( CHADR % 4 )                               /*п╦ CHADR п╫п╣ п╨я─п╟я┌п╣п╫ 4,я┌п╬: */
    CHADR = (CHADR /4 + 1) * 4;                   /* я┐я│я┌п╟п╫п╬п╡.CHADR п╫п╟ пЁя─.я│п╩.*/

  CHADR = CHADR + 4;                              /*я┐п╡п╣п╩п╦я┤.CHADR п╫п╟ 4 п╦     */
  return (0);                                     /*я┐я│п©п╣я┬п╫п╬ п╥п╟п╡п╣я─я┬п╦я┌я▄ п©п╬п╢п©я─.*/
 }
/*..........................................................................*/
int FDS()                                         /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.DS    */
 {
  if ( PRNMET == 'Y' )                            /*п╣я│п╩п╦ п©я│п╣п╡п╢п╬п╬п©.DC п©п╬п╪п╣я┤.,*/
   {                                              /*я┌п╬:                     */
    if                                            /* п╣я│п╩п╦ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦я▐ DC */
     (                                            /* п╬п©я─п╣п╢п╣п╩я▐п╣я┌ п╨п╬п╫я│я┌п╟п╫я┌я┐   */
      TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0]=='F'/* я┌п╦п©п╟ F, я┌п╬ п╡я▀п©п╬п╩п╫п╦я┌я▄   */
     )                                            /* я│п╩п╣п╢я┐я▌я┴п╣п╣:             */
     {
      T_SYM[ITSYM].DLSYM = 4;                     /*  я┐я│я┌.п╢п╩п╦п╫я┐ я│п╦п╪п╡. =  4, */
      T_SYM[ITSYM].PRPER = 'R';                   /*  п╟,п©я─п╦п╥п╫.п©п╣я─п╣п╪п╣я│я┌.='R' */
      if ( CHADR % 4 )                            /*  п╦, п╣я│п╩п╦ CHADR п╫п╣ я┐п╨п╟п╥.*/
       {                                          /*  п╫п╟ пЁя─п╟п╫п╦я├я┐ я│п╩п╬п╡п╟, я┌п╬: */
	CHADR = (CHADR /4 + 1) * 4;               /*   я┐я│я┌.CHADR п╫п╟ пЁя─.я│п╩. п╦*/
	T_SYM[ITSYM].ZNSYM = CHADR;               /*   п╥п╟п©п╬п╪п╫. п╡ я┌п╟п╠п╩.я│п╦п╪п╡. */
       }
      PRNMET = 'N';                               /*  п╥п╟п╫я┐п╩п╦я┌я▄ PRNMET п╥п╫.'N'*/
     }
    else
     return (1);                                  /* п╦п╫п╟я┤п╣ п╡я▀я┘п╬п╢ п©п╬ п╬я┬п╦п╠п╨п╣  */
   }
  else                                            /*п╣я│п╩п╦ п╤п╣ п©я│п╣п╡п╢п╬п╬п©.п╫п╣п©п╬п╪п╣я┤*/
   if ( CHADR % 4 )                               /*п╦ CHADR п╫п╣ п╨я─п╟я┌п╣п╫ 4,я┌п╬: */
    CHADR = (CHADR /4 + 1) * 4;                   /* я┐я│я┌п╟п╫п╬п╡.CHADR п╫п╟ пЁя─.я│п╩.*/

  CHADR = CHADR + 4;                              /*я┐п╡п╣п╩п╦я┤.CHADR п╫п╟ 4 п╦     */
  return (0);                                     /*я┐я│п©п╣я┬п╫п╬ п╥п╟п╡п╣я─я┬п╦я┌я▄ п©п╬п╢п©я─.*/
 }
/*..........................................................................*/
int FEND()                                        /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.END   */
 {
  return (100);                                   /*п╡я▀я┘п╬п╢ я│ п©я─п╦п╥п╫.п╨п╬п╫я├п╟ 1-пЁп╬*/
						  /*п©я─п╬я│п╪п╬я┌я─п╟               */
 }
/*..........................................................................*/
int FEQU()                                        /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.EQU   */
 {
  if                                              /*п╣я│п╩п╦ п╡ п╬п©п╣я─п╟п╫п╢п╣         */
   (                                              /*п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦п╦ DC       */
    TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] =='*' /*п╦я│п©п╬п╩я▄п╥п╬п╡п╟п╫ я│п╦п╪п╡. '*',  */
   )                                              /*я┌п╬                      */
    {                                             /* п╥п╟п©п╬п╪п╫п╦я┌я▄ п╡ я┌п╟п╠п╩.я│п╦п╪п╡.:*/
     T_SYM[ITSYM].ZNSYM = CHADR;                  /*  CHADR п╡ п©п╬п╩п╣ ZNSYM,   */
     T_SYM[ITSYM].DLSYM = 1;                      /*  1 п╡ п©п╬п╩п╣ DLSYM,       */
     T_SYM[ITSYM].PRPER = 'R';                    /*  'R' п╡ п©п╬п╬п╩п╣ PRPER     */
    }
  else                                            /*п╦п╫п╟я┤п╣ п╥п╟п©п╬п╪п╫.п╡ я┌п╟п╠п╩.я│п╦п╪п╡*/
    {                                             /* п╥п╫п╟я┤п╣п╫п╦п╣ п╬п©-п╫п╢п╟ п©я│.п╬п©. */
     T_SYM[ITSYM].ZNSYM = atoi (                  /* DC п╡ п©п╬п╩п╣ ZNSYM,       */
      (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND
			       );
     T_SYM[ITSYM].DLSYM = 1;                      /* 1 п╡ п©п╬п╩п╣ DLSYM,        */
     T_SYM[ITSYM].PRPER = 'A';                    /* 'A' п╡ п©п╬п╩п╣ PRPER       */
    }
  PRNMET = 'N';                                   /*п╥п╟п╫я┐п╩.PRNMET п╥п╫п╟я┤п╣п╫.'N' */
  return (0);                                     /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©п╬п╢п©я─.  */
 }
/*..........................................................................*/
int FSTART()                                      /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.START */
 {                                                /*CHADR я┐я│я┌п╟п╫п╬п╡п╦я┌я▄ я─п╟п╡п╫я▀п╪ */
  CHADR =                                         /*п╥п╫п╟я┤п╣п╫п╦я▌ п╬п©п╣я─п╟п╫п╢п╟       */
       atoi(
       (char*)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND/*п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦п╦ START п╦, */
	   );
  if ( CHADR % 8 )                                /*п╣я│п╩п╦ я█я┌п╬ п╥п╫п╟я┤п╣п╫п╦п╣ п╫п╣    */
   {                                              /*п╨я─п╟я┌п╫п╬ 8, я┌п╬ я│п╢п╣п╩п╟я┌я▄ п╣пЁп╬*/
    CHADR = ( CHADR + ( 8 - CHADR % 8 ) );        /*п╨я─п╟я┌п╫я▀п╪                 */
   }                                              /*п╥п╟п©п╬п╪п╫п╦я┌я▄ п╡ я┌п╟п╠п╩.я│п╦п╪п╡.: */
  T_SYM[ITSYM].ZNSYM = CHADR;                     /* CHADR п╡ п©п╬п╩п╣ ZNSYM,    */
  T_SYM[ITSYM].DLSYM = 1;                         /* 1 п╡ п©п╬п╩п╣ DLSYM,        */
  T_SYM[ITSYM].PRPER = 'R';                       /* 'R' п╡ п©п╬п╩п╣ PRPER       */
  PRNMET = 'N';                                   /*п╥п╟п╫я┐п╩.PRNMET п╥п╫п╟я┤п╣п╫.'N' */
  return (0);                                     /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©п╬п╢п©я─п╬пЁя─*/
 }
/*..........................................................................*/
int FUSING()                                      /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.USING */
 {
  return (0);                                     /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©п╬п╢п©я─п╬пЁя─*/
 }
/*..........................................................................*/
int FRR()                                         /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RR-я└п╬я─п╪. */
 {
  CHADR = CHADR + 2;                              /*я┐п╡п╣п╩п╦я┤п╦я┌я▄ я│я┤.п╟п╢я─. п╫п╟ 2  */
  if ( PRNMET == 'Y' )                            /*п╣я│п╩п╦ я─п╟п╫п╣п╣ п╬п╠п╫п╟я─.п╪п╣я┌п╨п╟, */
   {                                              /*я┌п╬ п╡ я┌п╟п╠п╩. я│п╦п╪п╡п╬п╩п╬п╡:    */
    T_SYM[ITSYM].DLSYM = 2;                       /*п╥п╟п©п╬п╪п╫п╦я┌я▄ п╢п╩п╦п╫я┐ п╪п╟я┬.п╬п©п╣я─*/
    T_SYM[ITSYM].PRPER = 'R';                     /*п╦ я┐я│я┌п╟п╫п╬п╡п╦я┌я▄ п©я─п╦п╥п╫.п©п╣я─п╣п╪*/
   }
  return(0);                                      /*п╡я▀п╧я┌п╦ п╦п╥ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪я▀   */
 }
/*..........................................................................*/
int FRX()                                         /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RX-я└п╬я─п╪. */
 {
  CHADR = CHADR + 4;                              /*я┐п╡п╣п╩п╦я┤п╦я┌я▄ я│я┤.п╟п╢я─. п╫п╟ 4  */
  if ( PRNMET == 'Y' )                            /*п╣я│п╩п╦ я─п╟п╫п╣п╣ п╬п╠п╫п╟я─.п╪п╣я┌п╨п╟, */
   {                                              /*я┌п╬ п╡ я┌п╟п╠п╩. я│п╦п╪п╡п╬п╩п╬п╡:    */
    T_SYM[ITSYM].DLSYM = 4;                       /*п╥п╟п©п╬п╪п╫п╦я┌я▄ п╢п╩п╦п╫я┐ п╪п╟я┬.п╬п©п╣я─*/
    T_SYM[ITSYM].PRPER = 'R';                     /*п╦ я┐я│я┌п╟п╫п╬п╡п╦я┌я▄ п©я─п╦п╥п╫.п©п╣я─п╣п╪*/
   }
  return(0);                                      /*п╡я▀п╧я┌п╦ п╦п╥ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪я▀   */
 }
/*..........................................................................*/

/*
******* п▒ п⌡ п· п   п╬п╠'я▐п╡п╩п╣п╫п╦п╧ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪, п╦я│п©п╬п╩я▄п╥я┐п╣п╪я▀я┘ п©я─п╦ 2-п╬п╪ п©я─п╬я│п╪п╬я┌я─п╣
*/

void STXT( int ARG )                              /*п©п╬п╢п©я─.я└п╬я─п╪п╦я─.TXT-п╨п╟я─я┌я▀  */
 {
  char *PTR;                                      /*я─п╟п╠п╬я┤.п©п╣я─п╣п╪п╣п╫п╫п╟я▐-я┐п╨п╟п╥п╟я┌.*/

  PTR = (char *)&CHADR;                           /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ п©п╬п╩я▐ ADOP  */
  TXT.STR_TXT.ADOP[2]  = *PTR;                    /*TXT-п╨п╟я─я┌я▀ п╡ я└п╬я─п╪п╟я┌п╣     */
  TXT.STR_TXT.ADOP[1]  = *(PTR+1);                /*п╢п╡п╬п╦я┤п╫п╬пЁп╬ я├п╣п╩п╬пЁп╬        */
  TXT.STR_TXT.ADOP[0]  = '\x00';                  /*п╡ я│п╬пЁп╩п╟я┬п╣п╫п╦я▐я┘ п∙п║ п╜п▓п°    */

  if ( ARG == 2 )                                 /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ п©п╬п╩я▐ OPER  */
   {
    memset ( TXT.STR_TXT.OPER , 64 , 4 );
    memcpy ( TXT.STR_TXT.OPER,RR.BUF_OP_RR , 2 ); /* п╢п╩я▐ RR-я└п╬я─п╪п╟я┌п╟         */
    TXT.STR_TXT.DLNOP [1] = 2;
   }
  else
   {
    memcpy ( TXT.STR_TXT.OPER , RX.BUF_OP_RX , 4);/* п╢п╩я▐ RX-я└п╬я─п╪п╟я┌п╟         */
    TXT.STR_TXT.DLNOP [1] = 4;
   }
  memcpy (TXT.STR_TXT.POLE9,ESD.STR_ESD.POLE11,8);/*я└п╬я─п╪п╦я─п╬п╡.п╦п╢п╣п╫я┌п╦я└п╦п╨.п©п╬п╩я▐ */

  memcpy ( OBJTEXT[ITCARD] , TXT.BUF_TXT , 80 );  /*п╥п╟п©п╦я│я▄ п╬п╠'п╣п╨я┌п╫п╬п╧ п╨п╟я─я┌я▀  */
  ITCARD += 1;                                    /*п╨п╬я─я─п╣п╨я├.п╦п╫п╢-я│п╟ я│п╡п╬п╠.п╨-я┌я▀*/
  CHADR = CHADR + ARG;                            /*п╨п╬я─я─п╣п╨я├.я│я┤п╣я┌я┤п╦п╨п╟ п╟п╢я─п╣я│п╟ */
  return;
 }

int SDC()                                         /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.DC    */
 {
  char *RAB;                                      /*я─п╟п╠п╬я┤п╟я▐ п©п╣я─п╣п╪п╣п╫п╫п╟я▐      */

  RX.OP_RX.OP   = 0;                              /*п╥п╟п╫я┐п╩п╦п╪ п╢п╡п╟ я│я┌п╟я─я┬п╦я┘     */
  RX.OP_RX.R1X2 = 0;                              /*п╠п╟п╧я┌п╟ RX.OP_RX          */
  if
    (                                             /* п╣я│п╩п╦ п╬п©п╣я─п╟п╫п╢ п╫п╟я┤п╦п╫п╟п╣я┌я│я▐*/
     !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND,/* я│ п╨п╬п╪п╠п╦п╫п╟я├п╦п╦           */
	      "F'", 2)                            /* F',                    */
    )                                             /* я┌п╬                     */
   {
    RAB=strtok                                    /*п╡ п©п╣я─п╣п╪. c я┐п╨п╟п╥п╟я┌.RAB   */
	 (                                        /*п╡я▀п╠п╦я─п╟п╣п╪ п©п╣я─п╡я┐я▌ п╩п╣п╨я│п╣п╪я┐ */
    (char*)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND+2,/*п╬п©п╣я─п╟п╫п╢п╟ я┌п╣п╨я┐я┴п╣п╧ п╨п╟я─я┌я▀  */
	  "'"                                     /*п╦я│я┘.я┌п╣п╨я│я┌п╟ п░п║п║п∙п°п▒п⌡п∙п═п░   */
	 );

    RX.OP_RX.B2D2 = atoi ( RAB );                 /*п©п╣я─п╣п╡п╬п╢ ASCII-> int     */
    RAB = (char *) &RX.OP_RX.B2D2;                /*п©я─п╦п╡п╣п╢п╣п╫п╦п╣ п╨ я│п╬пЁп╩п╟я┬п╣п╫п╦я▐п╪*/
    swab ( RAB , RAB , 2 );                       /* п∙п║ п╜п▓п°                 */
   }
  else                                            /*п╦п╫п╟я┤п╣                   */
   return (1);                                    /*я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬п╦п╠п╨п╣     */

  STXT (4);                                       /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ TXT-п╨п╟я─я┌я▀  */


  return (0);                                     /*я┐я│п©п╣я┬п╫.п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ п©п╬п╢п©я─.*/
 }
/*..........................................................................*/
int SDS()                                         /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.DS    */
 {

  RX.OP_RX.OP   = 0;                              /*п╥п╟п╫я┐п╩п╦п╪ п╢п╡п╟ я│я┌п╟я─я┬п╦я┘     */
  RX.OP_RX.R1X2 = 0;                              /*п╠п╟п╧я┌п╟ RX.OP_RX          */
  if
    (                                             /* п╣я│п╩п╦ п╬п©п╣я─п╟п╫п╢ п╫п╟я┤п╦п╫п╟п╣я┌я│я▐*/
     TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0]=='F' /* я│ п╨п╬п╪п╠п╦п╫п╟я├п╦п╦ F'        */
    )                                             /* я┌п╬:                    */
   RX.OP_RX.B2D2 = 0;                             /*п╥п╟п╫я┐п╩п╦п╪ RX.OP_RX.B2D2   */
  else                                            /*п╦п╫п╟я┤п╣                   */
   return (1);                                    /*я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬п╦п╠п╨п╣     */

  STXT (4);                                       /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ TXT-п╨п╟я─я┌я▀  */

  return (0);                                     /*я┐я│п©п╣я┬п╫п╬ п╥п╟п╡п╣я─я┬п╦я┌я▄ п©п╬п╢п©я─.*/
 }
/*..........................................................................*/
int SEND()                                        /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.END   */
 {
						  /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣            */
  memcpy (                                        /*п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я├п╦п╬п╫п╫пЁп╬ п©п╬п╩я▐  */
	  END.STR_END.POLE9 ,                     /* END - п╨п╟я─я┌я▀            */
	  ESD.STR_ESD.POLE11,                     /*                        */
	  8                                       /*                        */
	 );                                       /*                        */
  memcpy (                                        /*п╥п╟п©п╦я│я▄ п╬п╠'п╣п╨я┌п╫п╬п╧ п╨п╟я─я┌я▀  */
	  OBJTEXT[ITCARD],                        /* п╡                      */
	  END.BUF_END,                            /* п╪п╟я│я│п╦п╡                 */
	  80                                      /* п╬п╠'п╣п╨я┌п╫я▀я┘              */
	 );                                       /* п╨п╟я─я┌                   */
  ITCARD += 1;                                    /*п╨п╬я─я─п╣п╨я├.п╦п╫п╢-я│п╟ я│п╡п╬п╠.п╨-я┌я▀*/
  return (100);                                   /*п╡я▀я┘п╬п╢ я│ п©я─п╦п╥п╫.п╨п╬п╫я├п╟ 2-пЁп╬*/
						  /*п©я─п╬я│п╪п╬я┌я─п╟               */
 }
/*..........................................................................*/
int SEQU()                                        /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.EQU   */
 {
  return (0);                                     /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©п╬п╢п©я─.  */
 }
/*..........................................................................*/
int SSTART()                                      /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.START */
 {
  char *PTR;                                      /*п╫п╟п╠п╬я─                   */
  char *METKA;                                    /*я─п╟п╠п╬я┤п╦я┘                 */
  char *METKA1;                                   /*п©п╣я─п╣п╪п╣п╫п╫я▀я┘              */
  int J;                                          /*п©п╬п╢п©я─п╬пЁя─п╟п╪п╪я▀            */
  int RAB;                                        /*                        */

  METKA1 = strtok                                 /*п╡ п©п╣я─п╣п╪. c я┐п╨п╟п╥п╟я┌.METKA1*/
	   (                                      /*п╡я▀п╠п╦я─п╟п╣п╪ п©п╣я─п╡я┐я▌ п╩п╣п╨я│п╣п╪я┐ */
    (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.METKA,   /*п╬п©п╣я─п╟п╫п╢п╟ я┌п╣п╨я┐я┴п╣п╧ п╨п╟я─я┌я▀  */
	    " "                                   /*п╦я│я┘.я┌п╣п╨я│я┌п╟ п░п║п║п∙п°п▒п⌡п∙п═п░   */
	   );
  for ( J=0; J<=ITSYM; J++ )                      /* п╡я│п╣ п╪п╣я┌п╨п╦ п╦я│я┘.я┌п╣п╨я│я┌п╟ п╡ */
   {                                              /* я┌п╟п╠п╩. T_SYM я│я─п╟п╡п╫п╦п╡п╟п╣п╪ */
						  /* я│п╬ п╥п╫п╟я┤.п©п╣я─п╣п╪. *METKA1 */
    METKA = strtok (
		    (char*) T_SYM[J].IMSYM , " "
		   );
    if( !strcmp ( METKA , METKA1 ) )              /* п╦ п©я─п╦ я│п╬п╡п©п╟п╢п╣п╫п╦п╦:      */
     {                                            /*  п╠п╣я─п╣п╪ я─п╟п╥п╫п╬я│я┌я▄ я│я┤.п╟п╢я─.*/
      RAB = CHADR - T_SYM[J].ZNSYM;               /*  п╥п╫п╟я┤.я█я┌п╬п╧ п╪п╣я┌п╨п╦, п╬п╠я─п╟-*/
      PTR = (char *)&RAB;                         /*  п╥я┐я▐ п╢п╩п╦п╫я┐ п©я─п╬пЁя─п╟п╪п╪я▀ п╡ */
      swab ( PTR , PTR , 2 );                     /*  я│п╬пЁп╩п╟я┬п╣п╫п╦я▐я┘ п∙п║ п╜п▒п°, п╦ */
      ESD.STR_ESD.DLPRG [0] = 0;                  /*  п╥п╟п©п╦я│я▀п╡.п╣п╣ п╡ ESD-п╨п╟я─я┌я┐*/
      ESD.STR_ESD.DLPRG [1] = *PTR;               /*  п©п╬п╠п╟п╧я┌п╫п╬              */
      ESD.STR_ESD.DLPRG [2] = *(PTR + 1);         /*                        */
      CHADR = T_SYM[J].ZNSYM;                     /*я┐я│я┌п╟п╫п╟п╡п╩.CHADR, я─п╟п╡п╫я▀п╪  */
						  /*п╬п©п╣я─п╟п╫п╢я┐ п╬п©п╣я─п╟я┌.START   */
						  /*п╦я│я┘п╬п╢п╫п╬пЁп╬ я┌п╣п╨я│я┌п╟        */
      PTR = (char *)&CHADR;                       /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ п©п╬п╩я▐ ADPRG */
      ESD.STR_ESD.ADPRG[2]  = *PTR;               /*ESD-п╨п╟я─я┌я▀ п╡ я└п╬я─п╪п╟я┌п╣     */
      ESD.STR_ESD.ADPRG[1]  = *(PTR+1);           /*п╢п╡п╬п╦я┤п╫п╬пЁп╬ я├п╣п╩п╬пЁп╬        */
      ESD.STR_ESD.ADPRG[0]  = '\x00';             /*п╡ я│п╬пЁп╩п╟я┬п╣п╫п╦я▐я┘ п∙п║ п╜п▓п°    */
      memcpy (                                    /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣            */
	       ESD.STR_ESD.IMPR ,                 /* п╦п╪п╣п╫п╦ п©я─п╬пЁя─п╟п╪п╪я▀        */
	       METKA ,                            /*  п╦                     */
	       strlen ( METKA )                   /*                        */
	     );                                   /*                        */
      memcpy (                                    /*п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я├п╦п╬п╫п╫пЁп╬ п©п╬п╩я▐  */
	       ESD.STR_ESD.POLE11 ,               /* ESD - п╨п╟я─я┌я▀            */
	       METKA ,                            /*                        */
	       strlen ( METKA )                   /*                        */
	     );                                   /*                        */
      memcpy (                                    /*п╥п╟п©п╦я│я▄ п╬п╠'п╣п╨я┌п╫п╬п╧ п╨п╟я─я┌я▀  */
	       OBJTEXT[ITCARD] ,                  /* п╡                      */
	       ESD.BUF_ESD ,                      /* п╪п╟я│я│п╦п╡                 */
	       80                                 /* п╬п╠'п╣п╨я┌п╫я▀я┘              */
	     );                                   /* п╨п╟я─я┌                   */
      ITCARD += 1;                                /*п╨п╬я─я─п╣п╨я├.п╦п╫п╢-я│п╟ я│п╡п╬п╠.п╨-я┌я▀*/
      return (0);                                 /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©п╬п╢п©я─п╬пЁя─*/
     }
   }
  return (2);                                     /*п╬я┬п╦п╠п╬я┤п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©я─п╬пЁя─. */
 }
/*..........................................................................*/
int SUSING()                                      /*п©п╬п╢п©я─.п╬п╠я─.п©я│.п╬п©п╣я─.USING */
 {
						  /*п╫п╟п╠п╬я─                   */
  char *METKA;                                    /*я─п╟п╠п╬я┤п╦я┘                 */
  char *METKA1;                                   /*п©п╣я─п╣п╪п╣п╫п╫я▀я┘              */
  char *METKA2;                                   /*                        */
  int J;                                          /*                        */
  int NBASRG;                                     /*                        */
  METKA1 = strtok                                 /*п╡ п©п╣я─п╣п╪. c я┐п╨п╟п╥п╟я┌.METKA1*/
	   (                                      /*п╡я▀п╠п╦я─п╟п╣п╪ п©п╣я─п╡я┐я▌ п╩п╣п╨я│п╣п╪я┐ */
    (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*п╬п©п╣я─п╟п╫п╢п╟ я┌п╣п╨я┐я┴п╣п╧ п╨п╟я─я┌я▀  */
	    ","                                   /*п╦я│я┘.я┌п╣п╨я│я┌п╟ п░п║п║п∙п°п▒п⌡п∙п═п░   */
	   );
  METKA2 = strtok                                 /*п╡ п©п╣я─п╣п╪. c я┐п╨п╟п╥п╟я┌.METKA2*/
	   (                                      /*п╡я▀п╠п╦я─п╟п╣п╪ п╡я┌п╬я─я┐я▌ п╩п╣п╨я│п╣п╪я┐ */
	    NULL,                                 /*п╬п©п╣я─п╟п╫п╢п╟ я┌п╣п╨я┐я┴п╣п╧ п╨п╟я─я┌я▀  */
	    " "                                   /*п╦я│я┘.я┌п╣п╨я│я┌п╟ п░п║п║п∙п°п▒п⌡п∙п═п░   */
	   );
  if ( isalpha ( (int) *METKA2 ) )                /*п╣я│п╩п╦ п╩п╣п╨я│п╣п╪п╟ п╫п╟я┤п╦п╫п╟п╣я┌я│я▐ */
   {                                              /*я│ п╠я┐п╨п╡я▀, я┌п╬:            */

    for ( J=0; J<=ITSYM; J++ )                    /* п╡я│п╣ п╪п╣я┌п╨п╦ п╦я│я┘.я┌п╣п╨я│я┌п╟ п╡ */
     {                                            /* я┌п╟п╠п╩. T_SYM я│я─п╟п╡п╫п╦п╡п╟п╣п╪ */
						  /* я│п╬ п╥п╫п╟я┤.п©п╣я─п╣п╪. *METKA2 */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA2 ) )            /* п╦ п©я─п╦ я│п╬п╡п©п╟п╢п╣п╫п╦п╦:      */
       {                                          /*  п╥п╟п©п╬п╪п╦п╫п╟п╣п╪ п╥п╫п╟я┤п╣п╫п╦п╣   */
	 if ( (NBASRG = T_SYM[J].ZNSYM) <= 0x0f ) /*  п╪п╣я┌п╨п╦ п╡ NBASRG п╦ п╡ я│п╩.*/
	  goto SUSING1;                           /*  NBASRG <= 0x0f п╦п╢п╣п╪ п╫п╟*/
						  /*  я┐я│я┌п╟п╫.я─п╣пЁп╦я│я┌я─п╟ п╠п╟п╥я▀   */
	 else                                     /* п╦п╫п╟я┤п╣:                 */
	  return (6);                             /*  я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬п╦п╠п╨п╣   */

       }
     }
    return (2);                                   /*п╥п╟п╡п╣я─я┬.п©п╬п╢п©я─.п©п╬ п╬я┬п╦п╠п╨п╣  */
   }
  else                                            /*п╦п╫п╟я┤п╣, п╣я│п╩п╦ п╡я┌п╬я─п╬п╧ п╬п©п╣я─.*/
   {                                              /*п╫п╟я┤п╦п╫п╟п╣я┌я│я▐ я│ я├п╦я└я─я▀, я┌п╬: */
    NBASRG = atoi ( METKA2 );                     /* п╥п╟п©п╬п╪п╫п╦п╪ п╣пЁп╬ п╡ NBASRG  */
    if ( (NBASRG = T_SYM[J].ZNSYM) <= 0x0f )      /* п╦,п╣я│п╩п╦ п╬п╫ <= 0x0f,я┌п╬:  */
     goto SUSING1;                                /* п╦п╢п╣п╪ п╫п╟ я┐я│я┌п╟п╫.я─п╣пЁ.п╠п╟п╥я▀ */
    else                                          /*п╦п╫п╟я┤п╣:                  */
     return (6);                                  /* я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬п╦п╠п╨п╣    */
   }

 SUSING1:                                         /*я┐я│я┌п╟п╫п╬п╡п╦я┌я▄ п╠п╟п╥п╬п╡я▀п╧ я─п╣пЁ. */

  T_BASR [NBASRG - 1].PRDOST = 'Y';               /* п╡п╥п╡п╣я│я┌п╦ п©я─п╦п╥п╫.п╟п╨я┌п╦п╡п╫.  */
  if ( *METKA1 == '*' )                           /* п╣я│п╩п╦ п©п╣я─п╡.п╬п©-п╫п╢ == '*',*/
   {
    T_BASR[NBASRG-1].SMESH = CHADR;               /* п╡я▀п╠п╦я─.п╥п╫п╟я┤.п╠п╟п╥я▀ ==CHADR*/
   }
  else                                            /*п╦п╫п╟я┤п╣:                  */
   {
    for ( J=0; J<=ITSYM; J++ )                    /* п╡я│п╣ п╪п╣я┌п╨п╦ п╦я│я┘.я┌п╣п╨я│я┌п╟ п╡ */
     {                                            /* я┌п╟п╠п╩. T_SYM я│я─п╟п╡п╫п╦п╡п╟п╣п╪ */
						  /* я│п╬ п╥п╫п╟я┤.п©п╣я─п╣п╪. *METKA1 */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA1 ) )            /* п╦ п©я─п╦ я│п╬п╡п©п╟п╢п╣п╫п╦п╦:      */
       {                                          /*  п╠п╣я─п╣п╪ п╥п╫п╟я┤п╣п╫п╦п╣ я█я┌п╬п╧   */
	T_BASR[NBASRG-1].SMESH = T_SYM[J].ZNSYM;  /*  я█я┌п╬п╧ п╪п╣я┌п╨п╦ п╨п╟п╨ п╠п╟п╥я┐   */
       }
     }
    return (2);                                   /*п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ п©я─п╬пЁя─.п©п╬ п╬я┬п╦п╠*/
   }
  return (0);                                     /*я┐я│п©п╣я┬п╫п╬п╣ п╥п╟п╡п╣я─я┬.п©п╬п╢п©я─п╬пЁя─*/
 }
/*..........................................................................*/
int SRR()                                         /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RR-я└п╬я─п╪. */
 {
  char *METKA;                                    /*п╫п╟п╠п╬я─                   */
  char *METKA1;                                   /*я─п╟п╠п╬я┤п╦я┘                 */
  char *METKA2;                                   /*п©п╣я─п╣п╪п╣п╫п╫я▀я┘              */
  unsigned char R1R2;                             /*                        */
  int J;                                          /*                        */
  RR.OP_RR.OP = T_MOP[I3].CODOP;                  /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ п╨п╬п╢п╟ п╬п©п╣я─п╟я├*/

  METKA1 = strtok                                 /*п╡ п©п╣я─п╣п╪. c я┐п╨п╟п╥п╟я┌.METKA1*/
	   (                                      /*п╡я▀п╠п╦я─п╟п╣п╪ п©п╣я─п╡я┐я▌ п╩п╣п╨я│п╣п╪я┐ */
    (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*п╬п©п╣я─п╟п╫п╢п╟ я┌п╣п╨я┐я┴п╣п╧ п╨п╟я─я┌я▀  */
	    ","                                   /*п╦я│я┘.я┌п╣п╨я│я┌п╟ п░п║п║п∙п°п▒п⌡п∙п═п░   */
	   );

  METKA2 = strtok                                 /*п╡ п©п╣я─п╣п╪. c я┐п╨п╟п╥п╟я┌.METKA2*/
	   (                                      /*п╡я▀п╠п╦я─п╟п╣п╪ п╡я┌п╬я─я┐я▌ п╩п╣п╨я│п╣п╪я┐ */
	    NULL,                                 /*п╬п©п╣я─п╟п╫п╢п╟ я┌п╣п╨я┐я┴п╣п╧ п╨п╟я─я┌я▀  */
	    " "                                   /*п╦я│я┘.я┌п╣п╨я│я┌п╟ п░п║п║п∙п°п▒п⌡п∙п═п░   */
	   );

  if ( isalpha ( (int) *METKA1 ) )                /*п╣я│п╩п╦ п╩п╣п╨я│п╣п╪п╟ п╫п╟я┤п╦п╫п╟п╣я┌я│я▐ */
   {                                              /*я│ п╠я┐п╨п╡я▀, я┌п╬:            */
    for ( J=0; J<=ITSYM; J++ )                    /* п╡я│п╣ п╪п╣я┌п╨п╦ п╦я│я┘.я┌п╣п╨я│я┌п╟ п╡ */
     {                                            /* я┌п╟п╠п╩. T_SYM я│я─п╟п╡п╫п╦п╡п╟п╣п╪ */
						  /* я│п╬ п╥п╫п╟я┤.п©п╣я─п╣п╪. *METKA1 */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA1 ) )            /* п╦ п©я─п╦ я│п╬п╡п©п╟п╢п╣п╫п╦п╦:      */
       {                                          /*  п╠п╣я─п╣п╪ п╥п╫п╟я┤п╣п╫п╦п╣ я█я┌п╬п╧   */
	 R1R2 = T_SYM[J].ZNSYM << 4;              /*  п╪п╣я┌п╨п╦ п╡ п╨п╟я┤п╣я│я┌п╡п╣ п©п╣я─п╡.*/
	 goto SRR1;
       }                                          /*  п╬п©я─п╣я─п╟п╫п╢п╟ п╪п╟я┬п╦п╫п╫п╬п╧ п╨п╬п╪*/
     }
    return(2);                                    /*я│п╬п╬п╠я┴."п╫п╣п╬п╠'я▐п╡п╩.п╦п╢п╣п╫я┌п╦я└"*/
   }
  else                                            /*п╦п╫п╟я┤п╣, п╠п╣я─п╣п╪ п╡ п╨п╟я┤п╣я│я┌п╡п╣ */
   {                                              /*п©п╣я─п╡.п╬п©п╣я─п╟п╫п╢п╟ п╪п╟я┬п╦п╫п╫.п╨п╬п╪*/
     R1R2 = atoi ( METKA1 ) << 4;                 /*п╥п╫п╟я┤п╣п╫.п╡я▀п╠я─.   п╩п╣п╨я│п╣п╪я▀  */
   }


 SRR1:


  if ( isalpha ( (int) *METKA2 ) )                /*п╣я│п╩п╦ п╩п╣п╨я│п╣п╪п╟ п╫п╟я┤п╦п╫п╟п╣я┌я│я▐ */
   {                                              /*я│ п╠я┐п╨п╡я▀, я┌п╬:            */
    for ( J=0; J<=ITSYM; J++ )                    /* п╡я│п╣ п╪п╣я┌п╨п╦ п╦я│я┘.я┌п╣п╨я│я┌п╟ п╡ */
     {                                            /* я┌п╟п╠п╩. T_SYM я│я─п╟п╡п╫п╦п╡п╟п╣п╪ */
						  /* я│п╬ п╥п╫п╟я┤.п©п╣я─п╣п╪. *п°п∙п╒п п░2 */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA2 ) )            /* п╦ п©я─п╦ я│п╬п╡п©п╟п╢п╣п╫п╦п╦:      */
       {                                          /*  п╠п╣я─п╣п╪ п╥п╫п╟я┤п╣п╫п╦п╣ я█я┌п╬п╧   */
	 R1R2 = R1R2 + T_SYM[J].ZNSYM;            /*  п╪п╣я┌п╨п╦ п╡ п╨п╟я┤п╣я│я┌п╡п╣ п╡я┌п╬я─.*/
	 goto SRR2;                               /*                        */
       }                                          /*  п╬п©я─п╣я─п╟п╫п╢п╟ п╪п╟я┬п╦п╫п╫п╬п╧ п╨п╬п╪*/
     }                                            /*                        */
    return(2);                                    /*я│п╬п╬п╠я┴."п╫п╣п╬п╠'я▐п╡п╩.п╦п╢п╣п╫я┌п╦я└"*/
   }
  else                                            /*п╦п╫п╟я┤п╣, п╠п╣я─п╣п╪ п╡ п╨п╟я┤п╣я│я┌п╡п╣ */
   {                                              /*п╡я┌п╬я─.п╬п©п╣я─п╟п╫п╢п╟ п╪п╟я┬п╦п╫п╫.п╨п╬п╪*/
     R1R2 = R1R2 + atoi ( METKA2 );               /*п╥п╫п╟я┤п╣п╫.п╡я▀п╠я─.   п╩п╣п╨я│п╣п╪я▀  */
   }

 SRR2:

  RR.OP_RR.R1R2 = R1R2;                           /*я└п╬я─п╪п╦я─я┐п╣п╪ п╬п©п╣я─-п╢я▀ п╪п╟я┬-п╬п╧*/
						  /*п╨п╬п╪п╟п╫п╢я▀                 */

  STXT(2);
  return(0);                                      /*п╡я▀п╧я┌п╦ п╦п╥ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪я▀   */
 }

/*..........................................................................*/
int SRX()                                         /*п©п╬п╢п©я─.п╬п╠я─.п╬п©п╣я─.RX-я└п╬я─п╪. */
 {
  char *METKA;                                    /*п╫п╟п╠п╬я─                   */
  char *METKA1;                                   /*я─п╟п╠п╬я┤п╦я┘                 */
  char *METKA2;                                   /*п©п╣я─п╣п╪п╣п╫п╫я▀я┘              */
  char *PTR;                                      /*                        */
  int  DELTA;                                     /*                        */
  int  ZNSYM;                                     /*                        */
  int  NBASRG;                                    /*                        */
  int J;                                          /*                        */
  int I;                                          /*                        */
  unsigned char R1X2;                             /*                        */
  int B2D2;                                       /*                        */
  RX.OP_RX.OP = T_MOP[I3].CODOP;                  /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ п╨п╬п╢п╟ п╬п©п╣я─п╟я├*/
  METKA1 = strtok                                 /*п╡ п©п╣я─п╣п╪. c я┐п╨п╟п╥п╟я┌.METKA1*/
	   (                                      /*п╡я▀п╠п╦я─п╟п╣п╪ п©п╣я─п╡я┐я▌ п╩п╣п╨я│п╣п╪я┐ */
    (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*п╬п©п╣я─п╟п╫п╢п╟ я┌п╣п╨я┐я┴п╣п╧ п╨п╟я─я┌я▀  */
	    ","                                   /*п╦я│я┘.я┌п╣п╨я│я┌п╟ п░п║п║п∙п°п▒п⌡п∙п═п░   */
	   );

  METKA2 = strtok                                 /*п╡ п©п╣я─п╣п╪. c я┐п╨п╟п╥п╟я┌.METKA2*/
	   (                                      /*п╡я▀п╠п╦я─п╟п╣п╪ п╡я┌п╬я─я┐я▌ п╩п╣п╨я│п╣п╪я┐ */
	    NULL,                                 /*п╬п©п╣я─п╟п╫п╢п╟ я┌п╣п╨я┐я┴п╣п╧ п╨п╟я─я┌я▀  */
	    " "                                   /*п╦я│я┘.я┌п╣п╨я│я┌п╟ п░п║п║п∙п°п▒п⌡п∙п═п░   */
	   );

  if ( isalpha ( (int) *METKA1 ) )                /*п╣я│п╩п╦ п╩п╣п╨я│п╣п╪п╟ п╫п╟я┤п╦п╫п╟п╣я┌я│я▐ */
   {                                              /*я│ п╠я┐п╨п╡я▀, я┌п╬:            */
    for ( J=0; J<=ITSYM; J++ )                    /* п╡я│п╣ п╪п╣я┌п╨п╦ п╦я│я┘.я┌п╣п╨я│я┌п╟ п╡ */
     {                                            /* я┌п╟п╠п╩. T_SYM я│я─п╟п╡п╫п╦п╡п╟п╣п╪ */
						  /* я│п╬ п╥п╫п╟я┤.п©п╣я─п╣п╪. *METKA  */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA1 ) )            /* п╦ п©я─п╦ я│п╬п╡п©п╟п╢п╣п╫п╦п╦:      */

       {                                          /*  п╠п╣я─п╣п╪ п╥п╫п╟я┤п╣п╫п╦п╣ я█я┌п╬п╧   */
	 R1X2 = T_SYM[J].ZNSYM << 4;              /*  п╪п╣я┌п╨п╦ п╡ п╨п╟я┤п╣я│я┌п╡п╣ п©п╣я─п╡.*/
	 goto SRX1;
       }                                          /*  п╬п©я─п╣я─п╟п╫п╢п╟ п╪п╟я┬п╦п╫п╫п╬п╧ п╨п╬п╪*/
     }
    return(2);                                    /*я│п╬п╬п╠я┴."п╫п╣п╬п╠'я▐п╡п╩.п╦п╢п╣п╫я┌п╦я└"*/
   }
  else                                            /*п╦п╫п╟я┤п╣, п╠п╣я─п╣п╪ п╡ п╨п╟я┤п╣я│я┌п╡п╣ */
   {                                              /*п©п╣я─п╡.п╬п©п╣я─п╟п╫п╢п╟ п╪п╟я┬п╦п╫п╫.п╨п╬п╪*/
     R1X2 = atoi ( METKA1 ) << 4;                 /*п╥п╫п╟я┤п╣п╫.п╡я▀п╠я─.   п╩п╣п╨я│п╣п╪я▀  */
   }


 SRX1:


  if ( isalpha ( (int) *METKA2 ) )                /*п╣я│п╩п╦ п╩п╣п╨я│п╣п╪п╟ п╫п╟я┤п╦п╫п╟п╣я┌я│я▐ */
   {                                              /*я│ п╠я┐п╨п╡я▀, я┌п╬:            */
    for ( J=0; J<=ITSYM; J++ )                    /* п╡я│п╣ п╪п╣я┌п╨п╦ п╦я│я┘.я┌п╣п╨я│я┌п╟ п╡ */
     {                                            /* я┌п╟п╠п╩. T_SYM я│я─п╟п╡п╫п╦п╡п╟п╣п╪ */
						  /* я│п╬ п╥п╫п╟я┤.п©п╣я─п╣п╪. *п°п∙п╒п п░  */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA2 ) )            /* п╦ п©я─п╦ я│п╬п╡п©п╟п╢п╣п╫п╦п╦:      */
       {                                          /*  я┐я│я┌п╟п╫п╬п╡п╦я┌я▄ п╫п╟я┤.п╥п╫п╟я┤.: */
	NBASRG = 0;                               /*   п╫п╬п╪п╣я─п╟ п╠п╟п╥п╬п╡.я─п╣пЁп╦я│я┌я─п╟*/
	DELTA  = 0xfff - 1;                       /*   п╦ п╣пЁп╬ п╥п╫п╟я┤п╣п╫.,п╟ я┌п╟п╨п╤п╣*/
	ZNSYM  = T_SYM[J].ZNSYM;                  /*   я│п╪п╣я┴п╣п╫.п╡я┌п╬я─.п╬п©п╣я─п╟п╫п╢п╟ */
	for ( I=0; I<15; I++ )                    /*п╢п╟п╩п╣п╣ п╡ я├п╦п╨п╩п╣ п╦п╥ п╡я│п╣я┘   */
	 {                                        /*я─п╣пЁ-я─п╬п╡ п╡я▀п╠п╣я─п╣п╪ п╠п╟п╥п╬п╡я▀п╪ */
	  if (                                    /*я┌п╬я┌, п╨п╬я┌п╬я─я▀п╧ п╦п╪п╣п╣я┌:     */
	       T_BASR[I].PRDOST == 'Y'            /* п©я─п╦п╥п╫.п╟п╨я┌п╦п╡п╫п╬я│я┌п╦,      */
	      &&                                  /*  п╦                     */
	       ZNSYM - T_BASR[I].SMESH >= 0       /* п╥п╫п╟я┤п╣п╫п╣п╫п╦п╣, п╪п╣п╫я▄я┬п╣п╣ п©п╬ */
	      &&                                  /* п╡п╣п╩п╦я┤п╦п╫п╣,п╫п╬ п╫п╟п╦п╠п╬п╩п╣п╣   */
	       ZNSYM - T_BASR[I].SMESH < DELTA    /* п╠п╩п╦п╥п╨п╬п╣ п╨ я│п╪п╣я┴п╣п╫п╦я▌ п╡я┌п╬-*/
	     )                                    /* я─п╬пЁп╬ п╬п©п╣я─п╟п╫п╢п╟          */
	   {
	    NBASRG = I + 1;
	    DELTA  = ZNSYM - T_BASR[I].SMESH;
	   }
	 }
	if ( NBASRG == 0 || DELTA > 0xfff )       /*п╣я│п╩п╦ п╠п╟п╥.я─п╣пЁ.п╫п╣ п╡я▀п╠я─.,я┌п╬*/
	 return(5);                               /* п╥п╟п╡п╣я─я┬.п©п╬п╢п©я─.п©п╬ п╬я┬п╦п╠п╨п╣ */
	else                                      /*п╦п╫п╟я┤п╣                   */
	 {                                        /* я│я└п╬я─п╪п╦я─п╬п╡я▀п╟я┌я▄ п╪п╟я┬п╦п╫п╫п╬п╣ */
	  B2D2 = NBASRG << 12;                    /* п©я─п╣п╢я│я┌п╟п╡п╩п╣п╫п╦п╣ п╡я┌п╬я─п╬пЁп╬  */
	  B2D2 = B2D2 + DELTA;                    /* п╬п©п╣я─п╟п╫п╢п╟ п╡ п╡п╦п╢п╣ B2D2   */
	  PTR = (char *)&B2D2;                    /* п╦ п╡ я│п╬пЁп╩п╟я┬п╣п╫п╦я▐я┘ п∙п║ п╜п▓п° */
	  swab ( PTR , PTR , 2 );                 /* я│ п╥п╟п©п╦я│я▄я▌ п╡ я┌п╣п╩п╬ п╨п╬п╪-п╢я▀*/
	  RX.OP_RX.B2D2 = B2D2;
	 }
	goto SRX2;                                /*п©п╣я─п╣я┘.п╫п╟ я└п╬я─п╪.п©п╣я─п╡п╬пЁп╬   */
       }                                          /*  п╬п©я─п╣я─п╟п╫п╢п╟ п╪п╟я┬п╦п╫п╫п╬п╧ п╨п╬п╪*/
     }
    return(2);                                    /*я│п╬п╬п╠я┴."п╫п╣п╬п╠'я▐п╡п╩.п╦п╢п╣п╫я┌п╦я└"*/
   }
  else                                            /*п╦п╫п╟я┤п╣, п╠п╣я─п╣п╪ п╡ п╨п╟я┤п╣я│я┌п╡п╣ */
   {                                              /*п╡я┌п╬я─.п╬п©п╣я─п╟п╫п╢п╟ п╪п╟я┬п╦п╫п╫.п╨п╬п╪*/
    return(4);                                    /*п╥п╫п╟я┤п╣п╫.п╡я▀п╠я─.   п╩п╣п╨я│п╣п╪я▀  */
   }

 SRX2:

  RX.OP_RX.R1X2 = R1X2;                           /*п╢п╬п╥п╟п©п╦я│я▄ п©п╣я─п╡.п╬п©п╣я─п╟п╫п╢п╟  */

  STXT(4);                                        /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ TXT-п╨п╟я─я┌я▀  */
  return(0);                                      /*п╡я▀п╧я┌п╦ п╦п╥ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪я▀   */
 }
/*..........................................................................*/
int SOBJFILE()                                    /*п©п╬п╢п©я─п╬пЁя─.я└п╬я─п╪п╦я─.п╬п╠'п╣п╨п╫. */
 {                                                /*я└п╟п╧п╩п╟                   */
  FILE *fp;                                       /*п╫п╟п╠п╬я─ я─п╟п╠п╬я┤п╦я┘           */
  int RAB2;                                       /*п©п╣я─п╣п╪п╣п╫п╫я▀я┘              */
						  /*я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣ п©я┐я┌п╦ п╦ п╦п╪п╣-*/
  strcat ( NFIL , "tex" );                        /*п╫п╦ п╬п╠'п╣п╨я┌п╫п╬пЁп╬ я└п╟п╧п╩п╟     */
  if ( (fp = fopen ( NFIL , "wb" )) == NULL )     /*п©я─п╦ п╫п╣я┐п╢п╟я┤п╫.п╬я┌п╨я─я▀я┌.я└-п╩п╟ */
   return (-7);                                   /* я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬п╦п╠п╨п╣    */
  else                                            /*п╦п╫п╟я┤п╣:                  */
   RAB2 =fwrite (OBJTEXT, 80 , ITCARD , fp);      /* я└п╬я─п╪п╦я─я┐п╣п╪ я┌п╣п╩п╬ п╬п╠.я└п╟п╧п╩п╟*/
  fclose ( fp );                                  /*п╥п╟п╨я─я▀п╡п╟п╣п╪ п╬п╠'п╣п╨я┌п╫я▀п╧ я└п╟п╧п╩*/
  return ( RAB2 );                                /*п╥п╟п╡п╣я─я┬п╟п╣п╪  п©п╬п╢п©я─п╬пЁя─п╟п╪п╪я┐ */

 }
/*..........................................................................*/
void INITUNION ()
 {

/*
***** п╦ п╫ п╦ я├ п╦ п╟ п╩ п╦ п╥ п╟ я├ п╦ я▐   п©п╬п╩п╣п╧ п╠я┐я└п╣я─п╟ я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦я▐ п╥п╟п©п╦я│п╣п╧ ESD-я┌п╦п©п╟
*****                             п╢п╩я▐ п╡я▀я┘п╬п╢п╫п╬пЁп╬ п╬п╠я┼п╣п╨я┌п╫п╬пЁп╬ я└п╟п╧п╩п╟
*/

  ESD.STR_ESD.POLE1      =  0x02;
  memcpy ( ESD.STR_ESD.POLE2, "ESD", 3 );
  memset ( ESD.STR_ESD.POLE3,  0x40, 6 );
  ESD.STR_ESD.POLE31 [0] = 0x00;
  ESD.STR_ESD.POLE31 [1] = 0x10;
  memset ( ESD.STR_ESD.POLE32, 0x40, 2 );
  ESD.STR_ESD.POLE4  [0] = 0x00;
  ESD.STR_ESD.POLE4  [1] = 0x01;
  memset ( ESD.STR_ESD.IMPR,   0x40, 8 );
  ESD.STR_ESD.POLE6      = 0x00;
  memset ( ESD.STR_ESD.ADPRG,  0x00, 3 );
  ESD.STR_ESD.POLE8      = 0x40;
  memset ( ESD.STR_ESD.DLPRG,  0x00, 3 );
  memset ( ESD.STR_ESD.POLE10, 0x40,40 );
  memset ( ESD.STR_ESD.POLE11, 0x40, 8 );

/*
***** п╦ п╫ п╦ я├ п╦ п╟ п╩ п╦ п╥ п╟ я├ п╦ я▐   п©п╬п╩п╣п╧ п╠я┐я└п╣я─п╟ я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦я▐ п╥п╟п©п╦я│п╣п╧ TXT-я┌п╦п©п╟
*****                             п╢п╩я▐ п╡я▀я┘п╬п╢п╫п╬пЁп╬ п╬п╠я┼п╣п╨я┌п╫п╬пЁп╬ я└п╟п╧п╩п╟
*/

  TXT.STR_TXT.POLE1      =  0x02;
  memcpy ( TXT.STR_TXT.POLE2, "TXT", 3 );
  TXT.STR_TXT.POLE3      =  0x40;
  memset ( TXT.STR_TXT.ADOP,   0x00, 3 );
  memset ( TXT.STR_TXT.POLE5,  0x40, 2 );
  memset ( TXT.STR_TXT.DLNOP,  0X00, 2 );
  memset ( TXT.STR_TXT.POLE7,  0x40, 2 );
  TXT.STR_TXT.POLE71 [0] = 0x00;
  TXT.STR_TXT.POLE71 [1] = 0x01;
  memset ( TXT.STR_TXT.OPER,   0x40,56 );
  memset ( TXT.STR_TXT.POLE9,  0x40, 8 );

/*
***** п╦ п╫ п╦ я├ п╦ п╟ п╩ п╦ п╥ п╟ я├ п╦ я▐   п©п╬п╩п╣п╧ п╠я┐я└п╣я─п╟ я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦я▐ п╥п╟п©п╦я│п╣п╧ END-я┌п╦п©п╟
*****                             п╢п╩я▐ п╡я▀я┘п╬п╢п╫п╬пЁп╬ п╬п╠я┼п╣п╨я┌п╫п╬пЁп╬ я└п╟п╧п╩п╟
*/

  END.STR_END.POLE1      =  0x02;
  memcpy ( END.STR_END.POLE2, "END", 3 );
  memset ( END.STR_END.POLE3,  0x40,68 );
  memset ( END.STR_END.POLE9,  0x40, 8 );

 }

/*..........................................................................*/

int main( int argc, char **argv )                /*пЁп╩п╟п╡п╫п╟я▐ п©я─п╬пЁя─п╟п╪п╪п╟       */
 {
   FILE *fp;
   char *ptr = argv [1];
   unsigned char ASSTEXT [DL_ASSTEXT][80];

/*
******* п▒ п⌡ п· п   п╬п╠'я▐п╡п╩п╣п╫п╦п╧ я─п╟п╠п╬я┤п╦я┘ п©п╣я─п╣п╪п╣п╫п╫я▀я┘
*/

  int I1 , I2 , RAB;                              /* п©п╣я─п╣п╪п╣п╫п╫я▀п╣ я├п╦п╨п╩п╟      */

  INITUNION ();                                   /* п╫п╟я┤п╟п╩я▄п╫п╬п╣ п╥п╟п©п╬п╩п╫п╣п╫п╦п╣  */
						  /* п╠я┐я└п╣я─п╬п╡ я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦я▐  */
						  /* п╥п╟п©п╦я│п╣п╧ п╡я▀я┘п╬п╢п╫п╬пЁп╬ п╬п╠я┼-*/
						  /* п╣п╨я┌п╫п╬пЁп╬  я└п╟п╧п╩п╟        */

/*
******       п² п░ п╖ п░ п⌡ п·   п÷ п∙ п═ п▓ п· п⌠ п·  п÷ п═ п· п║ п° п· п╒ п═ п░      *****
*/
/*
***** п▒ п⌡ п· п   п╦п╫п╦я├п╦п╟п╩п╦п╥п╟я├п╦п╦ п╪п╟я│я│п╦п╡п╟ ASSTEXT, п╥п╟п╪п╣п╫я▐я▌я┴п╦п╧ п╦п╫п╦я├-я▌ п╡ п╬п╠'я▐п╡п╩п╣п╫п╦п╦
*****          (п╡п╡п╣п╢п╣п╫ п╨п╟п╨ я─п╣п╟п╨я├п╦я▐ п╫п╟ я┌я─п╣п╠п╬п╡п╟п╫п╦я▐ BORLANDC++ 2.0)
*/

  strcpy ( NFIL, ptr );

  if ( argc != 2 )

   {
    printf ( "%s\n", "п·я┬п╦п╠п╨п╟ п╡ п╨п╬п╪п╟п╫п╢п╫п╬п╧ я│я┌я─п╬п╨п╣" );
    return;
   }


  if ( strcmp ( &NFIL [ strlen ( NFIL )-3 ], "ass" ) )

   {
    printf ( "%s\n", "п²п╣п╡п╣я─п╫я▀п╧ я┌п╦п© я└п╟п╧п╩п╟ я│ п╦я│я┘п╬п╢п╫я▀п╪ я┌п╣п╨я│я┌п╬п╪" );
    return;
   }


  else

   {
    if ( (fp = fopen ( NFIL , "rb" )) == NULL )   /*п©я─п╦ п╫п╣я┐п╢п╟я┤п╫.п╬я┌п╨я─я▀я┌.я└-п╩п╟ */
						  /* я│п╬п╬п╠я┴п╣п╫п╦п╣ п╬п╠ п╬я┬п╦п╠п╨п╣    */
     {
      printf ( "%s\n", "п²п╣ п╫п╟п╧п╢п╣п╫ я└п╟п╧п╩ я│ п╦я│я┘п╬п╢п╫я▀п╪ я┌п╣п╨я│я┌п╬п╪" );
      return;
     }

    else

     {
      for ( I1 = 0; I1 <= DL_ASSTEXT; I1++ )

       {
	if ( !fread ( ASSTEXT [I1], 80, 1, fp ) )
	 {
	  if ( feof ( fp ) )
	   goto main1;
	  else
	   {
	    printf ( "%s\n", "п·я┬п╦п╠п╨п╟ п©я─п╦ я┤я┌п╣п╫п╦п╦ я└я▀п╧п╩п╟ я│ п╦я│я┘.я┌п╣п╨я│я┌п╬п╪" );
	    return;
	   }
	 }
       }

      printf ( "%s\n", "п÷п╣я─п╣п©п╬п╩п╫п╣п╫п╦п╣ п╠я┐я└п╣я─п╟ я┤я┌п╣п╫п╦я▐ п╦я│я┘.я┌п╣п╨я│я┌п╟" );
      return;
     }

   }

main1:

   fclose ( fp );
   NFIL [ strlen ( NFIL )-3 ] = '\x0';

/*
***** п  п· п² п∙ п╕ п╠п╩п╬п╨п╟ п╦п╫п╦я├п╦п╟п╩п╦п╥п╟я├п╦п╦
*/

  for ( I1=0; I1 < DL_ASSTEXT; I1++ )             /*п╢п╩я▐ п╨п╟я─я┌ я│ 1 п©п╬ п╨п╬п╫п╣я┤п╫я┐я▌*/
   {                                              /*                        */
    memcpy ( TEK_ISX_KARTA.BUFCARD , ASSTEXT[I1], /*я┤-я┌я▄ п╬я┤п╣я─п╣п╢п╫.п╨п╟я─я┌я┐ п╡ п╠я┐я└*/
					     80 );/*                        */
    if (TEK_ISX_KARTA.STRUCT_BUFCARD.METKA [0] == /*п©п╣я─п╣я┘п╬п╢ п©я─п╦ п╬я┌я│я┐я┌я│я┌п╡п╦п╦  */
					     ' ') /*п╪п╣я┌п╨п╦                   */
     goto CONT1;                                  /*п╫п╟ CONT1,               */
						  /*п╦п╫п╟я┤п╣:                  */
    ITSYM += 1;                                   /* п©п╣я─п╣я┘п╬п╢ п╨ я│п╩п╣п╢.я│я┌я─.TSYM*/
    PRNMET = 'Y';                                 /* я┐я│я┌п╟п╫.п©я─п╦п╥п╫.п╫п╟п╩п╦я┤.п╪п╣я┌п╨п╦*/
    memcpy ( T_SYM[ITSYM].IMSYM ,                 /* п╥п╟п©п╬п╪п╫п╦я┌я▄ п╦п╪я▐ я│п╦п╪п╡п╬п╩п╟  */
	TEK_ISX_KARTA.STRUCT_BUFCARD.METKA , 8 ); /* п╦                      */
    T_SYM[ITSYM].ZNSYM = CHADR;                   /* п╣пЁп╬ п╥п╫п╟я┤п╣п╫п╦п╣(п╬я┌п╫.п╟п╢я─.) */

/*
***** п▒ п⌡ п· п   п©п╬п╦я│п╨п╟ я┌п╣п╨я┐я┴п╣п╧ п╬п©п╣я─п╟я├п╦п╦ я│я─п╣п╢п╦ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦п╧
*/

   CONT1:

    for ( I2=0; I2 < NPOP; I2++ )                 /*п╢п╩я▐ п╡я│п╣я┘ я│я┌я─.я┌п╟п╠.п©я│.п╬п©п╣я─*/
     {                                            /*п╡я▀п©п╬п╩п╫п╦я┌я▄ я│п╩п╣п╢я┐я┴п╣п╣:     */
      if(                                         /* п╣я│п╩п╦                   */
      !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦я▐         */
	      T_POP[I2].MNCPOP , 5)               /* я─п╟я│п©п╬п╥п╫п╟п╫п╟,            */
	)                                         /* я┌п╬:                    */
						  /*                        */
       { switch ( T_POP[I2].BXPROG () )           /* я┐п╧я┌п╦ п╡ п©п╬п╢п©я─.п╬п╠я─п╟п╠п╬я┌п╨п╦ */
	 {
	  case 0:
	   goto CONT2;                            /* п╦ п╥п╟п╡п╣я─я┬п╦я┌я▄ я├п╦п╨п╩       */
	  case 1:
	   goto ERR1;
	  case 100:
	   goto CONT3;
	 }
       }                                          /*                        */
     }                                            /*                        */

    for ( I3=0; I3 < NOP ; I3++ )                 /*п╢п╩я▐ п╡я│п╣я┘ я│я┌я─.я┌п╟п╠.п╪.п╬п©п╣я─.*/
     {                                            /*п╡я▀п©п╬п╩п╫п╦я┌я▄ я│п╩п╣п╢я┐я▌я┴п╣п╣:    */
      if(                                         /* п╣я│п╩п╦                   */
      !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* п╪п╟я┬п╦п╫п╫п╟я▐ п╬п©п╣я─п╟я├п╦я▐      */
	      T_MOP[I3].MNCOP , 5)                /* я─п╟я│п©п╬п╥п╫п╟п╫п╟,            */
	)                                         /* я┌п╬:                    */
						  /*                        */
       {
	 T_MOP[I3].BXPROG ();                     /* я┐п╧я┌п╦ п╡ п©п╬п╢п©я─.п╬п╠я─п╟п╠п╬я┌п╨п╦ */
	 PRNMET = 'N';                            /* я│п╫я▐я┌я▄ п©я─п╦п╥п╫.п╫п╟п╩п╦я┤.п╪п╣я┌п╨п╦*/
	 goto CONT2;                              /* п╦ п╥п╟п╡п╣я─я┬п╦я┌я▄ я├п╦п╨п╩       */
       }
     }

    goto ERR3;                                    /*я│п╬п╬п╠я┴.'п╪п╫п╣п╪п╬п╨п╬п╢ п╫п╣я─п╟я│п©.'*/


 CONT2:
    continue;                                     /*п╨п╬п╫п╣я├ я├п╦п╨п╩п╟ п╬п╠я─п╟п╠п╬я┌п╨п╦   */
   }                                              /*п╨п╟я─я┌ п╦я│я┘.я┌п╣п╨я│я┌п╟         */


/*
******       п² п░ п╖ п░ п⌡ п·   п▓ п╒ п· п═ п· п⌠ п·  п÷ п═ п· п║ п° п· п╒ п═ п░      *****
*/

CONT3:

 T_MOP[0].BXPROG = SRR;                           /*я┐я│я┌п╟п╫п╬п╡п╦я┌я▄ я┐п╨п╟п╥п╟я┌п╣п╩п╦    */
 T_MOP[1].BXPROG = SRR;                           /*п╫п╟ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪я▀ п╬п╠я─п╟п╠-п╨п╦*/
 T_MOP[2].BXPROG = SRX;                           /*п╨п╬п╪п╟п╫п╢ п░п║п║п∙п°п▒п⌡п∙п═п░ п©я─п╦   */
 T_MOP[3].BXPROG = SRX;                           /*п╡я┌п╬я─п╬п╪ п©я─п╬я│п╪п╬я┌я─п╣        */
 T_MOP[4].BXPROG = SRX;
 T_MOP[5].BXPROG = SRX;

 T_POP[0].BXPROG = SDC;                           /*я┐я│я┌п╟п╫п╬п╡п╦я┌я▄ я┐п╨п╟п╥п╟я┌п╣п╩п╦    */
 T_POP[1].BXPROG = SDS;                           /*п╫п╟ п©п╬п╢п©я─п╬пЁя─п╟п╪п╪я▀ п╬п╠я─п╟п╠-п╨п╦*/
 T_POP[2].BXPROG = SEND;                          /*п©я│п╣п╡п╢п╬п╨п╬п╪п╟п╫п╢ п░п║п║п∙п°п▒п⌡п∙п═п░ */
 T_POP[3].BXPROG = SEQU;                          /*п©я─п╦ п╡я┌п╬я─п╬п╪ п©я─п╬я│п╪п╬я┌я─п╣    */
 T_POP[4].BXPROG = SSTART;
 T_POP[5].BXPROG = SUSING;

  for ( I1=0; I1 < DL_ASSTEXT; I1++ )             /*п╢п╩я▐ п╨п╟я─я┌ я│ 1 п©п╬ п╨п╬п╫п╣я┤п╫я┐я▌*/
   {     					  /*                        */
    memcpy ( TEK_ISX_KARTA.BUFCARD , ASSTEXT [I1],/*я┤-я┌я▄ п╬я┤п╣я─п╣п╢п╫.п╨п╟я─я┌я┐ п╡ п╠я┐я└*/
					     80 );/*                        */
/*
***** п▒ п⌡ п· п   п©п╬п╦я│п╨п╟ я┌п╣п╨я┐я┴п╣п╧ п╬п©п╣я─п╟я├п╦п╦ я│я─п╣п╢п╦ п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦п╧
*/

    for ( I2=0; I2 < NPOP; I2++ )                 /*п╢п╩я▐ п╡я│п╣я┘ я│я┌я─.я┌п╟п╠.п©я│.п╬п©п╣я─*/
     {                                            /*п╡я▀п©п╬п╩п╫п╦я┌я▄ я│п╩п╣п╢я┐я┴п╣п╣:     */
      if(                                         /* п╣я│п╩п╦                   */
      !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* п©я│п╣п╡п╢п╬п╬п©п╣я─п╟я├п╦я▐         */
	      T_POP[I2].MNCPOP , 5)               /* я─п╟я│п©п╬п╥п╫п╟п╫п╟,            */
	)                                         /* я┌п╬                     */
						  /*                        */
       { switch ( T_POP[I2].BXPROG () )           /* я┐п╧я┌п╦ п╡ п©п╬п╢п©я─.п╬п╠я─п╟п╠п╬я┌п╨п╦ */
	 {
	  case 0:
	   goto CONT4;                            /* п╦ п╥п╟п╡п╣я─я┬п╦я┌я▄ я├п╦п╨п╩       */
	  case 100:                               /*я┐п╧я┌п╦ п╫п╟ я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╣    */
	   goto CONT5;                            /*п╬п╠'п╣п╨я┌п╫п╬пЁп╬ я└п╟п╧п╩п╟        */
	 }
       }                                          /*                        */
     }                                            /*                        */

    for ( I3=0; I3 < NOP ; I3++ )                 /*п╢п╩я▐ п╡я│п╣я┘ я│я┌я─.я┌п╟п╠.п╪.п╬п©п╣я─.*/
     {                                            /*п╡я▀п©п╬п╩п╫п╦я┌я▄ я│п╩п╣п╢я┐я▌я┴п╣п╣:    */
      if(                                         /* п╣я│п╩п╦                   */
      !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* п╪п╟я┬п╦п╫п╫п╟я▐ п╬п©п╣я─п╟я├п╦я▐      */
	      T_MOP[I3].MNCOP , 5)                /* я─п╟я│п©п╬п╥п╫п╟п╫п╟             */
	)                                         /* я┌п╬                     */
						  /*                        */
       {
	 switch ( T_MOP[I3].BXPROG () )           /* я┐п╧я┌п╦ п╡ п©п╬п╢п©я─.п╬п╠я─п╟п╠п╬я┌п╨п╦ */
	  {
	   case 0:
	    goto CONT4;                           /* п╦ п╥п╟п╡п╣я─я┬п╦я┌я▄ я├п╦п╨п╩       */

	   case 2:                                /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤п╣я│п╨п╬п╣  */
	    goto ERR2;                            /*я│п╬п╬п╠я┴п╣п╫п╦п╣               */

	   case 4:                                /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤п╣я│п╨п╬п╣  */
	    goto ERR4;                            /*я│п╬п╬п╠я┴п╣п╫п╦п╣               */

	   case 5:                                /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤п╣я│п╨п╬п╣  */
	    goto ERR5;                            /*я│п╬п╬п╠я┴п╣п╫п╦п╣               */

	   case 6:                                /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤п╣я│п╨п╬п╣  */
	    goto ERR6;                            /*я│п╬п╬п╠я┴п╣п╫п╦п╣               */

	   case 7:                                /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤п╣я│п╨п╬п╣  */
	    goto ERR6;                            /*я│п╬п╬п╠я┴п╣п╫п╦п╣               */

	  }
	}

     }

 CONT4:
   continue;                                      /*п╨п╬п╫п╣я├ я├п╦п╨п╩п╟ п╬п╠я─п╟п╠п╬я┌п╨п╦   */
   }                                              /*п╨п╟я─я┌ п╦я│я┘.я┌п╣п╨я│я┌п╟         */

CONT5:

  if ( ITCARD == (RAB = SOBJFILE ()) )            /*п╣я│п╩п╦ п╡ п╬п╠'п╣п╨я┌п╫я▀п╧ я└п╟п╧п╩   */
						  /*п╡я▀п╡п╣п╢п╣п╫я▀ п╡я│п╣ п╨п╟я─я┌я▀, я┌п╬: */
   printf                                         /* я│п╬п╬п╠я┬п╣п╫п╦п╣ п╬п╠ я┐я│п©п╣я┬п╫п╬п╪  */
    (                                             /* п╥п╟п╡п╣я─я┬п╣п╫п╦п╦             */
     "%s\n",
     "я┐я│п©п╣я┬п╬п╣ п╥п╟п╡п╣я─я┬п╣п╫п╦п╣ я┌я─п╟п╫я│п╩я▐я├п╦п╦"
    );
  else                                            /*п╦п╫п╟я┤п╣:                  */
   {
    if ( RAB == -7 )
     goto ERR7;
    else
     printf                                       /* я│п╬п╬п╠я┬п╣п╫п╦п╣ п╬ п╫п╣я┐п╢п╟я┤п╫п╬п╪  */
      (                                           /* я└я─п╪п╦я─п╬п╡п╟п╫п╦п╦ п╬п╠'п╣п╨я┌п╫п╬пЁп╬ */
       "%s\n",                                    /* я└п╟п╧п╩п╟                  */
       "п╬я┬п╦п╠п╨п╟ п©я─п╦ я└п╬я─п╪п╦я─п╬п╡п╟п╫п╦п╦ п╬п╠'п╣п╨я┌п╫п╬пЁп╬ я└п╟п╧п╩п╟"
      );
   }
    return;                                       /*п╥п╟п╡п╣я─я┬п╦я┌я▄ main-п©я─п╬пЁя─.   */

ERR1:
  printf ("%s\n","п╬я┬п╦п╠п╨п╟ я└п╬я─п╪п╟я┌п╟ п╢п╟п╫п╫я▀я┘");        /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤.я│п╬п╬п╠я┴.*/
  goto CONT6;

ERR2:
  printf ("%s\n","п╫п╣п╬п╠'я▐п╡п╩п╣п╫п╫я▀п╧ п╦п╢п╣п╫я┌п╦я└п╦п╨п╟я┌п╬я─");  /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤.я│п╬п╬п╠я┴.*/
  goto CONT6;

ERR3:
  printf ("%s\n","п╬я┬п╦п╠п╨п╟ п╨п╬п╢п╟ п╬п©п╣я─п╟я├п╦п╦");         /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤.я│п╬п╬п╠я┴.*/
  goto CONT6;

ERR4:
  printf ("%s\n","п╬я┬п╦п╠п╨п╟ п╡я┌п╬я─п╬пЁп╬ п╬п©п╣я─п╟п╫п╢п╟");      /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤.я│п╬п╬п╠я┴.*/
  goto CONT6;

ERR5:
  printf ("%s\n","п╬я┬п╦п╠п╨п╟ п╠п╟п╥п╦я─п╬п╡п╟п╫п╦я▐");           /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤.я│п╬п╬п╠я┴.*/
  goto CONT6;

ERR6:
  printf ("%s\n","п╫п╣п╢п╬п©я┐я│я┌п╦п╪я▀п╧ п╫п╬п╪п╣я─ я─п╣пЁп╦я│я┌я─п╟");  /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤.я│п╬п╬п╠я┴.*/
  goto CONT6;

ERR7:
  printf ("%s\n","п╬я┬п╦п╠п╨п╟ п╬я┌п╨я─я▀я┌п╦я▐ п╬п╠'п╣п╨я┌п╫.я└п╟п╧п╩п╟");/*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤.я│п╬п╬п╠я┴.*/
  goto CONT6;


CONT6:
  printf ("%s%d\n","п╬я┬п╦п╠п╨п╟ п╡ п╨п╟я─я┌п╣ N ",I1+1);     /*п╡я▀п╢п╟я┌я▄ п╢п╦п╟пЁп╫п╬я│я┌п╦я┤.я│п╬п╬п╠я┴.*/

 return 0;
 }                                                /*п╨п╬п╫п╣я├ main-п©я─п╬пЁя─п╟п╪п╪я▀    */

